[
    {
        "rating": "91",
        "roaster": "Lexington Coffee Roasters",
        "title": "Waykan Guatemala",
        "blind_assessment": "Gently crisp, cedary, complex. Tobacco-toned cedar (think cigar humidor), vanilla, raw sugar, narcissus-like flowers in aroma and cup. Brisk, dry acidity; lightly syrupy mouthfeel. Vanilla, flowers and cedar carry into a resonant finish.",
        "notes": "The word ‘Waykan’ means ‘shining star in the night sky’ in the Mayan Q'qnjobal dialect from Huehuetenango. This coffee comes from small-holder coffee farmers in the Quiché growing region. Founded in 1990, Lexington Coffee is an award-winning artisan roasting company based in Virginia. Lexington’s focus on fresh, flavorful and sustainable coffee is reflected in its motto, “Fresh, Flavorful & Fair.” Visit www.lexingtoncoffee.com or call 800-322-6505 for more information.",
        "bottom_line": null,
        "roaster location": "Lexington, Virginia",
        "coffee origin": "Quiche Department, Guatemala.",
        "roast level": "Medium-Light",
        "agtron": "55/77",
        "est. price": "$13.95/12 ounces",
        "review date": "August 2015",
        "aroma": "9",
        "acidity": "7",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "RamsHead Coffee Roasters",
        "title": "Backwoods Espresso",
        "blind_assessment": "Evaluated as espresso. Rich-toned, deeply chocolaty. Dark chocolate, agave syrup, pomegranate nectar, almond brittle, cedar in aroma and small cup. Crisp, syrupy mouthfeel; chocolaty-sweet finish with undertones of almond and cedar. In cappuccino-scaled milk, dark chocolate notes dominate and a freesia-like spicy floral note emerges.",
        "notes": "A blend of two coffees processed by the traditional washed method (fruit skin and flesh are removed from the beans before they are dried), one from Hacienda La Minita in Costa Rica and the second from Menendez Estate farms in El Salvador. RamsHead Coffee Roasters is a family-owned company founded by Bozeman, Montana natives Caleb and Laura Walker that specializes in direct trade microlot coffees. For more information, visit www.ramsheadcoffee.com.",
        "bottom_line": "An aromatic, sweet-toned, deeply chocolaty espresso blend driven by tart fruit and rich nut tones, with an added layer of complexity from spicy florals in three parts milk.",
        "roaster location": "Bozeman, Montana",
        "coffee origin": "Costa Rica, El Salvador",
        "roast level": "Medium",
        "agtron": "50/64",
        "est. price": "$17.50/12 ounces",
        "review date": "October 2022",
        "aroma": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "70",
        "roaster": "Tamer International",
        "title": "Tamer Low Acid Coffee Beans, Regular",
        "blind_assessment": "Flat, dull, with a heavy, tongue-coating bitterness. The only identifiable flavor note is rubber. Beans are coated after roasting with acid-neutralizing agents, including potassium (but not including aluminum). “Full flavor — less acid!” exclaims the bag copy.",
        "notes": "Flat, dull, with a heavy, tongue-coating bitterness. The only identifiable flavor note is rubber. Beans are coated after roasting with acid-neutralizing agents, including potassium (but not including aluminum). \"Full flavor -- less acid!\" exclaims the bag copy.",
        "bottom_line": null,
        "roaster location": "Seattle, Washington",
        "roast level": "NA",
        "agtron": "/",
        "review date": "December 2000",
        "aroma": "5",
        "acidity": "Very Low",
        "body": "8",
        "flavor": "3"
    },
    {
        "rating": "94",
        "roaster": "Klatch Coffee",
        "title": "Colombia Monteblanco Rodrigo Sanchez Carbonic Maceration",
        "blind_assessment": "Subtly suave, brightly juicy anaerobic. Rose, strawberry, cocoa, pink lemonade, yogurt in aroma and cup. A juicy floral acidity dominates in structure, deepened by a hint of savory depth. Lightly silky, lively mouthfeel. Strawberry and cocoa give way to flowers in a drying finish.",
        "notes": "Produced by Rodrigo Sanchez of Finca Monteblanco from trees of the Caturra and Bourbon varieties of Arabica, and processed by a carbonic maceration method involving two fermentation phases in closed tanks injected with CO2. The first fermentation involves the whole coffee fruit, after which the skins and pulp are removed and the beans are fermented a second time with their skins and juice, after which they are washed and dried. Klatch Coffee is an award-winning small-batch roasting company in the Los Angeles area whose resident barista and trainer, Heather Perry, won both the 2003 and 2007 United States Barista Championships brewing a Klatch Coffee espresso blend. Visit www.klatchroasting.com or call 877-455-2824 for more information.",
        "bottom_line": "A light-footed and balanced anaerobic cup, floral without perfumy excess, cleanly fruit-toned and silky in texture.",
        "roaster location": "Los Angeles, California",
        "coffee origin": "Huila Department, Colombia",
        "roast level": "Light",
        "agtron": "56/86",
        "est. price": "$23.95/310 grams",
        "review date": "March 2023",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "86",
        "roaster": "Ancora Coffee Roasters",
        "title": "Ethiopia Washed Yirgacheffe Horse",
        "blind_assessment": "A dark-roast presentation with a splendid aroma: intense, crisply dry and fruity. In the cup, however, the roast dominates, though patient drinkers will feel a sweet, lush fruitiness behind the roasty bitterness. The halo of fruit persists in the cleanly roasty finish.",
        "notes": "Yirgacheffe is the most lavishly fruity and floral of the several fruity and floral wet-processed regional origins in southern and western Ethiopia. The \"Horse\" designation derives from the exporter's coffee bag logo. Besides pursuing the \"Small Batch Artisan Roasting\" it proclaims in its motto, Ancora Coffee Roasters operates both a well-known Madison, Wisconsin coffee house and a colorful and engaging Website. Visit www.ancora-coffee.com or call 800-260-0217 for more info.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia",
        "roast level": "Dark",
        "agtron": "43/38",
        "review date": "September 2002",
        "aroma": "9",
        "acidity": "na",
        "body": "7",
        "flavor": "7"
    },
    {
        "rating": "92",
        "roaster": "Papa Lin's Coffee Roasting",
        "title": "Brazil Fazenda Furnas Natural",
        "blind_assessment": "Sweet, rich, slightly fermenty. Blueberry, chocolate, fresh-cut cedar, sweet narcissus-like flowers in aroma and cup. Round, gently rich acidity; syrupy mouthfeel. Flavor carries persuasively into a sweet-toned though slightly dry finish.",
        "notes": "The term natural means this coffee was dried inside the entire fruit rather than after the fruit was removed. Most Brazil coffee is dried inside the fruit, but this natural Brazil shows a particularly ripe fruit character that is not generally typical for the Brazil versions of the type. Papa Lin's Coffee Roasting is a small, “nano” roaster located in Yorktown Heights, New York, focusing on carefully sourced, extremely high quality specialty coffees, which are custom roasted to the preference of every customer. Visit www.papalins.com for more information.",
        "bottom_line": null,
        "roaster location": "Yorktown Heights, New York",
        "coffee origin": "Carmo de Minas growing region, Minas Gerais State, Brazil",
        "roast level": "Medium",
        "agtron": "54/64",
        "est. price": "$18.00/12 ounces",
        "review date": "March 2014",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Conscious Coffee",
        "title": "Organic Guatemala",
        "blind_assessment": "Deep and rich, with a pungent dark chocolate and nut complex dominating aroma and flavor. The acidity is particularly complex and pleasing: fluent, buoyant, delicately bright but rich. A pronounced bittersweet, chocolate-infused, fruit-like character lingers deeply into the finish.",
        "notes": "Certified organically grown by the Rio Azul Cooperative. Although a logo for \"FairTradeProof.org\" appears on the label of the attractive 12-ounce valve-topped can, the absence of the trademarked Fair Trade seal indicates this coffee is not certified by TransFair USA, the sole American certifier for the Fair Trade Labeling Organizations International (FLO). Conscious Coffee is, however, affiliated with the buyers' group Cooperative Coffees as well as the Fair Trade Federation, a membership (rather than certifying) organization devoted to \"providing fair wages and good employment opportunities to economically disadvantaged artisans and farmers worldwide.\" Conscious Coffee is a wholesale roasting company focused on organic single-origin coffees and direct trade relationships with growers. It is committed to low impact business practices and \"supporting communities, not commodities.\" Visit www.consciouscoffees.com or call 800-365-8616 for more information.",
        "bottom_line": null,
        "roaster location": "Boulder, Colorado",
        "coffee origin": "Huehuetenango growing region, Guatemala.",
        "roast level": "Medium",
        "agtron": "47/60",
        "est. price": "$12.00/12 oz.",
        "review date": "October 2010",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "91",
        "roaster": "Manzanita Roasting Company",
        "title": "El Salvador Anny Ruth’s Red Honey Loma La Loria",
        "blind_assessment": "Deeply and sweetly pungent. Dark chocolate, apple, fresh-cut cedar, cherry blossom in aroma and cup. Crisp, juicy acidity; syrupy mouthfeel. Cherry blossom and cedar dominate in the gently drying finish.",
        "notes": "Produced by Anny Pimental entirely from trees of the heirloom Bourbon variety of Arabica and processed by the red honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. In the red honey variation, all or almost all of the pulp is allowed to dry on the beans, rather than only a portion of it, as would be the case with yellow honey. This coffee tied for the second-highest rating in a cupping of honey-processed coffees for Coffee Review‘s August 2016 tasting report. Husband and wife team Samantha and Weston Nawrocki founded Manzanita Roasting on their family’s 127-year-old winery in San Diego. Committed to quality direct-trade sourcing and skillful roasting, they are happy to be a part of what they call San Diego’s new “coffee frontier.” Wholesale, retail and online sales. Visit www.manzanitaroasting.com for more information.",
        "bottom_line": "A solid, satisfying cup, cedary and deep.",
        "roaster location": "San Diego, California",
        "coffee origin": "El Boquerón region, El Salvador",
        "roast level": "Light",
        "agtron": "66/94",
        "est. price": "$17.00/12 ounces",
        "review date": "August 2016",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "The Roasterie",
        "title": "Sumatra Organic",
        "blind_assessment": "A rather dark roast develops charred fir, roasted nut, dark chocolate and pungent grapefruit notes in both aroma and cup. Roast-muted acidity, syrupy if slightly rough mouthfeel, good sweetness and flavor in the short finish, fading to a mild herby astringency in the long.",
        "notes": "Certified organically grown and Fair Trade, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. The Roasterie is a leading, quality-oriented specialty roaster that specializes in building ongoing relationships with growers and emphasizes its commitment to \"air roasting,\" a technology utilizing a column of hot air rather than the conventional turning drum to agitate the roasting beans. Visit www.theroasterie.com or call 800-376-0245 for more information.",
        "bottom_line": null,
        "roaster location": "Kansas City, Missouri",
        "coffee origin": "Mandheling growing region, northern Sumatra, Indonesia.",
        "roast level": "Medium-Dark",
        "agtron": "38/55",
        "review date": "November 2009",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "92",
        "roaster": "Cafe Grumpy",
        "title": "Bolivia Familia Miranda",
        "blind_assessment": "Complete, balanced structure, complex aromatics, classic. Deep, sweet-toned aroma: lemon, orange, nut. In the cup gently bright, fruit- and fir-nuanced acidity; lightly syrupy mouthfeel. Continued lemon, orange and nut notes with a rounding suggestion of stone fruit. Rich, long, flavor-saturated finish.",
        "notes": "Grown on the twenty-acre family farm of Bertha Boyan de Miranda. An integral part of New York’s coffee renaissance, Brooklyn based Café Grumpy opened its first café in 2005 and has since expanded to four locations, including their own roasting facility. Visit www.cafegrumpy.com or call 718-383-0748 for more information.",
        "bottom_line": null,
        "roaster location": "Brooklyn, New York",
        "coffee origin": "La Paz Department, Bolivia.",
        "roast level": "Medium",
        "agtron": "54/67",
        "est. price": "$18.00/12 ounces",
        "review date": "March 2011",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "Simon Hsieh Aroma Roast Coffees",
        "title": "Taiwan Alishan Espresso Pacamara Natural",
        "blind_assessment": "Evaluated as espresso. Crisply chocolaty, delicately fruit-forward. Goji berry, lemon balm, baking chocolate, cedar, magnolia in aroma and small cup. Creamy-smooth mouthfeel; crisply chocolaty finish supported by notes of lemon balm and cedar. In three parts milk, sweet herb tones are usurped by rich chocolate and goji berry.",
        "notes": "Produced by Zhou-Zhu-Yuan entirely of the bold-beaned Pacamara variety of Arabica, and processed by the natural method (beans are dried in the whole fruit). In addition to his retail roasting operation, Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purpose-built commercial espresso blends and high-quality single-origin coffees. Customers can also visit the new showroom, Chateau Andy, in Taipei City. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": "An integrated, restrained natural-processed Taiwan cup roasted for espresso, with leading notes of delicate red fruit and crisp chocolate throughout.",
        "roaster location": "Taoyuan, Taiwan",
        "coffee origin": "Alishan Township, Chiayi County, Taiwan",
        "roast level": "Medium",
        "agtron": "48/67",
        "est. price": "NT $2300/230 grams",
        "review date": "September 2022",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "JBC Coffee Roasters",
        "title": "Huye Mountain Rwanda",
        "blind_assessment": "Fruit- and cocoa-toned. Raspberry, cocoa nib, thyme, cedar, agave syrup in aroma and cup. Sweet-toned structure with even-keeled acidity; plush, very syrupy mouthfeel. Jammy, herbaceous finish.",
        "notes": "Produced by smallholding farmers surrounding Huye Mountain Washing Station, entirely of the Red Bourbon variety of Arabica, and processed by the traditional washed method (fruit skin and flesh are removed from the beans before they are dried). JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A confident, familiar, satisfying Rwanda with notes of red berry up front, complicated by pleasing bittersweet citrus and crisp cocoa nib throughout.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Huye District, Rwanda",
        "roast level": "Medium-Light",
        "agtron": "59/75",
        "est. price": "$19.00/12 ounces",
        "review date": "May 2023",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "84",
        "roaster": "Jeremiah's Pick Gourmet Coffee",
        "title": "Decaf Pure Mocha Java",
        "blind_assessment": "The bittersweet tang of the dark roast almost overwhelms the coffee, but agreeable if subdued wine-toned fruit notes survive. The finish flirts with the burned rubber sensation of faulty roasting, but the innate sweetness of the coffee prevails and turns the dubious taste vaguely but agreeably chocolate.",
        "notes": "The bittersweet tang of the dark roast almost overwhelms the coffee, but agreeable if subdued wine-toned fruit notes survive. Mocha Java, the world 's oldest blend, originally combined Yemen coffee shipped through the ancient port of Mocha with coffee from Java. This blend is a contemporary take on the traditional recipe that replaces the Java with Sumatra and the Yemen with a v",
        "bottom_line": null,
        "roaster location": "San Francisco, California",
        "roast level": "NA",
        "agtron": "/",
        "review date": "March 2000",
        "aroma": "7",
        "acidity": "6",
        "body": "7",
        "flavor": "7"
    },
    {
        "rating": "93",
        "roaster": "Bird Rock Coffee Roasters",
        "title": "El Salvador Las Mercedes La Avila",
        "blind_assessment": "Rich-toned, chocolaty and floral. Baking chocolate, honeysuckle, lemon verbena, almond butter, cedar in aroma and cup. Sweet-tart structure with bright, juicy acidity; satiny-smooth mouthfeel. Chocolate up front in the short finish, followed by almond and lemon verbena in the long.",
        "notes": "This coffee tied for the second-highest rating in a cupping of washed-process coffees from Central America and Mexico for Coffee Review’s September 2020 report. Produced by Lucia Ortiz at Finca Las Mercedes from trees of the SL28 and Bourbon varieties of Arabica and processed by the washed method. Bird Rock Coffee Roasters is a retailer and wholesaler focused on organic and socially responsible coffees; it was awarded the “2012 Micro-Roaster of the Year” title by Roast Magazine. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.",
        "bottom_line": "A satisfyingly chocolaty El Salvador cup complicated by layers of floral and sweet herb notes.",
        "roaster location": "San Diego, California",
        "coffee origin": "Tecapa Chinameca growing region, El Salvador",
        "roast level": "Medium-Light",
        "agtron": "56/72",
        "est. price": "$18.00/12 ounces",
        "review date": "September 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "Flying Goat Coffee",
        "title": "Brazil Mogiana Bourbon “Safira”",
        "blind_assessment": "Smooth, medium-to-full bodied and richly balanced in the small cup, discreetly complicated by crisp leather and dry chocolate notes. Slightly astringent in the finish. Milk amplifies the dry chocolate tones, which turn hearty and bittersweet in short milk drinks and voluptuously sweet in taller. (87 straight espresso, 88 w/milk)",
        "notes": "That espresso is best brewed from a blend of beans from different origins is a truism among coffee professionals, and one that is generally supported by experience. However, there are some origins that, on their own, lend themselves particularly well to espresso brewing. The low acidity, natural sweetness and rich bottom notes of many dry-processed Brazils like this one make this origin one of the prime candidates for single-origin espresso. This tactfully roasted version from Flying Goat Coffee makes a fine and versatile cup. Visit www.flyinggoatcoffee.com or call 1-800-675-3599 for more info.",
        "bottom_line": null,
        "roaster location": "Healdsburg, California",
        "coffee origin": "Mogiana growing region, Sao Paulo State, Brazil",
        "roast level": "Medium-Dark",
        "agtron": "43/44",
        "review date": "April 2002",
        "aroma": "7",
        "body": "8",
        "flavor": "8",
        "with milk": "7"
    },
    {
        "rating": "92",
        "roaster": "Manzanita Roasting Company",
        "title": "Colombia David Gomez 100% Caturra",
        "blind_assessment": "Crisply sweet, spice-toned. Dried papaya, caramel, tangerine zest, pink-peppercorn, vanilla in aroma and cup. High-toned, sweetly tart in structure with juicy, bright acidity; lean, though satiny-smooth mouthfeel. The resonant, richly drying finish is laden with sweet notes of caramel and papaya in the short, turning more savory-leaning in the long, with hints of pink peppercorn wrapped in vanilla.",
        "notes": "Produced by David Gomez of of El Balso Farm entirely from trees of the Caturra variety of Arabica. Like almost all Colombia coffees, this coffee is wet-processed or “washed,” meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Huila is one of Colombia’s most respected coffee-growing regions. Husband and wife team Samantha and Weston Nawrocki founded Manzanita Roasting on their family’s 127-year-old winery in San Diego. Committed to quality direct-trade sourcing and skillful roasting, they are happy to be a part of what they call San Diego’s new “coffee frontier.” Visit www.manzanitaroasting.com for more information.",
        "bottom_line": "Engaging Colombia cup with impressively juicy, bright acidity and zesty, spice-toned aromatics.",
        "roaster location": "San Diego, California",
        "coffee origin": "Huila Department, southern Colombia",
        "roast level": "Light",
        "agtron": "63/85",
        "est. price": "$17.00/12 ounces",
        "review date": "January 2018",
        "aroma": "8",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Revel Coffee",
        "title": "Colombia Finca Juan Martin Aced Sidra",
        "blind_assessment": "Intensely fruit- and floral-toned. Passionfruit, star jasmine, pink grapefruit zest, amber, salted caramel in aroma and cup. Richly bittersweet structure with balanced, juicy acidity; plush, syrupy mouthfeel. Resonant, lingering, flavor-saturated finish.",
        "notes": "Produced by Juan Martin, entirely of the Sidra variety of Arabica, and processed by the natural method (dried in the whole fruit). Revel Coffee is a micro-roaster located in Billings, Montana. Its motto: “Quality is paramount – a difference you can revel in.” Visit www.revelcoffee.com or call 406-534-9621 for more information.",
        "bottom_line": "A gorgeous presentation of the rare and admired Sidra variety — natural-processed to amplify fruit and florals — juicy, bright, balanced.",
        "roaster location": "Billings, Montana",
        "coffee origin": "Cauca, Colombia",
        "roast level": "Light",
        "agtron": "62/80",
        "est. price": "$31.50/12 ounces",
        "review date": "March 2023",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "GK Coffee",
        "title": "Dadaocheng Garden Blend Espresso",
        "blind_assessment": "Evaluated as espresso. Rich-toned, fruit-forward and chocolaty. Chocolate fudge, dried apricot, almond paste, sandalwood, molasses in aroma and small cup. Viscous, syrupy mouthfeel; a resonant finish centers around chocolate fudge and dried apricot. In three parts milk, almost dessert-like in its richness.",
        "notes": "A blend of coffees from Yirgacheffe and Sidama, Ethiopia and Guatemala roasted for espresso and created for DG Cafe in Taipei, Taiwan. GK Coffee provides quality specialty coffee to consumers and retailers. For more information, visit www.gkcoffee.com.tw or email [email protected].",
        "bottom_line": "A balanced, bright, juicy espresso. Chocolate and dried stone fruit are the throughlines, both particularly amplified in three parts milk.",
        "roaster location": "Yilan, Taiwan",
        "coffee origin": "Ethiopia; Guatemala",
        "roast level": "Medium",
        "agtron": "52/68",
        "est. price": "NT $350/200 grams",
        "review date": "February 2020",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "90",
        "roaster": "Coava Coffee Roasters",
        "title": "Brasil Fazenda Chapadao de Ferro",
        "blind_assessment": "Round, aromatic sweetness, highlighted by candied nut and caramel. A delicate cup, with balanced acidity, soft mouthfeel, and continued sweet nut complemented by softer citrus and chocolate nuance.  All carry into the finish along with a hint of aromatic wood.",
        "notes": "Processed by the pulped natural method, meaning the skin is removed from the coffee fruit immediately after picking, but the seeds or beans are dried with the sweet pulp, or fruit flesh, still adhering to them. Chapadao de Ferro or \"Plateau of Iron\" no doubt received its name because of the soil's rich iron content. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Patrocinio area, Minas Gerais State, Brazil.",
        "roast level": "Medium-Light",
        "agtron": "53/73",
        "est. price": "$9.25 / 250 g. (8.8 oz.)",
        "review date": "April 2010",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Java Blend Coffee Roasters",
        "title": "Sulawesi Tana Toraja",
        "blind_assessment": "Deep, round, gently bright. Aprium, malt, lily-like flowers, baker’s chocolate, a hint of moist fallen leaves in aroma and cup. Sweet-toned, softly tart acidity; light, buoyant mouthfeel. Flavor consolidates in a long, sweet, very slightly drying finish.",
        "notes": "This coffee originates from the Toarco (TOraja ARabica COffee) project in the famous Sulawesi coffee growing region of Toraja, a project developed and financed by Japan’s Key Coffee Company and its Indonesian partners. Until recently Toarco sold its entire production to the Japanese market, making this coffee rare in the United States. Toarco exports both conventionally washed coffee and wet-hulled coffee; this sample represents the latter. Java Blend Coffee Roasters is a small batch roasting company owned and operated by the same family since 1938. It custom-roasts and delivers coffee within two days of ordering throughout most of the Maritime Provinces of Canada. Visit www.javablendcoffee.com or call 877-596-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Halifax, Nova Scotia, Canada",
        "coffee origin": "Toraja growing region, South Sulawesi, Indonesia.",
        "roast level": "Medium",
        "agtron": "51/66",
        "est. price": "$15.00/16 ounces",
        "review date": "April 2015",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Parisi Artisan Coffee",
        "title": "Parisi Espresso",
        "blind_assessment": "Evaluated as espresso. Zesty and rich-toned. Cocoa, orange-zest, apricot, night flowers, cumin and licorice in aroma and small cup. Smooth and lightly syrupy mouthfeel. Richly drying finish with prominent notes of licorice and cumin. Quietly resonant and still zesty in three-parts milk.",
        "notes": "Parisi Artisan Coffee is the specialty coffee division of Paris Brothers Specialty Foods, a family-owned business involved in many aspects of the food and beverage industry, including manufacturing, importing and distributing of a wide variety of specialty foods. Visit www.parisicoffee.com or call 816-842-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Kansas City, Missouri",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium-Light",
        "agtron": "58/71",
        "est. price": "$15.00/12 ounces",
        "review date": "December 2014",
        "aroma": "8",
        "body": "9",
        "flavor": "8",
        "aftertaste": "8",
        "with milk": "8"
    },
    {
        "rating": "93",
        "roaster": "Lee Dong Coffee",
        "title": "Colombia Cauca Finca El Paraiso Double Anaerobic Flor Lichi",
        "blind_assessment": "Tropical fruit-toned. Mango, orange zest, dark chocolate, marjoram, oak in aroma and cup. Very sweet structure with brisk acidity; plush, syrupy mouthfeel. Chocolaty, fruity finish.",
        "notes": "Produced by Diego Bermudez of Finca al Paraiso, from trees of the Castillo, Colombia and Caturra varieties of Arabica, and processed by the double-anaerobi washed method, in which the coffee fruit, after having been first sanitized with ozone, undergoes two stages of fermentation. First, the whole cherries are submerged under water for 48 hours, then the beans are pulped and fermented with a strain of Lactobacillus for 24 hours. After fermentation, the beans are given a “thermal shock” using hot and cold rinses to help the beans absorb the fermentation metabolites and halt any further fermentation. Afterward, the washed parchment coffee is rapidly dried with an in-house designed Eco-Enigma dehumidifying dryer to avoid over-oxidation or continued fermentation. Lee Dong Coffee is a specialty coffee roaster and cafe in Taichung, Taiwan. Visit www.facebook.com/LiDongcoffee/ for more information.",
        "bottom_line": "A tropically fruity anaerobic Colombia with undertones of dark chocolate throughout.",
        "roaster location": "Taichung, Taiwan",
        "coffee origin": "Cauca Department, Colombia",
        "roast level": "Light",
        "agtron": "66/84",
        "est. price": "NT $520/8 ounces",
        "review date": "October 2023",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "RamsHead Coffee Roasters",
        "title": "Nicaragua La Bastilla Estate Anaerobic",
        "blind_assessment": "Deeply lactic-sweet, rich-toned. Bubblegum, rhododendron, cocoa nib, fresh leather, grape candy in aroma and cup. Richly bittersweet structure with tangy, lactic acidity; delicate, lightly syrupy mouthfeel. The sweet, long finish consolidates to notes of bubblegum and cocoa nib with undertones of rhododendron.",
        "notes": "Produced at La Bastilla Coffee Estate and processed by the anaerobic natural method, in which the whole fruit is fermented in a hermetically sealed vessel before drying. RamsHead Coffee Roasters is a family-owned company founded by Bozeman, Montana natives Caleb and Laura Walker that specializes in direct trade microlot coffees. For more information, visit www.ramsheadcoffee.com.",
        "bottom_line": "A uniquely composed anaerobic Nicaragua cup with a decidedly lactic tang and candy notes layered with more traditional floral and earth tones.",
        "roaster location": "Bozeman, Montana",
        "coffee origin": "Jinotega, Nicaragua",
        "roast level": "Medium-Light",
        "agtron": "57/74",
        "est. price": "$17.50/12 ounces",
        "review date": "August 2022",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "CafeTaster",
        "title": "Colombia Laderas del Tapias Estate Natural Geisha",
        "blind_assessment": "Crisply sweet-tart, fruit-toned. Blackberry jam, cocoa powder, almond, narcissus, baking spices in aroma and cup. Sweetly tart structure with bright, fruit-forward acdity; lively, satiny mouthfeel. The finish consolidates to notes of blackberry and cocoa.",
        "notes": "This coffee tied for the fourth-highest rating in a cupping of coffees of the Geisha/Gesha variety of Arabica for Coffee Review’s September 2019 tasting report. Produced at Laderas del Tapias Estate entirely of the Geisha variety of Arabica. This is a dry-processed or “natural” version, meaning the beans were dried inside the fruit rather than after the soft fruit residue has been removed, as is the case with wet-processed or “washed” coffees. CafeTaster is a Taiwan-based specialty roaster and certified SCA training facility. For more information, visit www.facebook.com/cafetaster or email roaster Jerry Huang at [email protected].",
        "bottom_line": "A deep berry-toned cup with a juicy hint of sweet ferment and rich cocoa notes throughout.",
        "roaster location": "I-Lan City, Taiwan",
        "coffee origin": "Neira, Caldas Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "52/70",
        "est. price": "NT $1350/230 grams",
        "review date": "September 2019",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "92",
        "roaster": "Chocolate Fish Coffee Roasters",
        "title": "Finca San Luis Colombia",
        "blind_assessment": "Complex and deeply sweet. Apricot, dark chocolate, hazelnut, narcissus, an Oolong tea suggestion in aroma and cup. Juicy, gently tart acidity; plush, syrupy mouthfeel. Cocoa-toned and savory in the short finish, richly drying in the long.",
        "notes": "Farmer Omar Arango is a member of the Cafinorte Orgánico Coop and processes his coffees at his own mill located on the grounds of Finca San Luis. This is a washed coffee, meaning that the skin and fruit pulp were removed or “washed” from the beans before they were dried. Chocolate Fish is a distinguished New-Zealand-inspired micro-roaster based in Sacramento California, focused on the best in both quality and integrity.Visit www.chocolatefishcoffee.com or call 916-451-5181 for more information.",
        "bottom_line": null,
        "roaster location": "Sacramento, California",
        "coffee origin": "Libano, Tolima Department, Colombia",
        "roast level": "Light",
        "agtron": "86/65",
        "est. price": "$17.50/12 ounces",
        "review date": "December 2015",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Coava Coffee Roasters",
        "title": "Colombia Progreso",
        "blind_assessment": "Crisply balanced with a shifting, tight-knit complexity. Flowers, nut, fir, and a dark chocolaty fruit in aroma and cup.  The flowers and chocolate carry long into the finish. Gentle acidity, silkily smooth mouthfeel.",
        "notes": "Huila is probably the most admired of Colombia coffee growing regions; this small lot was grown by farmer Julio Medina and is made up of the Caturra variety of Arabica. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Huila Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "61/69",
        "est. price": "$13.00/250 grams (8.8 oz.)",
        "review date": "April 2011",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "PT's Coffee Roasting Co.",
        "title": "Elida Estate Natural Typica and Catuai",
        "blind_assessment": "Rich, deep, brandy-toned. Brandy, rose-like flowers, dark chocolate, pineapple-like fruit in aroma and in immense, opulent cup. Roundly rich acidity; full, syrupy mouthfeel. Rather heavy finish, though the extravagance of the cup is worth it.",
        "notes": "This is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Elida Estate is one of Panama’s most distinguished farms. Roasted at PT’s Coffee, where the motto is “without the love, it’s just coffee.” Visit www.ptscoffee.com or call 888-678-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Topeka, Kansas",
        "coffee origin": "Boquete growing region, western Panama",
        "roast level": "Medium-Light",
        "agtron": "58/77",
        "est. price": "$19.98/12 ounces",
        "review date": "September 2013",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "10",
        "aftertaste": "7"
    },
    {
        "rating": "86",
        "roaster": "Caffe Pronto Coffee Roastery",
        "title": "African Summer Blend",
        "blind_assessment": "An exciting coffee that disappoints in the finish. Ken (88) was more forgiving than co-cupper Danny O'Neill (83), who sums up: \"Bright and clean in the nose, this coffee's lusciously thick and smooth body rounds its slightly fruity, almost wine-like, acidity. Sweet honey and fruit flavors become sharp and  ... astringent in the long finish.\"  Perhaps the dry-processed Ethiopias in this blend are last year's crop, with their explosive aromatics too faded to compensate for an underlying mildly astringent structure.",
        "notes": "Caffe Pronto is a cafe-roastery and an espresso bar with a mission that emphasizes quality and service. Visit www.caffepronto.com or call 888-697-7667 for more information.",
        "bottom_line": null,
        "roaster location": "Annapolis, Maryland",
        "coffee origin": "East Africa.",
        "roast level": "Medium",
        "agtron": "46/61",
        "review date": "July 2006",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "94",
        "roaster": "Compelling & Rich",
        "title": "Panama Chiriqui Finca Santa Teresa Geisha",
        "blind_assessment": "Sweetly and delicately pungent; exotically complex. Honey, jasmine, lavender, lemon verbena, crisp suggestions of roasted cacao nib in aroma and cup. Gently rich, brandyish acidity; lightly syrupy mouthfeel. Honey and cacao nib in particular carry into a long, resonant finish.",
        "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also spelled Geisha). With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This Gesha was prepared by the honey method, meaning the skin was removed from the coffee fruit immediately after picking but the beans or seeds were dried with at least some of the fruit pulp or “honey” still adhering to them. This practice contrasts to the more conventional wet or washed method, wherein both skin and pulp are removed from the beans before drying. Compelling & Rich is uncompromisingly dedicated to offering only small lots of selectively sourced fine single-origin coffees freshly roasted. Visit www.compellingrich.com or call 818-835-5135 for more information.",
        "bottom_line": null,
        "roaster location": "Los Angeles, California",
        "coffee origin": "Volcan growing region, western Panama.",
        "roast level": "Light",
        "agtron": "72/87",
        "est. price": "$18.00/8 ounces",
        "review date": "September 2014",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "93",
        "roaster": "SkyTop Coffee",
        "title": "Ethiopia Guji 1 Natural Hambela Lot 215",
        "blind_assessment": "Delicately sweet, berry-toned. Strawberry coulis, cocoa nib, freesia-like flowers, hazelnut, cedar in aroma and cup. Sweet structure with brisk acidity; crisp, satiny mouthfeel. Cocoa-toned finish with quiet strawberry notes carrying into the long.",
        "notes": "Produced at Hambela Estate, operated by exporter METAD, which also oversees the only privately-owned quality-control laboratory in Ethiopia that carries Specialty Coffee Association (SCA) certification. Processed by the natural method (dried in the whole fruit). SkyTop Coffee is a USDA certified-organic specialty coffee roaster based in Manlius, New York. For more information, visit skytopcoffee.com.",
        "bottom_line": "A clean, delicate natural-processed Ethiopia cup, balanced and cocoa-toned with hints of spicy florals throughout.",
        "roaster location": "Manlius, New York",
        "coffee origin": "Guji Zone, Oromia Region, Southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "60/74",
        "est. price": "$18.00/12 ounces",
        "review date": "October 2020",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Magnolia Coffee",
        "title": "Guatemala Finca San Gerardo",
        "blind_assessment": "Crisp, richly sweet. Magnolia, dried persimmon, hazelnut, molasses, cedar in aroma and cup. Sweet in structure with round, gentle acidity; satiny-smooth mouthfeel. The finish is resonant with magnolia, dried persimmon and hazelnut notes.",
        "notes": "Produced by Jesus Recinos entirely from trees of the Bourbon variety of Arabica. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft Roasted. Truly Delicious. Socially Conscious.” Magnolia Coffee focuses on direct-trade coffees that make a difference in the lives of the coffee harvesters and their communities. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.",
        "bottom_line": "A friendly, floral-toned Guatemala cup with undercurrents of rich hazelnut.",
        "roaster location": "Charlotte, North Carolina",
        "coffee origin": "Lake Amatitlán area, south-central Guatemala",
        "roast level": "Medium-Light",
        "agtron": "52/72",
        "est. price": "$15.00/12 ounces",
        "review date": "October 2018",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Simon Hsieh Aroma Roast Coffees",
        "title": "Tang Bohu Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Deeply sweet-savory, chocolaty and fruit-forward. Lychee, chocolate fudge, pistachio brittle, plumeria, scorched cedar in aroma and small cup. Creamy-smooth mouthfeel; resonantly chocolaty finish with pleasing, slightly smoky aromatic wood undertones. In three parts milk, chocolate is further elevated, as are florals.",
        "notes": "A blend of coffees from a variety of origins using a variety of processing methods, including an Ethiopia natural, a washed Kenya and Colombia, and a Costa Rica yellow honey, roasted for espresso applications. In addition to his retail roasting operation, Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purpose-built commercial espresso blends and high-quality single-origin coffees. Customers can also visit the new showroom, Chateau Andy, in Taipei City. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": "A richly chocolaty, deeply aromatic, spice-toned espresso blend that’s equally exciting in straight shot and in milk.",
        "roaster location": "Taoyuan, Taiwan",
        "coffee origin": "Ethiopia; Kenya; Colombia; Costa Rica",
        "roast level": "Medium",
        "agtron": "45/70",
        "est. price": "NT $650/8 ounces",
        "review date": "June 2022",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "with milk": "9"
    },
    {
        "rating": "87",
        "roaster": "Hunter Bay Coffee Roasters",
        "title": "Brazil Vivenda das Aguas",
        "blind_assessment": "Gently pungent in the aroma: semi-sweet chocolate, cedar, a hint of pruny fruit and Mediterranean herbs. In the cup quietly attractive structure, with a balanced bittersweetness and a shimmer of acidity, but little nuance. Clean, rich, long finish.",
        "notes": "Cup of Excellence winners are green coffees that have been awarded ratings of over 80 by juries of international cuppers and auctioned to roasters on the Internet. This coffee was awarded a rating of 86.43 by the jury at the 2003 Brazil Cup of Excellence competition. It comes from an old but relatively obscure Brazilian coffee growing region, Matas de Minas or \"Mountains of Minas.\" Produced from trees of the catuai variety, a recent but respected selection of Arabica, and processed by the pulped natural method, meaning the skin is removed from the coffee fruit immediately after picking, but the seeds or beans are dried with the sweet pulp, or fruit flesh, still adhering to them. Hunter Bay is a wholesale roaster with a particularly informative website and an impressive selection of coffees. Visit www.hunterbay.com or call 406-273-5490 for more information.",
        "bottom_line": null,
        "roaster location": "Missoula, Montana",
        "coffee origin": "Matas de Minas growing region, Minas Gerais State, Brazil",
        "roast level": "Medium",
        "agtron": "44/59",
        "review date": "April 2005",
        "aroma": "7",
        "acidity": "7",
        "body": "7",
        "flavor": "7",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Wonderstate Coffee",
        "title": "Kenya Mbeguka AA",
        "blind_assessment": "Deeply and sweetly tart; intricate; refined. Distinct sweet lemon, pungent black currant, roasted cacao nib, narcissus-like flowers in aroma and cup. Pronounced, richly resonant acidity; lightly syrupy mouthfeel. Flavor consolidates but sustains in a crisp, gently tart finish.",
        "notes": "This coffee took a somewhat atypical path to market for a Kenya, as it was purchased directly from the producer rather than through the Kenya auction system. Produced exclusively from trees of the admired, Bourbon-derived SL28 and SL34 varieties of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Wonderstate Coffee, formerly Kickapoo Coffee, is an award-winning roaster based in rural Wisconsin known for their commitment to guaranteeing higher pay for farmers and being the country’s first 100% solar powered roastery. Visit https://wonderstate.com for more information.",
        "bottom_line": null,
        "roaster location": "Driftless, Wisconsin",
        "coffee origin": "Embu County, Kenya.",
        "roast level": "Medium-Light",
        "agtron": "58/81",
        "est. price": "$18.50/12 ounces",
        "review date": "December 2014",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "81",
        "roaster": "Ancora Coffee Roasters",
        "title": "Decaffeinated Guatemala",
        "blind_assessment": "The acidity is pronounced, although more fruity and sweet than dry and brisk. Distinct chocolate tones nuance the fruit. The chocolate turns darkly prune-like in the finish, and lingers sweetly in the aftertaste. An attractive and ingratiating coffee, although the rather heavy body remains curiously inert under all the sweetness.",
        "notes": "An attractive coffee, with a heavy body and sweet acidity. Decaffeinated by the European process, involving use of methylene chloride.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Guatemala",
        "roast level": "Medium-Dark",
        "agtron": "37/51",
        "review date": "August 1997",
        "aroma": "4",
        "acidity": "7",
        "body": "8",
        "flavor": "7"
    },
    {
        "rating": "91",
        "roaster": "Counter Culture Coffee",
        "title": "Farm House Organic",
        "blind_assessment": "Tart, sweetly bright, complex. Lemon, jasmine-like flowers, cocoaish nut, fresh-cut fir in aroma and cup. Fine, wine-like acidity; light but smooth, silky mouthfeel. The flavor-saturated finish is drying in the short but sweet and juicy in the long.",
        "notes": "Certified organically grown, and one of Counter Culture’s “Farm Fresh” series of seasonally available coffees. Counter Culture is a wholesale specialty roaster with an informative and lively website, a commitment to fine coffee and youthful, enthusiastic leadership. Visit www.counterculturecoffee.com or call 888-238-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Durham, North Carolina",
        "coffee origin": "Peru; Ecuador",
        "roast level": "Medium",
        "agtron": "54/64",
        "est. price": "$11.45/12 ounces",
        "review date": "February 2012",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "89",
        "roaster": "Starbucks Coffee",
        "title": "Black Apron Kirinyaga Kenya",
        "blind_assessment": "Delicately fruity aroma, sweet cherry with a hint of chocolate. In the cup sweet, rich, surprisingly full-bodied, with a dry, wine-toned black currant fruit and a slight burned undercurrent. Sweetly rich short finish, but a hint of burned astringency shadows the long. This was the highest rated of three Starbucks coffees nominated and reviewed for this article.",
        "notes": "his Kenya is from the production of six cooperative mills that process fresh coffee fruit from the many small member farms surrounding the mills. Despite declining production and unrest in coffee growing regions linked to alleged corruption, Kenya continues to produce some of the world's most distinctive coffees. This is the ninth in Starbucks' Black Apron series of limited production, elite single-origin coffees. Visit www.starbucks.com for more information.",
        "bottom_line": null,
        "roaster location": "Seattle, Washington",
        "coffee origin": "South-central Kenya",
        "roast level": "Dark",
        "agtron": "35/43",
        "review date": "January 2006",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "Green Mountain Coffee Roasters",
        "title": "Colombian Supremo Popayan",
        "blind_assessment": "A distinctively sweet, fruity Colombia. The fruit hovers on the edge of ferment, but to my palate remains safely on the lush but chocolate-cherryish side of the defect divide. The nose is perfectly clean: sweet, light, cocoa-like, the acidity nicely balanced between sweet and dry tones, the body medium to fullish.",
        "notes": "The nose is perfectly clean: sweet, light, cocoa-like, the acidity nicely balanced between sweet and dry tones, the body medium to fullish. From the 1998/99 crop.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont",
        "roast level": "NA",
        "agtron": "/",
        "review date": "May 1999",
        "aroma": "9",
        "acidity": "8",
        "body": "7",
        "flavor": "8"
    },
    {
        "rating": "93",
        "roaster": "Coava Coffee Roasters",
        "title": "Ethiopia Kemgin",
        "blind_assessment": "Layers of rose, peach and lemon in the aroma. Silky mouthfeel, medium body, crisp acidity. Flowers move forward in the cup with complex suggestions of rose and lavender and continued complications of ripe citrus and a sweeter stone fruit. The flavor intrigue carries seamlessly from cup to a dry-edged, flavor-saturated finish.",
        "notes": "A special selection of hand-sorted coffee from Joseph Brodsky's Ninety-Plus Coffee export/import program. Ethiopian coffees like this one processed by the wet or washed method (fruit skin and pulp are removed before drying) express floral and citrus notes with particular intensity. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Western Ethiopia",
        "roast level": "Medium",
        "agtron": "48/64",
        "est. price": "$14.00/250 grams (8.8 oz)",
        "review date": "January 2011",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "Volcanica Coffee",
        "title": "Tanzania Peaberry",
        "blind_assessment": "Sweetly pungent, floral and crisply fruit-toned. Black currant, pink grapefruit zest, honeysuckle, baking chocolate, oak in aroma and cup. Sweetly savory in structure with light-footed acidity; very creamy, ebullient mouthfeel. The sweet finish leads with notes of pink grapefruit zest and baking chocolate with hints of honeysuckle.",
        "notes": "This coffee tied for the highest rating in a cupping of African Great Lakes coffees for Coffee Review’s June 2021 report. Utz-certified. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different cup than normal beans from the same crop, from which they may or may not be separated during grading. Volcanica Coffee is a family-owned business in Suwanee, Georgia whose roots go back two generations to coffee farming in Costa Rica. For more information, visit www.volcanicacoffee.com.",
        "bottom_line": "A Kenya-like Tanzania cup — richly pungent, resonantly sweet-savory, layered and complex.",
        "roaster location": "Suwanee, Georgia",
        "coffee origin": "Ngorongoro Crater region, northern Tanzania",
        "roast level": "Medium-Light",
        "agtron": "53/71",
        "est. price": "$17.99/16 ounces",
        "review date": "June 2021",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Paradise Roasters",
        "title": "Kona Geisha Peaberry Yeast Fermentation Washed",
        "blind_assessment": "Elegantly bright, floral-toned. Wisteria, lemongrass, dried nectarine, cocoa nib, bergamot in aroma and cup. Balanced, high-toned acidity; silky, viscous mouthfeel. Long, lingering, satisfying finish",
        "notes": "Produced at Kona Farm Direct, entirely of the Geisha variety of Arabica, and processed by the traditional washed method, with the addition of a yeast-inoculated fermentation step. Paradise prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 808-498-4048 for more information.",
        "bottom_line": "An aromatically focused, richly floral Kona Geisha with undertones of dried stone fruit and complex citrus — compelling, coherent, harmonious, integrated.",
        "roaster location": "Hilo, Hawaii",
        "coffee origin": "Holualoa, Hawai’i Island, Hawaii",
        "roast level": "Light",
        "agtron": "59/84",
        "est. price": "$80/4 ounces",
        "review date": "June 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "85",
        "roaster": "Stockton Graham & Co",
        "title": "Sumatra Mandheling",
        "blind_assessment": "Lindsey Bolger: \"Intense aroma of fresh-from-oven brownies. Flavors of dark chocolate and sweet caramel compliment the rather dark roast. I added points to acknowledge the roaster's skill in pairing the roast so appropriately to the coffee\" (85). Ken also was impressed by the aroma: \"richly low-toned, chocolaty, malty, spicy, complex. In the cup gently roasty, complicated by dry fruit and malt notes. A slightly astringent finish lowered my score\" (84).",
        "notes": "Mandheling, grown in districts around lake Toba in North Sumatra Province, is the classic Sumatra origin. Technically it is a wet-processed coffee, but a series of peculiarities in how it is processed and dried give it its characteristic low-key richness and idiosyncratic, often unpredictable, flavor notes. Stockton Graham & Co is a quality-oriented wholesale roaster whose slogan or subtitle is \"global beverage experiences.\" Visit www.stocktongraham.com or call 800-835-5943 for more info.",
        "bottom_line": null,
        "roaster location": "Raleigh, North Carolina",
        "coffee origin": "Mandheling growing region, North Sumatra Province, Sumatra, Indonesia.",
        "roast level": "Very Dark",
        "agtron": "36/32",
        "review date": "November 2002",
        "aroma": "8",
        "body": "7",
        "flavor": "7"
    },
    {
        "rating": "97",
        "roaster": "Barrington Coffee Roasting Co.",
        "title": "Perci Red Panama Gesha",
        "blind_assessment": "This extraordinary coffee almost defies description with its aromatic complexity while retaining a classic clarity of structure. The fruit notes suggest in particular tartly sweet tropical fruit like guava, passion fruit or fresh lychee. The floral notes are almost as complex, provoking associations ranging from bitter lavender to lush honeysuckle. Additional complications include a lightly fermented brandy note and crisp roasted cocoa nib. The acidity is rich and juicy, the mouthfeel syrupy yet buoyantly lively. The finish is long and deeply flavor-saturated.",
        "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also spelled Geisha). With its elegantly elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world's most unique coffees. This is a dry-processed or \"natural\" version of the Gesha, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. This particular Gesha is produced on the Ninety Plus Gesha Estates. Barrington Coffee is an artisan roaster dedicated to elite coffees, fresh delivery and roasting that foregrounds the coffee and not the roast. Visit www.barringtoncoffee.com or call 800-528-0998 for more information.",
        "bottom_line": null,
        "roaster location": "Lee, Massachusetts",
        "coffee origin": "Silla Del Pando, Volcan, Panama.",
        "roast level": "Medium",
        "agtron": "52/67",
        "est. price": "$75.95/16 ounces",
        "review date": "December 2012",
        "aroma": "10",
        "acidity": "9",
        "body": "9",
        "flavor": "10",
        "aftertaste": "9"
    },
    {
        "rating": "82",
        "roaster": "Cafetera de Chaparral",
        "title": "Tuluni Supremo",
        "blind_assessment": "Lots of praise for the fruity nose, but the cup failed to excite and the aftertaste disappointed. Overall, panelists found little to either condemn or admire. I felt the coffee had been cleanly processed but still emerged flat.",
        "notes": "Lots of praise for the fruity nose, but the cup failed to excite. Clean but flat. A private mill coffee exported by Cafetera de Chaparral. From a number of small farms. Partly shade grown from trees of the traditional typica variety at an elevation of approximately 5,200 feet.",
        "bottom_line": null,
        "roaster location": "Tolima, Colombia",
        "roast level": "NA",
        "agtron": "/",
        "review date": "August 1999",
        "aroma": "7",
        "acidity": "6",
        "body": "6",
        "flavor": "7"
    },
    {
        "rating": "94",
        "roaster": "Nostalgia Coffee Roasters",
        "title": "Colombia Geisha Allium",
        "blind_assessment": "Vibrantly floral- and fruit-forward. Narcissus, Concord grape, dark chocolate, sandalwood, blood orange in aroma and cup. Sweet-tart structure with winey acidity; plush, creamy mouthfeel. Focused finish led by Concord grape and darl chocolate notes, supported by sandalwood.",
        "notes": "Produced by Rigoberto Herrera of Granja La Esperanza, entirely of the Geisha variety of Arabica, and processed by a hybrid washed method in which the coffee cherries are fermented whole for 48 hours in anaerobic tanks, then de-pulped and fermented again for another 96 hours. Following the second fermentation, the coffee is dried mechanically for 72 hours. Nostalgia Coffee Roasters is a woman-owned specialty coffee roaster founded by Taylor Fields in 2018 as a mobile café. Nostalgia is now focused on bringing exceptional coffee to folks around the world via its online store and wholesale program. Visit www.nostalgiacoffeeroasters.com for more information.",
        "bottom_line": "A vivacious Colombia Geisha cup produced by one of the global leaders in processing experimentation and innovation — juicy, engaging, satiating.",
        "roaster location": "San Diego, California",
        "coffee origin": "Valle de Cauca Department, Colombia",
        "roast level": "Light",
        "agtron": "62/84",
        "est. price": "$65.00/8 ounces",
        "review date": "January 2023",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Equiano Coffee",
        "title": "Wush Wush Ginbo Keffa Ethiopia",
        "blind_assessment": "Profoundly sweet, fruit-forward, candy-like. Clementine orange, Jolly Rancher, milk chocolate, cane sugar, narcissus in aroma and cup. Sweet-toned structure with juicy, vibrant acidity; viscous, honey-like mouthfeel. The prolonged finish evokes cotton candy laced with milk chocolate.",
        "notes": "This exceptional coffee was selected as the No. 14 coffee on Coffee Review’s list of the Top 30 Coffees of 2020. The coffee tied for the highest rating in a cupping of coffees roasted by Black-owned coffee companies for Coffee Review’s August 2020 report. Produced by smallholding farmers from trees of the rare indigenous Ethiopia Wush Wush variety of Arabica. Processed by fermenting the fresh coffee fruit in an oxygen-free environment before drying it in the whole fruit. Equiano Coffee was founded in 2013 by the Udosenatas family. For more information, visit www.equianocoffee.com.",
        "bottom_line": "So headily perfumed that this Ethiopia Wush Wush reads like dessert, redolent with more fruit tones than we can name, enveloped by a rich milk chocolate.",
        "roaster location": "Eugene, Oregon",
        "coffee origin": "Sidama growing region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "60/74",
        "est. price": "$24.00/16 ounces",
        "review date": "August 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "88",
        "roaster": "A&E Custom Coffee Roasters",
        "title": "Kona Fancy",
        "blind_assessment": "Rich aroma: semi-sweet chocolate and suggestions of apple, with floral notes at the top. In the cup rather big-bodied and rich, with continuing distinct floral top notes and a rather dominating, roundly tart acidity that nearly overwhelms but still allows further suggestions of chocolate, ripe tomato, orange and cedar.",
        "notes": "Fancy is the second highest grade of Kona coffee (Extra Fancy is the highest), with the discrimination based mainly on bean size. A&E Roastery is a small-batch wholesale roaster specializing in custom roasting with an emphasis on Fair-Trade certified coffees. Visit www.AERoastery.com or call 603-578-3338 for more information.",
        "bottom_line": null,
        "roaster location": "Amherst, New Hampshire",
        "coffee origin": "Kona growing district, \"Big Island\" of Hawaii.",
        "roast level": "Medium-Light",
        "agtron": "55/73",
        "review date": "April 2006",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "7",
        "aftertaste": "7"
    },
    {
        "rating": "82",
        "roaster": "Millstone Coffee",
        "title": "French Roast",
        "blind_assessment": "Smoky aroma dominated by scorched cedar notes with hints of spice and orange. In the sharply pungent, faintly sweet cup all grace notes vanish with the exception of the smoky, scorched cedar. Good sweetness in the short finish, with only slight astringency in the long.",
        "notes": "Purchased pre-ground in a sealed 10-ounce foil-laminated bag with one-way valve at a Safeway supermarket in northern California; one dollar per dry ounce. French Roast is the standard name in North America for a coffee that has been brought to an extreme dark roast that mutes the characteristics of the green coffee itself and foregrounds the pungent flavor of the roast. Millstone is the specialty coffee brand of Procter & Gamble. Visit www.millstone.com for more information.",
        "bottom_line": null,
        "roaster location": "Cincinnati, Ohio",
        "coffee origin": "Not disclosed.",
        "roast level": "Very Dark",
        "agtron": "0/18",
        "review date": "January 2007",
        "aroma": "7",
        "body": "7",
        "flavor": "6",
        "aftertaste": "5"
    },
    {
        "rating": "88",
        "roaster": "Kaffe Magnum Opus",
        "title": "Sumatra – Balige Estate",
        "blind_assessment": "Low-key, pungent aroma laced with cocoa and caramel. Sweet in the cup with enveloping bottom notes of overripe fruit and sweet humus. Surprising floral notes in the finish.",
        "notes": "Traditionally processed Sumatras like this one, with their low-toned fruit and hints of musty earth, are a favorite origin of many coffee drinkers. Kaff&eacute; Magnum Opus is a national wholesaler and Internet seller of quality specialty coffee. Visit www.1cafe.com or call 800-652-5282 for more info.",
        "bottom_line": null,
        "roaster location": "Millville, New Jersey",
        "coffee origin": "Lake Toba region, northern Sumatra, Indonesia.",
        "roast level": "Medium-Dark",
        "agtron": "41/47",
        "review date": "December 2003",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "8"
    },
    {
        "rating": "95",
        "roaster": "Kakalove Cafe",
        "title": "Ethiopia Washed Shakisso Mormora 74112",
        "blind_assessment": "Delicate, richly floral-toned. Lavender, blood orange, cocoa nib, almond butter, sandalwood in aroma and cup. Balanced structure with fine, floral-toned acidity; silky-smooth, vibrant mouthfeel. The long, sweet finish centers around notes of cocoa nib, lavender and blood orange.",
        "notes": "Produced in the Guji growing region, an area nestled next to Ethiopia's better-known Yirgacheffe and Sidamo regions, from trees of the indigenous 74112 selection of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.",
        "bottom_line": "A complex, nuanced washed Ethiopia cup alive with spice-toned florals, richly bittersweet citrus, and distinct cocoa.",
        "roaster location": "Chia-Yi, Taiwan",
        "coffee origin": "Guji Zone, Oromia Region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "58/78",
        "est. price": "NT $325/8 ounces",
        "review date": "June 2022",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "Corvus Coffee Roasters",
        "title": "Las Lajas Perla Negra Natural",
        "blind_assessment": "Delicate but deep, fruit-forward. Raspberry, violet, blood orange zest, liquorice, roasted cacao nib in aroma and cup. Juicy, vibrant acidity; lean but silky mouthfeel. The flavor-saturated finish consolidates to blood orange zest and roasted cacao nib.",
        "notes": "This exceptional coffee was selected as the #28 coffee on Coffee Review’s list of the Top 30 Coffees of 2016. Produced by Las Lajas farm from trees of the Caturra and Catuai varieties of Arabica. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. This coffee tied for the top rating in a cupping of Costa Rica coffees for Coffee Review‘s October 2016 tasting report. Corvus Coffee Roasters is based in Denver, Colorado and specializes in rare and exclusive coffees from some of the finest growers in the world. Corvus focuses on processing methods and selective harvesting, which result in small, seasonal micro-lots of uniquely sweet, vibrant, and clean flavor profiles. For more information, visit www.corvuscoffee.com.",
        "bottom_line": "An impressive cocoa- and fruit-toned, sweetly rich cup.",
        "roaster location": "Denver, Colorado",
        "coffee origin": "Central Valley, Costa Rica",
        "roast level": "Medium-Light",
        "agtron": "52/70",
        "est. price": "$22.00/12 ounces",
        "review date": "October 2016",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "85",
        "roaster": "Tully's Coffee",
        "title": "Decaffeinated House Blend (K-Cup)",
        "blind_assessment": "(As brewed in a Keurig B60 single-serve brewing device using a \"K-Cup\" capsule to produce a 6-ounce serving size): Simple, sweet-toned aroma with subtle hints of caramel and toast. Soft flavor, with caramel notes continuing and a suggestion of nuttiness. A medium bodied cup, with a slight roughness in mouthfeel, and in the cocoa-like finish.",
        "notes": "Keurig brewing devices were among the first single-serve brewers on the market, starting in the mid 1990's with office models and now with three home models, the no-frills B40, the B60 with more flexible brew-strength/serving size, and the full-featured B70. This sample is offered in a K-Cup that packs more coffee into the capsule and produces a more intense flavor profile than a normal K-Cup. Tully's is a large quality-oriented specialty roasting company and cafe chain based in Seattle. Visit www.tullys.com or call 800-968-8559 for more information.",
        "bottom_line": null,
        "roaster location": "Seattle, Washington",
        "coffee origin": "Not disclosed.",
        "roast level": "Very Dark",
        "agtron": "0/27",
        "review date": "January 2009",
        "aroma": "7",
        "acidity": "7",
        "body": "7",
        "flavor": "7",
        "aftertaste": "7"
    },
    {
        "rating": "94",
        "roaster": "David's Nose",
        "title": "Guatemala Nueva Granda Washed Laurina",
        "blind_assessment": "Floral-toned, richly nutty. Ginger blossom, hazelnut, dark chocolate, black cherry, lime zest in aroma and cup. Sweetly tart structure with balanced, juicy acidity; plush, viscous mouthfeel. Resonant finish with notes of ginger blossom and hazelnut.",
        "notes": "Produced at Nueva Grande Estate, entirely of the Laurina variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). David's Nose is a specialty coffee roaster based in Taipei, Taiwan whose founder studied agronomy and has a deep interest in crop quality. For more information, visit www.dnose.com.tw.",
        "bottom_line": "An energetic washed Guatemala cup characterized by spicy floral and creamy nut tones, further elevated by a dark chocolate throughline.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "San Marcos, Guatemala",
        "roast level": "Light",
        "agtron": "64/80",
        "est. price": "NT $1,000/8 ounces",
        "review date": "October 2023",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Old Soul Co.",
        "title": "El Salvador La Loma Gloria Washed",
        "blind_assessment": "Delicate, crisply sweet. Violet candy, hazelnut butter, lemon verbena, molasses, cedar in aroma and cup. Bright, juicy acidity; lightly silky mouthfeel. The quiet finish settles to notes of lemon verbena and molasses.",
        "notes": "Produced by Anny Pimentel entirely from trees of the heirloom Bourbon variety of Arabica and processed by the conventional wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. This coffee tied for the fourth-highest rating in a tasting of women-produced coffees for Coffee Review‘s June 2017 tasting report.Old Soul is a roastery, bakery and crafter of artisan goods dedicated to quality in every form. Visit www.oldsoulco.com or call 916-443-7685 for more information.",
        "bottom_line": "An accessible, balanced, crisply sweet cup offering quiet aromatic surprises.",
        "roaster location": "Sacramento, California",
        "coffee origin": "El Boquerón region, El Salvador",
        "roast level": "Medium-Light",
        "agtron": "57/80",
        "est. price": "$19.50/12 ounces",
        "review date": "June 2017",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Boca Java Gourmet Coffee & Tea",
        "title": "Cool Breeze Colombian",
        "blind_assessment": "Delicately complex, high-toned aromatics are the glory here. Giddily fruity aroma, with distinct vanilla notes and suggestions of white wine, custardy caramel, flowers, chocolate. In the cup delicate and very sweet, with continuing floral, wine (Riesling) and semi-sweet chocolate notes. The floral delicacy carries into the slightly astringent finish. Too delicate for this world: loses some of its refreshing complexity as the cup cools.",
        "notes": "A Supremo grade Colombia, the highest grade by bean size. Boca Java is a small-batch, custom retail/wholesale roaster that roast-dates its coffees and emphasizes freshness and quality. Visit www.bocajava.com or call 888-262-2528 for more information.",
        "bottom_line": null,
        "roaster location": "Jacksonville, Florida",
        "coffee origin": "Colombia",
        "roast level": "Medium",
        "agtron": "50/66",
        "review date": "February 2006",
        "aroma": "9",
        "acidity": "7",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Paradise Roasters",
        "title": "Sumatra La Minita Aceh Gold",
        "blind_assessment": "Sweetly and richly pungent: cedar, grapefruit, freshly turned earth in aroma and cup. Rich, roundly bright acidity; medium body; silky mouthfeel. The citrus turns orangy in a fine, flavor-saturated finish.",
        "notes": "Classic “wet-hulled”-style Sumatra from the Lake Tawar basin at the northwestern tip of the island. Paradise Roasters prides itself on roasting and shipping coffee only after orders are placed. Its metaphoric mission is to bring some paradisiacal warmth from the coffee-growing south to the cool environs of Minnesota. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": null,
        "roaster location": "Ramsey, Minnesota",
        "coffee origin": "Aceh growing region, northwestern Sumatra, Indonesia.",
        "roast level": "Medium",
        "agtron": "45/58",
        "est. price": "$13.95/12 ounces",
        "review date": "May 2011",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "91",
        "roaster": "Cuvee Coffee",
        "title": "El Salvador Santa Rita Peaberry",
        "blind_assessment": "An intense cup. Pungent herb and cedar mingle with a soft fruit in aroma and cup. Full body, smooth mouthfeel. The fruit sweetens toward chocolate in the cup, balancing the sharper herb and cedar notes. The chocolate persists to soften the long, dry finish.",
        "notes": "This Bourbon variety coffee consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Cuvee Coffee is a small-batch, artisan roasting company located in Texas about twenty miles west of Austin. Visit www.cuveecoffee.com or call 866-688-6608 for more information.",
        "bottom_line": null,
        "roaster location": "Spicewood, Texas",
        "coffee origin": "Ahuachapan Department, El Salvador.",
        "roast level": "Medium-Light",
        "agtron": "53/75",
        "review date": "December 2009",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Simon Hsieh's Aroma Roast Coffees",
        "title": "Guatemala Antigua Phoenix Special Bourbon",
        "blind_assessment": "Evaluated as espresso. Richly and sweetly tart in aroma and small cup: fresh-cut cedar, dark chocolate, zesty orange, hints of flowers and pipe tobacco. Full yet buoyant, lively mouthfeel. Flavor carries into a long, deep finish. Tart fruit, softened by a backgrounded chocolaty sweetness, continues to dominate in two parts milk.",
        "notes": "Produced in the growing region surrounding the famous colonial city of Guatemala Antigua entirely from trees of the heirloom Bourbon variety of Arabica. In addition to his retail roasting operation Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purposed-built commercial espresso blends and high quality single-origin coffees. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": null,
        "roaster location": "Taoyuan City, Taiwan",
        "coffee origin": "Antigua growing region, south-central Guatemala.",
        "roast level": "Medium",
        "agtron": "51/64",
        "est. price": "NT $1200/16 ounces",
        "review date": "May 2012",
        "aroma": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9",
        "with milk": "9"
    },
    {
        "rating": "92",
        "roaster": "Thanksgiving Coffee Company",
        "title": "Finca Lerida Gesha Natural",
        "blind_assessment": "Richly sweet, floral-toned. Magnolia, date, almond, caramel, fresh-cut cedar in aroma and cup. Sweet structure with gentle, round acidity; full, syrupy-smooth mouthfeel. Floral and nut-toned finish.",
        "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Geisha (also spelled Gesha) on the Chiari family’s Finca Lerida Esplenderosa in Jaramillo, Panama under the management of family member Sonia Amoruso. With its elongated beans and distinctive cup, the Geisha variety continues to distinguish itself as one of the world’s most unique coffees. One of the country’s pioneering socially and environmentally progressive roasters, Thanksgiving aimed to combine coffee quality with social and environmental responsibility many years before the latter preoccupations became fashionable. Visit www.thanksgivingcoffee.com or call 800-648-6491 for more information.",
        "bottom_line": "A rich, deeply pungent Panama Geisha cup deftly roasted to medium to promote particularly attractive caramel and floral notes.",
        "roaster location": "Mendocino, California",
        "coffee origin": "Jaramillo, Boquete growing region, western Panama",
        "roast level": "Medium-Light",
        "agtron": "52/70",
        "est. price": "$45.00/12 ounces",
        "review date": "May 2021",
        "aroma": "8",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "76",
        "roaster": "Holland Coffee Group",
        "title": "Papua New Guinea Organic",
        "blind_assessment": "A coffee whose interesting sweet fruit tones (\"apricot\" hazarded one panelist) edge into ferment, the overripe-cum-rotten flavor caused by sugars that prematurely ferment in the coffee fruit, tainting the bean inside the fruit. Complicating the ferment is a related off taste that some panelists tolerated and described with terms like \"tobaccoey\" and others condemned as \"animal-like\" and \"skunky.\" In short, a promisingly sweet, complex coffee gone wrong.",
        "notes": "A coffee whose interesting sweet fruit tones edged into unpleasant ferment. Reviewed as a green coffee by the Cupping Board. Produced by small-holder farmers at over 5,000 feet in the east-central mountains of Papua New Guinea.",
        "bottom_line": null,
        "roaster location": "Navato, California",
        "roast level": "NA",
        "agtron": "/",
        "review date": "February 2000",
        "aroma": "6",
        "acidity": "6",
        "body": "5",
        "flavor": "5"
    },
    {
        "rating": "88",
        "roaster": "Kili Caffe",
        "title": "Gold Espresso",
        "blind_assessment": "Sweet-toned aroma with an orange-toned nut character. In the small cup smooth, syrupy mouthfeel, sweetly pungent through the finish with continued orange and woody nut nuance. In milk the nut and orange notes sweeten toward chocolate but never quite bloom.",
        "notes": "The Kili in Kili Caffe refers to Mount Kilimanjaro, suggesting a high-grown East-Africa Arabica influence in this blend, although that reference isn't particularly apparent in the cup, whose character seems most influenced by high-quality robustas. Currently available in 2.2-pound valve bags on line at www.espressovero.com. Visit www.kilicaffe.it for more information.",
        "bottom_line": null,
        "roaster location": "Enna, Sicily, Italy",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium",
        "agtron": "41/62",
        "review date": "August 2007",
        "aroma": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8",
        "with milk": "7"
    },
    {
        "rating": "91",
        "roaster": "Amavida Coffee Roasters",
        "title": "Honduras Natural",
        "blind_assessment": "Sweetly fruit-forward. Raspberry, baker’s chocolate, brandy, narcissus-like flowers, cashew in aroma and cup. Sweet-tart acidity; Smooth, lightly velvety mouthfeel. The richly drying finish consolidates to dried raspberry and brandy in the short, baker’s chocolate in the long.",
        "notes": "Produced Miriam Elizabeth Perez of COMSA Cooperative in Marcala, Honduras of the Bourbon, Catuai and Typica varieties of Arabica. This is a “natural” or dry-processed coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. The company name Amavida combines the Spanish words for love and life, reflecting Amavida’s multifaceted commitment to fairness and fine coffee.Visit www.amavida.com or call 850-213-1965 for more information.",
        "bottom_line": "A chocolaty cup with sweet-fermenty, brandy-like nuance throughout.",
        "roaster location": "Santa Rosa Beach, Florida",
        "coffee origin": "Marcala growing region, La Paz Department, Honduras",
        "roast level": "Medium-Light",
        "agtron": "54/80",
        "est. price": "$19.95/12 ounces",
        "review date": "August 2016",
        "aroma": "9",
        "acidity": "7",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Old Soul Co.",
        "title": "Brazil Fazenda Alta Vista",
        "blind_assessment": "Sweetly nutty, deeply floral. Butterscotch, hazelnut, lilac, tamarind, dried papaya in aroma and cup. Crisply sweet acidity; satiny mouthfeel. All flavor notes harmoniously carry into a resonant short finish; hazelnut and tamarind linger well into the sweet-tart long.",
        "notes": "Produced by Robson Vilela at Fazenda Alta Vista entirely of the Yellow Bourbon variety of Arabica. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Old Soul is a roastery, bakery and crafter of artisan goods dedicated to quality in every form. Visit www.oldsoulco.com or call 916-443-7685 for more information.",
        "bottom_line": "An exceptional Brazil natural: a nuanced and harmonious convergence of sweet, tart and nut.",
        "roaster location": "Sacramento, California",
        "coffee origin": "Christina, Mantiqueira, Minas Gerais State, southeastern Brazil",
        "roast level": "Medium-Light",
        "agtron": "56/80",
        "est. price": "$18.00/12 ounces",
        "review date": "June 2016",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Sunrise Coffee",
        "title": "Celebes Kalossi",
        "blind_assessment": "A superb Sulawesi: rich, big-bodied but smooth, with a shimmer of acidity animating its heart. Elegant balance of bitter and sweet tones, fine range from middle to bottom of the profile, a hint of flowers, and deep, dry plum-wine fruitiness.",
        "notes": "Sunrise Coffee is a small wholesale roasting company located in the San Francisco Bay Area. Milton Coreas, owner and roastmaster, was born in El Salvador. As a youth he picked coffee on one of the same farms he now buys from.",
        "bottom_line": null,
        "roaster location": "San Leandro, California",
        "roast level": "NA",
        "agtron": "/",
        "review date": "March 2001",
        "aroma": "7",
        "acidity": "7",
        "body": "9",
        "flavor": "9"
    },
    {
        "rating": "89",
        "roaster": "Soyuz Coffee Roasting",
        "title": "Mon Ami Delight",
        "blind_assessment": "Evaluated as espresso. Deep, raisin-toned dark chocolate notes dominate in aroma and cup. Rich and balanced in the aroma. Slightly rough mouthfeel in the small cup but the flavor deepens. The chocolate turns bittersweet in the finish, but blossoms richly and complexly in two parts milk.",
        "notes": "This blend combines coffees from Brazil and El Salvador that have been processed by the wet or washed method in which the fruit skin and pulp are removed before drying. Founded in 2011, Soyuz Coffee Roasting is the specialty coffee branch of parent company Soyuz Corporation. Based in Kaliningrad, Russia, Soyuz offers three unique brands of coffee: Mon Ami, Paretto and Barista. Soyuz has been awarded the title \"Official Purveyor to the Moscow Kremlin\" for its outstanding products and management practices. Visit www.soyuzcoffeeroasting.com for more information. Visit http://www.soyuzcoffeeroasting.com for more information.",
        "bottom_line": null,
        "roaster location": "Kaliningrad, Russia",
        "coffee origin": "Brazil; El Salvador.",
        "roast level": "Dark",
        "agtron": "34/41",
        "est. price": "NA",
        "review date": "March 2011",
        "aroma": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": "7",
        "with milk": "9"
    },
    {
        "rating": "88",
        "roaster": "Flying Goat Coffee",
        "title": "Organic Panama Boquete Casa Ruiz",
        "blind_assessment": "Intense, rather acidy aroma with vanilla-toned chocolate and fruit notes. In the cup the acidity was either sweet and lushly lively (Ken) or a touch too soft (co-cupper Rodger Owen), the flavor a bit too simple (Rodger) or intriguing in its simultaneous sensory allusions to wine and chocolate (Ken).",
        "notes": "Certified organically grown on Finca San Cristobal, mostly from trees of the old and respected typica variety of arabica. Flying Goat Coffee is a leading boutique retail/wholesale roaster located in the wine country of northern California. Visit www.flyinggoatcoffee.com or call 800-675-3599 for more info.",
        "bottom_line": null,
        "roaster location": "Healdsburg, California",
        "coffee origin": "Boquete growing district, western Panama",
        "roast level": "Medium",
        "agtron": "50/63",
        "review date": "August 2005",
        "aroma": "7",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "90",
        "roaster": "Giv COFFEE",
        "title": "Peru Ciriaco Quispe",
        "blind_assessment": "Savory-sweet, softly pungent, subtle. Hazelnut, lime zest, fir, a hint of narcissus-like flowers in aroma and cup. Brisk yet juicy acidity; silky mouthfeel. Lime zest and fir in particular carry into a quiet though rich finish.",
        "notes": "This is a certified organically grown and Fair Trade Certified green coffee, meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. However, this roasted, retail version does not carry the Fair Trade USA seal on the bag or website because, although the producer and importer are Fair Trade Certified, the roaster is not. The Cecovasa collection of coffee cooperatives was founded in 1970 and is currently comprised of eight co-ops (more than 5,000 farmers) throughout the Sandia Valley, of which the smaller Inambari Valley, where this coffee was produced, is part. Giv COFFEE is dedicated to three goals: to provide quality coffee, to provide a fair price to farmers, and to give back to those in need. Giv COFFEE donates two dollars of every retail bag of coffee it sells. In the case of this coffee, the donation goes to support agricultural improvement projects in Africa. Visit www.givcoffee.com or call 860-874-5301 for more information.",
        "bottom_line": null,
        "roaster location": "Torrington, Connecticut",
        "coffee origin": "Inambari Valley, Peru",
        "roast level": "Light",
        "agtron": "68/89",
        "est. price": "$16.50/12 ounces",
        "review date": "November 2015",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Paradise Roasters",
        "title": "Colombia La Esperanza Micro-lot",
        "blind_assessment": "A relatively light roast develops this pure high-grown coffee’s giddy natural sweetness, delicately bright acidity and tart fruit notes. Light, silky mouthfeel. The tart fruit softens toward chocolate in the finish.",
        "notes": "Paradise Roasters prides itself on roasting and shipping coffee only after orders are placed. Its metaphoric mission is to bring some paradisiacal warmth from the coffee-growing south to the cool environs of Minnesota. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": null,
        "roaster location": "Ramsey, Minnesota",
        "coffee origin": "Huila Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "57/70",
        "est. price": "$18.95/12 ounces",
        "review date": "May 2011",
        "aroma": "8",
        "acidity": "9",
        "body": "7",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Caribou Coffee",
        "title": "La Minita Peaberry",
        "blind_assessment": "Deep, pungent, savory-sweet. Orange, cedar, butter, flowers (jasmine, lavender) in aroma and cup. Delicate, sweetly brisk acidity; light, silky mouthfeel. A chocolate hint turns up in a balanced, gently rich finish.",
        "notes": "La Minita Estate in the Tarrazu region of Costa Rica was in many ways the original estate coffee, a coffee that thirty or so years ago breathtakingly helped raise the bar for green coffee quality and distinction. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Like all Caribou coffees, this one is Rainforest Alliance certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. It is one of Caribou’s Roastmaster Reserve coffees, special seasonal offerings. Caribou Coffee is a retail roasting chain based in the upper Middle West whose rather irreverent motto \"Life is short. Stay awake for it\" belies a serious approach to coffee. Visit www.cariboucoffee.com or call 888-227-4268 for more information.",
        "bottom_line": null,
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Tarrazu growing region, central Costa Rica",
        "roast level": "Medium-Dark",
        "agtron": "48/52",
        "est. price": "NA",
        "review date": "July 2013",
        "aroma": "8",
        "acidity": "8",
        "body": "7",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Kakalove Cafe",
        "title": "Berg Wu Championship Sidamo Washed G1 Lot 20-02",
        "blind_assessment": "Subtly and sweetly rich, deeply savory. Boysenberry, cocoa nib, fine musk, honeysuckle, oak in aroma and cup. Sweet-savory structure with juicy acidity; crisp, syrupy mouthfeel. The finish resonates with layers of perfumy florals.",
        "notes": "Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian varieties of Arabica long grown in the region. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.",
        "bottom_line": "A headily perfumed cup grounded by cocoa nib. Paradoxically both high-toned and exhilarating while paradoxically deep and brooding.",
        "roaster location": "Chia-Yi, Taiwan",
        "coffee origin": "Sidama (also Sidamo) growing region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "64/84",
        "est. price": "NT $340/8 ounces",
        "review date": "January 2021",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "93",
        "roaster": "Collage Coffee",
        "title": "Cordillera del Fuego Costa Rica Anaerobic",
        "blind_assessment": "Richly spicy, musky, chocolaty. Mexican chocolate (cocoa nib, vanilla, cinnamon, sugar), dried parsley, nutmeg, musk in aroma and cup. Crisp and piquant in structure; light, silky mouthfeel. The impressive finish is drying yet quite sweet, saturated with chocolate, cinnamon and musk suggestions.",
        "notes": "This exceptional coffee was selected as the No. 19 coffee on Coffee Review’s list of the Top 30 Coffees of 2019. This coffee tied for second-highest rating in a cupping of coffees produced using reduced oxygen (“anaerobic”) processing methods for Coffee Review’s November 2019 tasting report. Anaerobic processing in this case means that producer Luis Eduardo Campos fermented this coffee, after pulping or skinning, in a sealed, limited-oxygen stainless steel tank to encourage production of lactic acids that contribute to this sample’s very original cup profile. This coffee was imported by Genuine Origin, a specialty-focused coffee importer based in Irvington, New York. Collage Coffee is a micro-roastery featuring specialty coffee and house brewed kombucha. Colläge works with local artists to promote fine arts in its region, and loves serving its community. This coffee is available for purchase at the Collage store and cafe, 221 South Broad Street, Grove City, Pennsylvania.",
        "bottom_line": "An anaerobic-processed coffee whose startling originality leans toward musk, chocolate and cinnamon.",
        "roaster location": "Grove City, Pennsylvania",
        "coffee origin": "Tarrazu, Costa Rica",
        "roast level": "Medium-Light",
        "agtron": "55/76",
        "est. price": "$15.00/10 ounces",
        "review date": "November 2019",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "93",
        "roaster": "JBC Coffee Roasters",
        "title": "El Aguila SL28 El Salvador",
        "blind_assessment": "Delicately but pungently floral. Narcissus-like flowers, baker’s chocolate, tart black currant, oak, roasted pistachio in aroma and cup. Crisply sweet and lightly savory in structure; plump and lightly syrupy in mouthfeel. Flowers, cocoa-like chocolate, pistachio in particular carry into a gently drying finish.",
        "notes": "Finca El Aguila is owned by Mauricio Ariz and his sons. It occupies 63 hectares in Cantón Ojo de Agua, municipality of Chalchuapa, near the Santa Ana Volcano. A small portion of the farm is devoted to the production of SL 28, the tree variety most responsible the great coffees of Kenya. This is a wet-processed or “washed” version of the SL 28, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A subtle but persuasive version of the resonantly pungent, berry-and-flowers Kenya-style cup.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Santa Ana region, El Salvador",
        "roast level": "Medium-Light",
        "agtron": "57/80",
        "est. price": "$19.50/12 ounces",
        "review date": "November 2018",
        "aroma": "8",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Vennel Coffee",
        "title": "Ethiopia Guji Chembi",
        "blind_assessment": "Richly sweet, chocolaty and fruit-toned. Mango, dark chocolate, sandalwood, maple syrup, rhododendron-like flowers in aroma and cup. Sweet-toned structure with bright, juicy acidity; plush, syrupy mouthfeel. The resonant, flavor-saturated finish leads with mango and dark chocolate suggestions.",
        "notes": "Guji is nestled next to the better-known Yirgacheffe and Sidamo growing regions; it shares their devotion to the distinctive, largely indigenous varieties of Arabica long grown in these regions. This is a “natural” or dry-processed version (dried in the whole fruit). Vennel Coffee is a Taiwan-based specialty coffee roaster. For more information, visit www.vennelcoffee.com.tw.",
        "bottom_line": "A beautifully composed natural-processed Ethiopia cup centered around clean tropical fruit tones supported by rich chocolate and deep vanilla-like florals.",
        "roaster location": "Keelung, Taiwan",
        "coffee origin": "Guji Zone, Oromia Region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "NT $450/227 grams",
        "review date": "November 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "Bird Rock Coffee Roasters",
        "title": "El Salvador Finca Kilimanjaro Natural",
        "blind_assessment": "Sweetly tart, floral-toned. Lavender, passionfruit, roasted cacao nib, almond brittle, allspice in aroma and cup. Crisply sweet acidity; full, syrupy mouthfeel. The flavor-saturated finish is deep with cocoa- and spice-toned floral notes in the resonant short and perhaps a hint of sweet, grappa-like ferment in the long.",
        "notes": "Finca Kilimanjaro is an El Salvador farm named after East Africa’s highest peak by Aida Batlle, one of El Salvador’s (and Central America’s) most respected and innovative coffee producers. Finca Kilimanjaro is planted with the famous SL28 variety of Arabica, the variety that produces the finest coffees of Kenya. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Based in the San Diego area, Bird Rock Coffee Roasters is a retailer and wholesaler focused on organic and socially responsible coffees; it was awarded the “2012 Micro-Roaster of the Year” title from Roast Magazine. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.",
        "bottom_line": "Another compelling Aida Batlle coffee from her El Salvador farm, with deep fruit and cocoa tones and spicy floral notes throughout.",
        "roaster location": "San Diego, California",
        "coffee origin": "Santa Ana Department, El Salvador",
        "roast level": "Medium-Light",
        "agtron": "54/78",
        "est. price": "$35.00/12 ounces",
        "review date": "June 2017",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "92",
        "roaster": "Java Blend Coffee Roasters",
        "title": "Ethiopia Reko",
        "blind_assessment": "Deeply and richly sweet. Strawberry, peach, sandalwood, almond butter, chrysanthemum in aroma and cup. Sweetly tart structure; crisp, satiny mouthfeel. The quiet finish consolidates around notes of almond and sandalwood.",
        "notes": "This coffee tied for the third-highest rating in a cupping of Value Coffees for Coffee Review‘s March 2018 tasting report. Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Java Blend Coffee Roasters is a small-batch roasting company owned and operated by the same family since 1938. It custom roasts and delivers coffee within two days of ordering throughout most of the Maritime Provinces of Canada. Visit www.javablendcoffee.com or call 877-596-5282 for more information.",
        "bottom_line": "A classic Ethiopia cup: balanced, bright and deeply sweet, with notes of berry and stone fruit.",
        "roaster location": "Halifax, Nova Scotia, Canada",
        "coffee origin": "Yirgacheffe growing region, south-central Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "57/77",
        "est. price": "CAD $15.50/340 grams",
        "review date": "March 2018",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "7"
    },
    {
        "rating": "94",
        "roaster": "Big Shoulders Coffee",
        "title": "Guatemala El Amate Maragogype",
        "blind_assessment": "Complexly fruity, cocoa-toned. Boysenberry, pomelo, cocoa nib, cedar, frankincense in aroma and cup. Sweet-tart acidity; full, creamy mouthfeel. Deeply fruity finish with cocoa nib undertones.",
        "notes": "Produced by Petronilo Martinez and his son Petronilo Jesus, entirely of the Maragoype variety of Arabica, and processed by the natural method (dried in the whole fruit). Big Shoulders Coffee is a Chicago artisan roaster that emphasizes a fresh-roasted, no-nonsense approach to fine coffee. Visit www.bigshoulderscoffee.com or call 312-846-1439 for more information.",
        "bottom_line": "It’s unusual to find a natural-processed Maragoype, and this Guatemala is a fruit bomb restrained only by cocoa nib; especially creamy, rich mouthfeel.",
        "roaster location": "Chicago, Illinois",
        "coffee origin": "El Aguacatal, Hoja Blanca, Cuilco, Huehuetenango, Guatemala",
        "roast level": "Medium-Light",
        "agtron": "60/76",
        "est. price": "$27.00/12 ounces",
        "review date": "August 2023",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Green Mountain Coffee",
        "title": "Kenyan Highland Cooperatives Fair-Trade",
        "blind_assessment": "Roundly balanced aroma; orange, chocolate, a hint of flowers. In the cup silky mouthfeel, crisp acidity. The orange notes turn pleasantly bittersweet (think fresh orange peel) and the hint of chocolate goes dark and raisiny. The orange notes carry deeply into the finish, with a revived suggestion of flowers.",
        "notes": "This coffee is Fair-Trade certified, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Despite recent social and political disorder and a partial and rather confusing transition from auction system to open market, Kenya cooperatives continue to produce some of the world's most elegant and distinctive coffees. Keurig/Green Mountain, formerly Green Mountain Coffee Roasters, pioneered single-serve capsule brewing in the United States with its Keurig brewing system, and remains one of the country’s leading large specialty roasters, offering a particularly wide-ranging variety of origins and roast styles. Visit www.GreenMountainCoffee.com or call 888-879-4627 for more information.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont",
        "coffee origin": "South-central Kenya.",
        "roast level": "Medium",
        "agtron": "47/61",
        "review date": "September 2008",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Hub Coffee Roasters",
        "title": "Santa Elena Colombia Caturra Natural",
        "blind_assessment": "Gently sweet-tart, fruit-toned. Dried plum, cocoa nib, fresh-cut oak, lemon verbena, freesia-like flowers in aroma and cup. Delicately tart structure with brisk acidity; crisp, satiny mouthfeel. Cocoa and cedar notes lead the quiet finish.",
        "notes": "Produced by Samuel Roldan of Finca Santa Elena entirely of the Caturra variety of Arabica and processed by the natural method (dried in the whole fruit). Hub Coffee Roasters is a specialty roaster focused on single-origin coffees with several cafes in the Reno area. Visit www.hubcoffeeroasters.com for more information.",
        "bottom_line": "An easygoing, approachable natural-processed Colombia cup with a sweetly tart cup profile complicated by hints of cocoa nib and spicy florals.",
        "roaster location": "Reno, Nevada",
        "coffee origin": "Antioquia Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "57/75",
        "est. price": "$19.50/12 ounces",
        "review date": "May 2022",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "Bird Rock Coffee Roasters",
        "title": "Makwa Kenya Nyeri",
        "blind_assessment": "Intense, deep, pungent. Black currant, dark chocolate, almond, honeysuckle in aroma and cup. Powerful, luxuriously lyrical acidity; lightly syrupy mouthfeel. Flavor simplifies but lingers in a resonantly dry finish.",
        "notes": "Produced entirely from trees of the much admired SL28 variety of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world's most elegant and distinctive coffees. Based in the San Diego area, Bird Rock Coffee Roasters is a retailer and wholesaler focused on organic and socially responsible coffees; it was awarded the “2012 Roaster of the Year” title from Roast Magazine. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.",
        "bottom_line": null,
        "roaster location": "La Jolla, California",
        "coffee origin": "Nyeri growing region, south-central Kenya.",
        "roast level": "Medium-Light",
        "agtron": "57/71",
        "est. price": "$17.99/12 ounces",
        "review date": "October 2013",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Equator Estate Coffees & Teas",
        "title": "Kenya Fancy AA Karinga",
        "blind_assessment": "Densely sweet aroma, with soft hints of stone fruit, citrus and flowers. Brightly balanced in the cup. Medium body. Tart lime notes in front fade and sweeten to floral, blackberry and pungent cedar. The cedar note combines with bitter-sweet chocolate in the long, gently astringent finish.",
        "notes": "Despite stresses brought on by charges of corruption and a confused transition toward an open market, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. Founded in 1995, Equator Estate Coffees & Teas is a women-owned wholesale coffee roasting company with web based retail. Equator focuses on sustainability in coffee sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.",
        "bottom_line": null,
        "roaster location": "San Rafael, California",
        "coffee origin": "Kiambu growing region, south-central Kenya.",
        "roast level": "Medium",
        "agtron": "45/57",
        "review date": "August 2009",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "Moore Coffee",
        "title": "Aged Celebes",
        "blind_assessment": "A wonderfully sweet coffee whose lush character is balanced (or opposed) by a sharply musty earthiness. Taken together these tendencies read as a pungent citrus, grapefruit perhaps. Full body, very syrupy mouthfeel. Rich and very sweet in the short finish; in the long the musty tones introduce a mild astringency.",
        "notes": "An aged coffee originating in the Toraja growing region of the Indonesian island of Celebes, now Sulawesi. Aging, usually performed in warehouses in moist conditions, intensifies the odd genius of this unorthodox origin. Moore Coffee is a roast-to-order artisan coffee roasting company with a well-developed Internet business and wholesale accounts. Visit www.moorecoffee.com or call 800-994-8060 for more information.",
        "bottom_line": null,
        "roaster location": "Ventura, California",
        "coffee origin": "Toraja (formerly Kalossi) growing region, southwestern Celebes (now Sulawesi), Indonesia",
        "roast level": "Medium-Dark",
        "agtron": "38/53",
        "review date": "April 2007",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "86",
        "roaster": "Peet's Coffee & Tea",
        "title": "Cafe Domingo",
        "blind_assessment": "A straightforward, rather plain coffee. Most complex in the sweet, gently pungent aroma: raisin, cedar, dark chocolate. Sweet-toned but subdued acidity; slightly lean mouthfeel. The attractive aromatics persist but simplify in the cup and finish.",
        "notes": "One of two brand-complicating medium-roasted blends introduced in 2011 by Peet’s Coffee, hitherto famous for its commitment to a pungently rich, dark-roast style. This blend, described on the bag as “Smooth, Balanced and Medium-Bodied,” is named for Domingo Avenue in Berkeley, California, the lovely little shopping enclave where Peet’s opened its third location in 1980. Visit www.peets.com or call 800-999-2132 for more information.",
        "bottom_line": null,
        "roaster location": "Berkeley, California",
        "coffee origin": "Latin America.",
        "roast level": "Medium-Dark",
        "agtron": "45/52",
        "est. price": "$11.99/12 ounces",
        "review date": "February 2012",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "7",
        "aftertaste": "7"
    },
    {
        "rating": "95",
        "roaster": "Wonderstate Coffee",
        "title": "Organic Peru San Fernando Tres Fincas Gesha",
        "blind_assessment": "Richly sweet, floral-toned. Wisteria, red plum, cocoa nib, hazelnut butter, marjoram in aroma and cup. Balanced, sweet-tart structure with vibrant acidity; very full, syrupy-smooth mouthfeel. Resonant, lingering flavor-saturated finish.",
        "notes": "This exceptional coffee was selected as the No. 18 coffee on Coffee Review’s list of the Top 30 Coffees of 2023. Produced by smallholding farmers of the San Fernando Cooperative, entirely of the Geisha (also Gesha)variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Wonderstate Coffee, formerly Kickapoo Coffee, is an award-winning roaster based in rural Wisconsin known for its commitment to guaranteeing higher pay for farmers and operating the country’s first 100% solar-powered roastery. Visit wonderstate.com for more information.",
        "bottom_line": "An impressive Peru Geisha cup with deep floral aromatics, juicy stone fruit and crisp cocoa nib notes.",
        "roaster location": "Viroqua, Wisconsin",
        "coffee origin": "Incawasi, La Convencion Province, Peru",
        "roast level": "Medium-Light",
        "agtron": "58/80",
        "est. price": "$29.00/12 ounces",
        "review date": "March 2023",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "72",
        "roaster": "Royal Coffee",
        "title": "Royal Mocha-Java",
        "blind_assessment": "This coffee was roasted so darkly and probably at such high temperatures that little was left to taste except overwhelming carbon plus a hint of high, singing sweetness that emerged in aroma and finish. The green coffee the roastmaster started with may well have been excellent, but the roast certainly wasn't.",
        "notes": "This coffee was over-roasted, so that there was little left to taste except carbon and a hint of high, singing sweetness that emerged in the aroma and finish. Yemen Sanani and wet-processed estate Java.",
        "bottom_line": null,
        "roaster location": "Emeryville, California",
        "roast level": "Very Dark",
        "agtron": "30/32",
        "review date": "January 1998",
        "aroma": "4",
        "acidity": "3",
        "body": "4",
        "flavor": "3"
    },
    {
        "rating": "93",
        "roaster": "Paradise Roasters",
        "title": "Colombia Cup of Excellence 2011 First Place Winner",
        "blind_assessment": "Bright, high-toned complexity: sweet, rose-like floral notes, milk chocolate, lemony cherry, a hint of pungent fir. Rich, zesty acidity; lightly syrupy mouthfeel. The finish is deep and long with echoes of flowers and chocolate.",
        "notes": "The Cup of Excellence is the most esteemed competition for green coffees from a given country of origin; this was the first prize winner from the Colombia 2011 competition chosen by a select group of national and international cuppers. From Arnulfo Leguizamo’s Primavera farm and Rainforest Alliance certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. Paradise Roasters prides itself on roasting and shipping coffee only after orders are placed. Its metaphoric mission is to bring some paradisiacal warmth from the coffee-growing south to the cool environs of Minnesota. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": null,
        "roaster location": "Ramsey, Minnesota",
        "coffee origin": "San Agustín growing region, Huila Department, southern Colombia",
        "roast level": "Medium-Light",
        "agtron": "57/68",
        "est. price": "$64.95/10 ounces",
        "review date": "August 2011",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "Difference Coffee",
        "title": "Esmeralda Estate Panama Geisha",
        "blind_assessment": "Evaluated as espresso produced as a “ristretto” 25ml (.85-ounce) shot using a Nespresso capsule espresso brewer with whole milk heated using a conventional steam wand. Rich-toned, floral- and fruit-driven. Jasmine, apricot, almond, baking chocolate, cedar in aroma and small cup. Delicately viscous mouthfeel; crisp finish centered around chocolate and almond notes. The milk shot is boldly pleasing, chocolate-laden and richly floral.",
        "notes": "One of the world’s most celebrated coffees presented in a Nespresso-compatible capsule. Geisha (also Gesha) continues to be one of the world’s most celebrated and sought-after coffee varieties, and the Hacienda La Esmeralda Geishas remain among the most authentic. This version is the Coronado 6AD nano-lot, sold exclusively to Difference Coffee; only 1,050 boxes are available. This is a wet-processed or “washed” version (fruit skin and pulp are removed before drying). Difference Coffee aims to present only the finest of the world’s coffees as determined by green coffee competitions and other measures of distinction, tactfully roasted and presented in capsules compatible with Nespresso capsule brewing systems. For more information visit www.differencecoffee.com.",
        "bottom_line": "A balanced, bright, rich-toned Panama Geisha in Nespresso-compatible format: chocolaty, sweetly fruit-driven, deeply floral.",
        "roaster location": "London, England",
        "coffee origin": "Boquete growing region, western Panama",
        "roast level": "NA",
        "agtron": "0/0",
        "est. price": "£50/10 capsules",
        "review date": "August 2021",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "91",
        "roaster": "Flattop Coffee Roastery",
        "title": "Ethiopia Kela Kochore",
        "blind_assessment": "Smooth, delicate, softly complex. Tangerine, papaya, narcissus-like flowers, sandalwood, a hint of roasted cacao nib in aroma and cup. Balanced, quietly lively acidity; light to medium, satiny mouthfeel. A dry finish consolidates around hints of cacao nib and fruit.",
        "notes": "Flattop includes free shipping with all orders. Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe coffees like this one processed by the wet or washed method (fruit skin and pulp are removed before drying) typically express great aromatic complexity and intensity with a particular emphasis on floral notes. Like virtually all Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Flattop is a small batch coffee roastery specializing in high-end specialty and single-origin coffees brought to gentle, lighter roast profile. Visit flattopcoffee.com or call 970-316-2228 for more information.",
        "bottom_line": null,
        "roaster location": "Estes Park, Colorado",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia.",
        "roast level": "Medium",
        "agtron": "48/64",
        "est. price": "$17.00/12 ounces",
        "review date": "August 2015",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "7"
    },
    {
        "rating": "92",
        "roaster": "Dinwei Cafe",
        "title": "Finca San Antonio El Salvador",
        "blind_assessment": "Mild though intricately deep; sweet, savory, rich. Cocoa, hemp-seed, scorched clove, fig, gardenia-like flowers in aroma and cup. Quiet but well-composed sweet/savory structure; light though nicely satiny mouthfeel. The finish is resonant and gently drying.",
        "notes": "This coffee tied for the third-highest rating in a tasting of El Salvador coffees for Coffee Review’s August 2019 tasting report. Produced from trees of the celebrated Geisha (also spelled Gesha) variety of Arabica. Processed by the honey method, which means that the outer skin is removed as it is in the wet or “washed” process, but at least some of the sticky fruit residue is allowed to dry on the bean. Dinwei Café is a café and micro-roaster specializing in fine coffee and fresh bakery goods. Visit www.facebook.com/dinweicoffee/ for more information.",
        "bottom_line": "A quietly original Geisha: sweet-savory, complexly aromatic.",
        "roaster location": "Taichung, Taiwan",
        "coffee origin": "Chalatenango Department, northwestern El Salvador",
        "roast level": "Light",
        "agtron": "66/76",
        "est. price": "NT $1200/230 grams",
        "review date": "August 2019",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Simon Hsieh's Aroma Roast Coffees",
        "title": "Kenya AA Top 405A Espresso",
        "blind_assessment": "Evaluated as espresso. Rich, deep, complexly expressed. Fresh-cut cedar, blood orange, roasted cocoa nib, lavender, musk in aroma and cup. Plush, silky mouthfeel. Cedar and lavender carry into a sweet, gently drying finish. Flavor carries impressively into three parts milk, with a crisp, lightly stated chocolate dominating and a fine finish.",
        "notes": "As opposed to most coffees which are carried by ship from origin to consuming country, this fine Kenya was air-lifted. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. AA is the highest trade of Kenya coffee based on bean size and freedom from physical imperfections. In addition to his retail roasting operation Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purposed-built commercial espresso blends and high quality single-origin coffees. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": null,
        "roaster location": "Taoyuan City, Taiwan",
        "coffee origin": "Central Kenya.",
        "roast level": "Medium",
        "agtron": "47/62",
        "est. price": "NTD$ 1600 / 16 ounces",
        "review date": "November 2014",
        "aroma": "9",
        "body": "9",
        "flavor": "10",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "Allegro Coffee",
        "title": "Costa Rica Santa Rosa 1900",
        "blind_assessment": "Rich, crisply balanced, deep. Blood orange, fresh-cut oak, narcissus, roasted cacao nib in aroma and cup. Rich, round, low-toned acidity; full, syrupy mouthfeel. The flowers and a particularly chocolaty cacao nib carry persuasively into a crisp finish.",
        "notes": "From trees of the Catuai variety of Arabica grown at an elevation of around 6,000 feet, meticulously prepared at La Lia Micro-Mill. Allegro Coffee Roasters is a long-established specialty roaster and subsidiary of Whole Foods Market. This coffee was roasted at the new in-store boutique Allegro roastery-café located in Berkeley, California, the second such Allegro in-store roastery to open, following the first in Brooklyn, New York. Visit www.allegrocoffee.com or call 800-227-1107 for more information.",
        "bottom_line": null,
        "roaster location": "Berkeley, California",
        "coffee origin": "Tarrazu growing region, central Costa Rica.",
        "roast level": "Medium-Light",
        "agtron": "55/67",
        "est. price": "$12.99/12 ounces",
        "review date": "December 2014",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Propeller Coffee",
        "title": "Papua New Guinea Baroida Washed",
        "blind_assessment": "Crisply sweet, fruit-toned. Plum, apple blossom, oak, caramel, lemon verbena in aroma and cup. Sweet-tart structure with gentle, round acidity; satiny mouthfeel. The finish rounds to notes of caramel-toned plum with a hint of lemon verbena.",
        "notes": "Produced by the Colbran family entirely of the Arusha and Bourbon varieties of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Propeller is a Toronto-based micro-roaster with a dedication to careful selection and exceptional craft roasting of high-end coffees. Visit www.propellercoffee.com or call 416-479-3771 for more information.",
        "bottom_line": "A quietly impressive washed-process PNG cup, delicate and deeply sweet.",
        "roaster location": "Toronto, Ontario, Canada",
        "coffee origin": "ainantu District, Eastern Highlands Province, Papua New Guinea",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "CAD $21.00/12 ounces",
        "review date": "April 2021",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Montana Coffee Traders",
        "title": "Santa Isabel 2007 Nicaragua Cup of Excellence",
        "blind_assessment": "As roasted here, a coffee most impressive for its big body and balanced structure. Deep, sweet aroma with honey and cherry notes and hints of cedar and chocolate. Sweet in the cup with quiet acidity, syrupy body, floral-toned honey and a hint of chocolate. Round, rich, simple finish.",
        "notes": "A prize winner in the 2007 Nicaragua Cup of Excellence (www.cupofexcellence.org) competition, where as a green (unroasted) coffee, farmer Jaime Armando Lovo's selection placed fifth out of hundreds of entries, attracting a score of 90.6 from an international jury. Montana Coffee Traders (\"How You Bean, Man!\") is a small-batch, quality-oriented roaster located in high northwestern Montana, near Glacier Park. Visit www.coffeetraders.com or call 800-345-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Whitefish, Montana",
        "coffee origin": "Nueva Segovia growing region, Nicaragua.",
        "roast level": "Medium-Dark",
        "agtron": "39/49",
        "review date": "October 2007",
        "aroma": "8",
        "acidity": "7",
        "body": "9",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "90",
        "roaster": "Capricorn Coffees",
        "title": "Jamaica Blue Mountain, 2002-03 Crop",
        "blind_assessment": "Delicate but rich. Medium body, sweet, round-toned acidity, and complex aromatics: In the aroma nut, floral, and cocoa-toned fruit, in the cup floral and spicy apple or pipe-tobacco notes. A cleanly balanced astringency enriches rather than flattens the finish.",
        "notes": "From RSW Estates, a consortium of three old Blue Mountain estates whose coffees are certified by the Coffee Board of Jamaica, but milled and exported separately from other Blue Mountain production. Capricorn Coffees, founded in 1963, is one of the San Francisco Bay Area's oldest specialty roasting companies. Visit www.capricorncoffees.com or call 800-541-0758 for more info.",
        "bottom_line": null,
        "roaster location": "San Francisco, California",
        "coffee origin": "Blue Mountain growing region, eastern Jamaica.",
        "roast level": "Medium",
        "agtron": "59/54",
        "review date": "March 2003",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "8"
    },
    {
        "rating": "79",
        "roaster": "Dunn Brothers",
        "title": "Ethiopia Sidamo",
        "blind_assessment": "The high-pitched fruit and vanilla tones in the aroma deepen to herbal wildness in the cup, then to hints of ferment in the finish. Sufficient body but not much dimension.",
        "notes": "High-pitched fruit and vanilla in the aroma deepen to herbal wildness in the cup. Grade Sidamo dry-process, Grade 5",
        "bottom_line": null,
        "roaster location": "St. Paul, Minnesota",
        "roast level": "Medium-Dark",
        "agtron": "47/50",
        "review date": "March 1997",
        "aroma": "8",
        "acidity": "7",
        "body": "6",
        "flavor": "5"
    },
    {
        "rating": "92",
        "roaster": "Magnolia Coffee",
        "title": "Papua New Guinea Timuza",
        "blind_assessment": "Richly sweet-toned, floral. Magnolia, brown sugar, cedar, plum, hazelnut in aroma and cup. Sweet structure with round, gentle acidity; satiny-smooth mouthfeel. The resonant finish consolidates to notes of brown sugar and magnolia.",
        "notes": "Certified organic. Produced by the Timuza Coffee Cooperative, which is comprised of small-holding farmers of the Kamano tribal group. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft roasted. Truly delicious. Socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs.Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.",
        "bottom_line": "A friendly, engaging PNG cup with leading notes of deep florals supported by sweet nut tones throughout the profile.",
        "roaster location": "Charlotte, North Carolina",
        "coffee origin": "Eastern Highlands,Papua New Guinea",
        "roast level": "Medium-Light",
        "agtron": "56/80",
        "est. price": "$15.00/12 ounces",
        "review date": "July 2019",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Thirty-Thirty Coffee Co.",
        "title": "Ecuador Lucas Vera",
        "blind_assessment": "Quietly rich, balanced, crisp. Sweet cream, orange blossom, fresh-cut fir, a hint of dark chocolate in aroma and cup. Clean, straightforward acidity; very lightly syrupy mouthfeel. Flavor notes consolidate in a long, gently resonant finish.",
        "notes": "Thirty-Thirty is a small-batch coffee roasting company located in Peoria Illinois that is committed to sourcing the finest green coffees and to expressing the individuality and character of those coffees through the roasting process all the way to the cup. Visit www.thirty-thirtycoffee.com or call 309-713-2983 for more information.",
        "bottom_line": null,
        "roaster location": "Peoria, Illinois",
        "coffee origin": "Vilcabamba, Loja Province, southern Ecuador.",
        "roast level": "Medium-Light",
        "agtron": "57/72",
        "est. price": "$22.00/12 ounces",
        "review date": "May 2013",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "Papa Lin's Coffee Roasting",
        "title": "Sumatra Lake Toba Peaberry",
        "blind_assessment": "Soft, enveloping, resonantly complex. Rose and violet floral notes, apricot, dark chocolate, clove and marjoram in aroma and cup. Bright, juicy acidity; satiny, buoyant mouthfeel. Flavor consolidates in a brisk short finish; floral and chocolate return sweetly in the long.",
        "notes": "This exceptional coffee was selected as the No. 25 coffee on Coffee Review’s list of the Top 30 Coffees of 2015. Coffees from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet hulling.” This is a particularly refined example of the type. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Papa Lin’s Coffee Roasting is a very small, “nano” roaster located in Yorktown Heights, New York, that features customized roasting profiles for every customer. Visit www.papalins.com for more information.",
        "bottom_line": null,
        "roaster location": "Yorktown Heights, New York",
        "coffee origin": "Lake Toba growing region, northern Sumatra, Indonesia.",
        "roast level": "Medium",
        "agtron": "47/65",
        "est. price": "$18.00/12 ounces",
        "review date": "April 2015",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "89",
        "roaster": "CC's Coffee",
        "title": "Colombia Dark Roast Decaf",
        "blind_assessment": "Dominated by a low-toned but richly intense fruit complex that in the aroma clearly and pleasurably reads as semi-sweet chocolate. In the cup turns toward something less chocolate and more cherry perhaps, with a little pungent lean toward Mediterranean herbs. Full-bodied and deeply dimensioned throughout.",
        "notes": "No decaffeination method is noted on the package, which probably means this Colombia was decaffeinated by the conventional or direct solvent method. CC's Coffee is the upscale specialty line of Community Coffee, a distinguished family-owned coffee company founded in 1919. Visit www.cc-coffee.com or call 800-535-9149 for more information.",
        "bottom_line": null,
        "roaster location": "Baton Rouge, Louisiana",
        "coffee origin": "Colombia",
        "roast level": "Medium-Dark",
        "agtron": "37/50",
        "review date": "June 2005",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "Queen Coffee",
        "title": "Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Crisply sweet, cocoa-driven. Cocoa nib, tangerine zest, pipe tobacco, alyssum, maple syrup in aroma and small cup. Richly smooth, satiny mouthfeel; crisp, cocoa-toned finish with undertones of pipe tobacco. In three parts milk, complex and floral — think cocoa nib with edible flowers.",
        "notes": "Queen Coffee (EMPRESS COFFEE 女皇咖啡 ) is a specialty coffee roaster that provides fresh-roasted coffee. Visit https://bit.ly/3scud1H for more information.",
        "bottom_line": "A deftly roasted, cocoa-driven espresso blend that manages to highlight deep tobacco as well as high-toned citrus and floral notes.",
        "roaster location": "New Taipei City, Taiwan",
        "coffee origin": "Not disclosed",
        "roast level": "Medium",
        "agtron": "51/64",
        "est. price": "NT $450/225 grams",
        "review date": "August 2021",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "92",
        "roaster": "Fresh Roasted Coffee",
        "title": "El Salvador Finca Hungria",
        "blind_assessment": "Sweetly nut-toned. Hazelnut, red apple, baking chocolate, magnolia, molasses in aroma and cup. Sweet structure with gentle, round acidity; crisp, lightly satiny mouthfeel. Nut-toned finish with crisp chocolate undertones.",
        "notes": "Certified USDA Organic and Rainforest Alliance-certified. Produced by the Olveira family at Finca Hungria from trees of the Bourbon, Caturra, Pacas and Catimor varieties of Arabica and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Founded in 2009, Fresh Roasted Coffee is committed to quality, service and sustainability. The company offers affordable, high-quality, freshly roasted specialty coffees. Visit www.freshroastedcoffee.com for more information.",
        "bottom_line": "A friendly, accessible El Salvador cup with richly sweet nut tones anchoring aroma and flavor.",
        "roaster location": "Sunbury, Pennsylvania",
        "coffee origin": "Santa Ana Department, El Salvador",
        "roast level": "Medium-Light",
        "agtron": "55/73",
        "est. price": "$14.95/12 ounces",
        "review date": "September 2021",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "85",
        "roaster": "Mr. Espresso",
        "title": "Organic Neapolitan Espresso",
        "blind_assessment": "The smoky tones are sweet and floral in the nose, but rather sharply pungent in the demitasse, where the flowers transform to pruny dry fruit with a hint of burned tones. Excellent in milk, which softens and sweetens the sharpness.",
        "notes": "The smoky tones are sweet and floral in the nose, but rather sharply pungent in the demitasse, where the flowers transform to pruny dry fruit with a hint of burned tones. Neapolitan refers to the somewhat darkish roast and intentionally sharp, milk-mastering taste of this blend produced entirely from certified organically grown coffees. Mr. Espresso is a small-batch wholesale roaster in the San Francisco Bay Area that uses",
        "bottom_line": null,
        "roaster location": "Oakland, California",
        "roast level": "NA",
        "agtron": "/",
        "review date": "August 2000",
        "aroma": "7",
        "body": "7",
        "flavor": "7"
    },
    {
        "rating": "93",
        "roaster": "Lexington Coffee Roasters",
        "title": "Chania Kenya",
        "blind_assessment": "Roundly bright, flowers and cocoa. Baking chocolate, passionfruit, roasted pecan, molasses, honeysuckle in aroma and cup. Delicately but intensely sweet-tart but poised in structure; light but very silky/supple in mouthfeel. Flavor consolidates in a sweet though drying finish.",
        "notes": "Produced by farmer Boyce Harries entirely from trees of the French Mission Bourbon variety of Arabica. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Founded in 1990, Lexington Coffee is an award-winning artisan roasting company based in Virginia. Lexington’s focus on fresh, flavorful and sustainable coffee is reflected in its motto, “Fresh, Flavorful & Fair.” Visit www.lexingtoncoffee.com or call 800-322-6505 for more information.",
        "bottom_line": "Drink it if you like a nuanced but bright, sweet-tart cup in the traditional style.",
        "roaster location": "Lexington, Virginia",
        "coffee origin": "Thika Plateau, Central Highlands, Kenya",
        "roast level": "Medium-Light",
        "agtron": "56/75",
        "est. price": "$23.95/12 ounces",
        "review date": "October 2019",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "7"
    },
    {
        "rating": "91",
        "roaster": "The Supreme Bean",
        "title": "Dolce Terra Organic Espresso",
        "blind_assessment": "Straightforward aroma with caramel and apricot-toned fruit. In the small cup syrupy and round, with a gentle fruit-toned cedar character and a mild musty-malty edge. Rich finish with a slight astringency. Very impressive in milk: semi-sweet chocolate with a fruity lean toward banana and apricot: rich, sweet, expansive.",
        "notes": "All coffees in this blend are certified organically grown. The Supreme Bean is a Los Angeles-area wholesale roaster specializing in high-end roasted-to-order espresso blends and single origins. Visit www.thesupremebean.com or call 888-288-5282 for more information.",
        "bottom_line": null,
        "roaster location": "North Hollywood, California",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium-Dark",
        "agtron": "43/55",
        "review date": "October 2006",
        "aroma": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "with milk": "10"
    },
    {
        "rating": "91",
        "roaster": "Doho Coffee Roasters",
        "title": "Doho Classic Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Balanced, crisply chocolaty. Baking chocolate, chicory, lily, dried plum, roasted walnut in aroma and small cup. Satiny mouthfeel; gently drying nut-toned finish with chicory undertones. In three parts milk, richly bittersweet with chocolate and chicory impulses and a hint of lily.",
        "notes": "A blend of coffees from Ethiopia, Guatemala and Brazil. The Taiwanese pronunciation of DOHO (tú-hó) means “pure serendipity.” Doho Coffee Roasters has two stores and is dedicated to promoting coffee culture through the high quality of its products. Visit https://www.facebook.com/DOHOCAFE or call +886-49-2318777 for more information.",
        "bottom_line": "A cohesive, harmonious, accessible espresso blend, crisply chocolaty and richly sweet, gently floral.",
        "roaster location": "Caotun, Nantou, Taiwan",
        "coffee origin": "Ethiopia; Guatemala; Brazil",
        "roast level": "Medium-Light",
        "agtron": "55/71",
        "est. price": "NT $650/455 grams",
        "review date": "March 2023",
        "aroma": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "7",
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "Counter Culture Coffee",
        "title": "Kenya Thiriku",
        "blind_assessment": "Rose-like flowers hover over a richly tart black currant note – think grapefruit fused with blackberry – in both aroma and cup. Crisp, delicately rich acidity with a hint of bite; silky mouthfeel.",
        "notes": "Produced mainly from trees of the admired, Bourbon-derived SL28 and SL34 varieties of Arabica, this coffee was grown by the Thiriku Coffee Growers Cooperative Society. Counter Culture is a wholesale specialty roaster with an informative and lively website, a commitment to fine coffee and youthful, enthusiastic leadership. Visit www.counterculturecoffee.com or call 888-238-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Durham, North Carolina",
        "coffee origin": "Nyeri County, Central Highlands, Kenya.",
        "roast level": "Medium-Light",
        "agtron": "55/79",
        "est. price": "$16.25/12 ounces",
        "review date": "September 2011",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "93",
        "roaster": "Revel Coffee",
        "title": "Colombia Betulia Natural Caturron",
        "blind_assessment": "Multi-layered, deeply sweet-tart. Candy apple, hibiscus tea, lemon verbena, cocoa nib, fresh-cut oak in aroma and cup. Briskly sweet acidity; plush, creamy mouthfeel. Very sweet, candy-like finish.",
        "notes": "Produced by Yeisson Calderon of Finca Villa Betuila, entirely of the Caturron variety of Arabica, and processed by the natural method (dried in the whole fruit). Revel Coffee is a micro-roaster located in Billings, Montana. Its motto: “Quality is paramount – a difference you can revel in.” Visit www.revelcoffee.com or call 406-534-9621 for more information.",
        "bottom_line": "An exceptionally sweet, gently tart Colombia natural with leading notes of hibiscus and candy apple, complicated by cocoa nib and rich aromatic wood tones.",
        "roaster location": "Billings, Montana",
        "coffee origin": "Acevedo, Huila Department, Colombia",
        "roast level": "Light",
        "agtron": "64/82",
        "est. price": "$31.50/12 ounces",
        "review date": "June 2024",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "States Coffee & Mercantile",
        "title": "Colombia Cauca At’e",
        "blind_assessment": "High-toned, richly sweet, delicately tart. Apple blossom, pomegranate, toffee, narcissus, cedar in aroma and cup. Sweet-tart structure with juicy, vibrant acidity; syrupy-smooth mouthfeel. Resonant finish consolidates to toffee and cedar with a hint of narcissus-like flowers in the long.",
        "notes": "Available for delivery in the San Francisco Bay Area; no mail order. Produced entirely of the Colombia and Caturra varieties of Arabica and processed by the wet, or washed, method. Founded by roaster Keith Gehrke in 2015, States Coffee is a single-location community-focused coffee shop in downtown Martinez, California, featuring coffee roasted in-house and artisan baked goods. Visit www.statescoffee.com for more information.",
        "bottom_line": "A bright, lively Colombia cup with tart fruit, sweet floral, and deep toffee notes throughout — elegantly structured.",
        "roaster location": "Martinez, California",
        "coffee origin": "Paéz, Cauca Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "60/78",
        "est. price": "$12.00/8 ounces",
        "review date": "June 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Mikava Coffee",
        "title": "Marsella Gesha #108 (Innovation Series)",
        "blind_assessment": "Delicately sweet-tart, fruit-driven. Lychee, raspberry, cocoa nib, honeysuckle, cedar in aroma and cup. Sweet-tart structure with bright, juicy acidity; crisp, satiny mouthfeel. Finish consolidates to notes of honeysuckle and cocoa nib.",
        "notes": "Produced entirely of the Gesha (also spelled Geisha) variety of Arabica and processed in the whole fruit by a complex sequence of fermentations including natural carbonic maceration (whole fruit is fermented in sealed tanks of CO2), before slow sun-drying. Mikava Coffee was founded in 2013 by the father-son team of Paul and Kevin Doyle, who specialize in experimental processing methods designed to bring out the complexity, sweetness and florality in coffee fruit. For more information, visit www.mikava.coffee.",
        "bottom_line": "A balanced, harmonious, subtly original Colombia Gesha cup: fruity, cocoa-toned, delicately floral.",
        "roaster location": "McMinnville, Oregon",
        "coffee origin": "Risaralda, Colombia",
        "roast level": "Light",
        "agtron": "60/82",
        "est. price": "$21.00/113 grams",
        "review date": "September 2021",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Red Rooster Coffee Roaster",
        "title": "Kenya Karindundu",
        "blind_assessment": "Complex, deeply pungent, sweetly savory. Lavender, pink peppercorn, gooseberry, lemongrass, baker’s chocolate in aroma and cup. Juicy, sweet-tart acidity; lightly creamy mouthfeel. Cocoa and lavender tones lead in a resonant, flavor-saturated finish.",
        "notes": "This exceptional coffee was selected as the No. 23 coffee on Coffee Review’s list of the Top 30 Coffees of 2016. Produced at the Karindundu mill from trees of the SL-28, SL-34 and Ruiru 11 varieties of Arabica. Despite challenges ranging from unclear government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world’s most elegant and distinctive coffee. Established in 2010, Red Rooster is an organic-certified micro-roaster focusing on socially conscious coffee and high-quality coffee. Visit redroostercoffee.com or call 540-745-7338 for more information.",
        "bottom_line": "A powerhouse, flavor-saturated, classic Kenya cup: bright, deep and juicy-sweet.",
        "roaster location": "Floyd, Virginia",
        "coffee origin": "Nyeri growing region, south-central Kenya",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "$17.99/12 ounces",
        "review date": "November 2016",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "92",
        "roaster": "Revel Coffee",
        "title": "Throwback Blend",
        "blind_assessment": "Intricate, layered, deeply sweet. Blackberry, nougat, roasted cacao nib, frankincense, tangerine zest in aroma and cup. Crisply sweet-tart structure; full, satiny mouthfeel. Notes of blackberry enveloped in cocoa frame the quiet short finish, rounding to incense-like aromatic wood and nougat in the long.",
        "notes": "A blend of two coffees: a Colombia Cauca and Kenya Karamundi. This coffee tied for the third-highest rating in a cupping of blends for Coffee Review‘s February 2018 tasting report. Revel Coffee is a micro-roaster located in Billings, Montana. Its motto: “Quality is paramount — a difference you can revel in.” Visit www.revelcoffee.com or call 406-534-9621 for more information.",
        "bottom_line": "A blend in which you can taste the influence of both the Colombia and the Kenya elements, the former chocolate-toned, the latter, sweetly tart. Combined, they generate a resonant, layered intricacy.",
        "roaster location": "Billings, Montana",
        "coffee origin": "Colombia; Kenya",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "$13.75/12 ounces",
        "review date": "February 2018",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Bar Nine",
        "title": "Lomi Tasha Worka, Ethiopia",
        "blind_assessment": "Delicate but deep; resonantly intricate. Lush rose, roasted cacoa-nib, mango chutney, blood orange, frankincense-like aromatic wood in aroma and cup. Bright, juicy, complex acidity; lightly silky, plush mouthfeel. Flavor consolidates but saturates a long finish.",
        "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. Like virtually all Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. This Yirgacheffe was sourced and exported by Levelup Coffee, a relatively new international coffee production company that produces mid-sized lots of green coffees with consistent and distinctive cup profiles. It is the creation of the team that developed Ninety Plus, the admired Panama- and Ethiopia-based producer of small-lot, high-end coffees. Bar Nine Collective is a premium micro-roaster offering a simple menu of high-end coffees only, whether in its sleek café or for brewing at home. Visit www.barnine.us or call 310-837-7815 for more information.",
        "bottom_line": null,
        "roaster location": "Los Angeles, California",
        "coffee origin": "Yirgacheffe growing district, southern Ethiopia.",
        "roast level": "Light",
        "agtron": "64/85",
        "est. price": "$25.00/12 ounces",
        "review date": "December 2014",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "10",
        "aftertaste": "8"
    },
    {
        "rating": "73",
        "roaster": "Trader Joe's",
        "title": "100% Colombia Instant Coffee",
        "blind_assessment": "Steamed wood (boiling water poured on board), caramel and a hint of dark chocolate in the aroma. The acidity hints at brightness, but lapses into a dull bitterness as the cup cools. Lightly syrupy mouthfeel. Boiled, or maybe burned, wood in the cup, rounded by caramel and the barest suggestion of dark chocolate. Sweet in the finish though quite astringent.",
        "notes": "An instant coffee evaluated as mixed in proportions of 2.5 grams to 150 ml or 5 ounces of hot water. Assuming a larger cup size and a more generous 3 grams per serving, this product costs approximately 9 cents per serving. Trader Joe’s is an innovative discount gourmet and natural foods supermarket chain with stores in over twenty states. Visit www.traderjoes.com for more information. Visit http://www.traderjoes.com for more information.",
        "bottom_line": null,
        "roaster location": "Monrovia, California",
        "coffee origin": "Colombia. All coffee of the Arabica species.",
        "roast level": "NA",
        "agtron": "0/0",
        "est. price": "$2.99/3.5 ounces instant",
        "review date": "March 2011",
        "aroma": "4",
        "acidity": "4",
        "body": "7",
        "flavor": "4",
        "aftertaste": "4"
    },
    {
        "rating": "93",
        "roaster": "Chocolate Fish Coffee Roasters",
        "title": "Misty Valley Ethiopia",
        "blind_assessment": "Delicate, fruit-forward. Dried raspberry, lilac, dark chocolate, peppermint, oak in aroma and cup. Rich-toned, juicy acidity; lightly satiny mouthfeel. The clean, lightly resonant finish leads with dark chocolate and lilac notes in the short, resolving with a re-emergence of a sweetly spicy peppermint in the long.",
        "notes": "Most Yirgacheffe coffee is prepared by the conventional wet method, in which the skin and pulp are removed from the beans or seeds before they are dried, encouraging a cleanly high-toned, often intensely floral- and citrus-toned cup. This Yirgacheffe is a “natural” or dry-processed version, however, meaning the beans/seeds were dried inside the fruit, encouraging a deeper-toned floral and fruit character. Like virtually all Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Chocolate Fish is a distinguished New-Zealand-inspired micro-roaster based in Sacramento California, focused on the best in both quality and integrity.Visit www.chocolatefishcoffee.com or call 916-451-5181 for more information.",
        "bottom_line": "A delicate, harmonious, berry-toned natural-processed Yirgacheffe coffee.",
        "roaster location": "Sacramento, California",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "60/84",
        "est. price": "$17.95/12 ounces",
        "review date": "September 2016",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Souvenir Coffee",
        "title": "Costa Rica Cloza Estate",
        "blind_assessment": "Crisp, balanced, richly nut-toned. Nutella, red apple, freesia, agave syrup, cedar in aroma and cup. Very sweet in structure with brisk acidity; plush, syrupy-smooth mouthfeel. Sweetly nut-toned finish supported by freesia-like floral tones.",
        "notes": "Produced by Kathia Zamora of Cloza Estate from trees of the Caturra and Catuaí varieties of Arabica and processed by the washed method. Souvenir Coffee, based in Berkeley, California, goes by the motto, “People first, then coffee.” Visit www.souvenir-coffee.com for more information.",
        "bottom_line": "A pleasing, delicately spice-toned, richly nutty Costa Rica cup, classically balanced.",
        "roaster location": "Berkeley, California",
        "coffee origin": "Alajuela, Costa Rica",
        "roast level": "Medium-Light",
        "agtron": "58/80",
        "est. price": "$19.00/12 ounces",
        "review date": "February 2021",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "caffè HABITU",
        "title": "Classico No.3 Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Impressively complex and deep straight shot. Minty dark chocolate, orangy and raisiny fruit, a hint of dusk flowers in aroma and small cup. Smooth, lightly syrupy mouthfeel; resonant, chocolate-toned finish. Fades a bit in two parts milk, although it retains a delicate, sweet version of chocolate and a continuing hint of flowers.",
        "notes": "Caffè HABITU, founded in Hong Kong, offers small-batch, on-demand roasting of the finest green coffees from around the world as well as coffee training and education through its Coffee Academy and Roasting Studio. Visit www.caffehabitu.com or call +852-3104-0075 for more information.",
        "bottom_line": null,
        "roaster location": "Hong Kong, China",
        "coffee origin": "Central America; South America; East Africa; Asia.",
        "roast level": "Medium",
        "agtron": "51/65",
        "est. price": "HK $98/165 grams",
        "review date": "June 2012",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "7"
    },
    {
        "rating": "93",
        "roaster": "Paradise Roasters",
        "title": "Sumatra Yellow Bourbon",
        "blind_assessment": "Richly sweet-savory, multi-layered. Baking chocolate, goji berry, saltwater taffy, bay leaf, freesia-like flowers in aroma and cup. Balanced, sweet structure with gently brisk acidity; full, satiny-smooth mouthfeel. Chocolaty and berry-driven finish with undertones of saltwater taffy.",
        "notes": "Produced at Lisa & Leo’s Farm, entirely of the Yellow Bourbon variety of Arabica, and processed by the traditional fermented and washed method. Paradise prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "A Sumatra cup that’s atypical in its processing method (conventionally washed rather than washed and wet-hulled like traditional Sumatras) and almost Kenya-like in its sweet-savory balance.",
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Pematang Purba, Simalungun, Sumatra, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "58/75",
        "est. price": "$35.00/12 ounces",
        "review date": "May 2022",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Mr. Espresso",
        "title": "Colombia El Bado",
        "blind_assessment": "Crisply sweet, complete. Roasted cacao nib, orangy citrus, almond butter, honeysuckle, apricot in aroma and cup. Sweetly tart, juicy acidity; lightly but distinctly syrupy mouthfeel. Cacao and flowers in particular persist in a sweet finish.",
        "notes": "El Bado is a Cup of Excellence record holder of sorts with four consecutive top-twenty placements, a tribute to the efforts of farmer Maria Diaz, who took over operations with the help of her son after her husband passed away. Mr. Espresso is a San Francisco Bay Area wholesale roaster and espresso parts distributer that slow-roasts its coffees using traditional wood-fired roasting machines. Visit www.mrespresso.com or call 510-287-5200 for more information.",
        "bottom_line": null,
        "roaster location": "Oakland, California",
        "coffee origin": "Narino Department, southern Colombia",
        "roast level": "Medium-Light",
        "agtron": "54/68",
        "est. price": "$12.00/12 ounces",
        "review date": "April 2014",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Dragonfly Coffee Roasters",
        "title": "Rwanda Gatare Natural",
        "blind_assessment": "Balanced, crisply fruit-toned. Black cherry, orange zest, almond, agave syrup, hint of lilac in aroma and cup. Sweet-toned structure with gentle acidity; full, syrupy mouthfeel. Delicately fruit-toned finish with undertones of almond.",
        "notes": "Produced by smallholding farmers, entirely of the Red Bourbon variety of Arabica, and processed by the natural method (dried in the whole fruit). Now based in Henderson, Nevada, Dragonfly Coffee was named 2019 Micro-Roaster of the Year by Roast magazine. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.",
        "bottom_line": "A pretty natural-processed Rwanda cup, fruit-forward and nutty with floral undertones.",
        "roaster location": "Henderson, Nevada",
        "coffee origin": "Western Province, Rwanda",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "$18.00/12 ounces",
        "review date": "May 2022",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Roadmap CoffeeWorks",
        "title": "Peru Maria Nieves",
        "blind_assessment": "Multi-layered, deep-toned. Dark chocolate, blackberry marjoram, praline, cedar in aroma and cup. Richly bittersweet with brisk acidity; plush, syrupy mouthfeel. The balanced finish centers around blackberry and chocolate notes.",
        "notes": "Produced by Maria Nieves from trees of the Bourbon, Caturra and Typica varieties of Arabica, and processed by the washed method (fruit skin and pulp removed before drying). Founded in 1990, Roadmap CoffeeWorks, formerly Lexington Coffee Roasters, is an award-winning artisan roasting company based in Lexington, Virginia. Roadmap CoffeeWorks focuses on producing fresh, distinctive and sustainable coffees. Visit www.roadmapcoffeeworks.com or call 800-322-6505 for more information.",
        "bottom_line": "A quietly complete Peru cup with deep berry, rich chocolate, and aromatic wood notes.",
        "roaster location": "Lexington, Virginia",
        "coffee origin": "La Coipa, San Ignacio, Cajamarca, Peru",
        "roast level": "Medium-Light",
        "agtron": "54/73",
        "est. price": "$23.50/12 ounces",
        "review date": "June 2023",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Java Blend Coffee Roasters",
        "title": "Kenya Igandene",
        "blind_assessment": "Bright but balanced. Tart coffee fruit reads as a crisp-toned but lavish layering of cherry, orange and lemon suggestions with an anchoring hint of fresh-cut fir. Intense but sweet-toned acidity; lightly silky mouthfeel. Sweet, rich short finish; a very slight hint of astringency in the long.",
        "notes": "Despite grower discontent and sporadic social disorder, Kenya continues to produce some of the world's most elegant and distinctive coffees. Java Blend Coffee Roasters is a small batch roasting company owned and operated by the same family since 1938. It custom-roasts and delivers coffee within two days of ordering throughout most of the Maritime Provinces of Canada. Visit www.javablendcoffee.com or call 877-596-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Halifax, Nova Scotia, Canada",
        "coffee origin": "South-central Kenya.",
        "roast level": "Medium",
        "agtron": "52/59",
        "est. price": "CAD $16.40/16 ounces",
        "review date": "June 2011",
        "aroma": "8",
        "acidity": "9",
        "body": "7",
        "flavor": "9",
        "aftertaste": "7"
    },
    {
        "rating": "93",
        "roaster": "Spix's Cafe",
        "title": "Brazil Red Catuaí Double-Anaerobic",
        "blind_assessment": "Sweetly and deeply bright. Dried cherry, dark chocolate, magnolia, cedar, marjoram in aroma and cup. Sweetly savory structure with delicate, deep-toned acidity; silky-smooth mouthfeel. Simple, clean finish, chocolaty and sweet.",
        "notes": "Comprised entirely of the Red Catuaí variety of Arabica and processed by the anaerobic natural method (fermentation of the whole fruit occurs in a hermetically sealed, oxygen-free vessel before the fruit is dried). Spix’s Cafe is a Taipei-based coffee roaster specializing exclusively in coffees from Brazil. Visit https://www.facebook.com/SpixsCafeEspecialTaiwan/ for more information.",
        "bottom_line": "A quietly confident anaerobic natural Brazil cup, chocolaty, deep, floral, fruit-toned.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Minas Gerais State, Brazil",
        "roast level": "Medium-Light",
        "agtron": "56/72",
        "est. price": "NT $340/8 ounces",
        "review date": "May 2022",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "GreenAlives",
        "title": "Sweet Breeze 17",
        "blind_assessment": "Delicately sweet and bright; subtly intricate. Sugared lemon zest, sandalwood, mango, roasted cacao nib, dried jasmine in aroma and cup. Sweet, softly tart acidity; smooth, silky mouthfeel. Pungent mango and sandalwood in particular sustain in a surprisingly rich finish.",
        "notes": "A blend composed of a dried-in-the-fruit or “natural”-processed coffee from an undisclosed Central America origin and a wet-processed or “washed” coffee from the Yirgacheffe region of Ethiopia. GreenAlives is a small-batch roasting company located in the Taishan District of New Taipei City, Taiwan that pursues quality in every act of coffee production from green coffee selection through storage, roasting and educating customers in optimum brewing practice. Visit www.greenalives.com or call +886-0921-884-579 for more information.",
        "bottom_line": "For those who value sweetness in a subtly complex coffee expression.",
        "roaster location": "New Taipei City, Taiwan",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia; Central America",
        "roast level": "Medium-Light",
        "agtron": "54/82",
        "est. price": "NT $450/8 ounces",
        "review date": "January 2017",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "States Coffee",
        "title": "Cold Brew",
        "blind_assessment": "A ready-to-drink black coffee, tested cold. Dark chocolate fudge, raspberry coulis, molasses, almond butter, redwood. Richly sweet structure with brisk acidity; velvety-smooth mouthfeel. The finish is chocolaty, through and through — in milk, dessert-like, reminiscent of a chocolate-raspberry truffle.",
        "notes": "The coffee tied for the second-highest rating in a tasting of ready-to-drink black coffees for Coffee Review’s July 2021 tasting report. Prepared by steeping coffee overnight in warm water, then filtering and chilling. Contains no additives or ingredients other than coffee and water. The green coffee used is a blend of two coffees: a washed-process Guatemala and a natural Ethiopia. Founded in 2015, States Coffee is a community-focused coffee and bread company in the Bay Area of California, featuring coffee roasted in-house and artisan-baked goods. Available in-store only. Visit www.statescoffee.com for more information.",
        "bottom_line": "A deeply chocolaty, almost fudge-like, cold brew pleasingly complicated by hints of raspberry and molasses.",
        "roaster location": "Martinez, California",
        "coffee origin": "Guatemala; Ethiopia",
        "roast level": "NA",
        "agtron": "0/0",
        "est. price": "$4.25/12-ounce bottle",
        "review date": "July 2021",
        "aroma": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9",
        "with milk": "9"
    },
    {
        "rating": "95",
        "roaster": "JBC Coffee Roasters",
        "title": "La Perla Chiquita Ecuador",
        "blind_assessment": "Evaluated as espresso. Complex, multi-layered, rich-toned. Red plum, dark chocolate, cashew butter, cocoa nib, a hint of rosemary in aroma and small cup. Very syrupy mouthfeel; resonant, flavor-laden finish. In three parts milk, red plum and cashew butter take center stage, supported by gentle cocoa nib and a whisper of a savory, rosemary-like herb.",
        "notes": "This exceptional coffee was selected as the No. 14 coffee on Coffee Review’s list of the Top 30 Coffees of 2021. Produced by the Lomas Obando family of Finca La Perla Chiquita, entirely of the Typica Mejorado variety of Arabica and processed by the washed method. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A compellingly sweet-savory Ecuador Typica with bright, juicy acidity, especially smooth mouthfeel, and confident, long finish.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Pichincha Province, Ecuador",
        "roast level": "Medium-Light",
        "agtron": "56/76",
        "est. price": "$21.00/12 ounces",
        "review date": "June 2021",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "90",
        "roaster": "JBC Coffee Roasters",
        "title": "Guatemala Alotenango La Candelaria Espresso",
        "blind_assessment": "Evaluated as espresso. Sweet-toned, pleasing but simple aromatics: roasted almond, lemon, grape. Buttery mouthfeel. Dry plum, lemon/lime-like citrus and anise carry from the small cup into finish. Continued hints of lemon and anise in a well-balanced, two-part milk drink.",
        "notes": "Finca Candelaria is owned and managed by Luis Pedro Zelaya Sr. who, over the past several years has taken a once run-down farm and revitalized it. JBC Coffee Roasters (formerly Johnson Brothers Coffee Roasters) is a distinguished small-batch roasting company. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Alotenango, Guatemala.",
        "roast level": "Medium",
        "agtron": "46/56",
        "est. price": "$12.95/12 ounces",
        "review date": "November 2011",
        "aroma": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8",
        "with milk": "8"
    },
    {
        "rating": "92",
        "roaster": "Temple Coffee Roasters",
        "title": "Ethiopia Reko Estate Yirgacheffe",
        "blind_assessment": "Sweet, quietly intense, floral-toned. Rose, sandalwood, cashew, lemon verbena, a hint of mace in aroma and cup. Crisp and balanced in structure; silky mouthfeel. Flowers carry on deep into the finish.",
        "notes": "Produced by the Reko Farming Cooperative from indigenous tree varieties long grown in the region and processed by the washed method (fruit skin and pulp are removed before drying). Temple Coffee is a quality-focused retail and wholesale specialty roaster active in Sacramento, California since 2005. Committed to sourcing, roasting and brewing the finest coffees, Temple features coffee from distinguished single estates and cooperatives around the world. Visit www.templecoffee.com or call 916-454-1282 for more information.",
        "bottom_line": "Sweet flowers and intense sandalwood power this silky-bodied, fragrant Yirgacheffe.",
        "roaster location": "Sacramento, California",
        "coffee origin": "Yirgacheffe growing region, Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "54/74",
        "est. price": "$19.50/12 ounces",
        "review date": "February 2020",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Flight Coffee Co.",
        "title": "Papua New Guinea AA Akora",
        "blind_assessment": "Sweet, floral, clean. Lavender and plum flower, honey, cherry, candied pecan in aroma and cup. Lightly bright and juicy acidity, creamy mouthfeel. The plum-blossom note in particular lingers in a sweet and persistent finish.",
        "notes": "The high mountain valleys of central Papua New Guinea offer some of the world’s most favorable terroirs for production of fine coffee. When these coffees are carefully prepared by the traditional wet or washed method, as is the case with this coffee, they can compete with the worlds finest. Flight Coffee Co. (formerly CQ Coffee Roasters) is a coffee-loving, quality-focused roasting company based in Bedford, New Hampshire.Visit www.flightcoffeeco.com or call 603-836-6228 for more information.",
        "bottom_line": null,
        "roaster location": "Bedford, New Hampshire",
        "coffee origin": "Eastern Highlands Province, Papua New Guinea",
        "roast level": "Medium-Light",
        "agtron": "57/72",
        "est. price": "$12.00/12 ounces",
        "review date": "March 2013",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "91",
        "roaster": "Green Mountain Coffee",
        "title": "Colombian Dos Quebradas Special Reserve Cup of Excellence",
        "blind_assessment": "A deep, spicy floral character - dusk flowers, tea rose - leads in aroma and cup, supported by low-acid fruit notes - peach, cherry - and hints of milk chocolate and leather. The acidity is deep-toned and round, the finish rich and clean.",
        "notes": "A prize winner in the 2006 Colombia First Harvest Cup of Excellence competition, where as a green (unroasted) coffee it placed fourth out of hundreds of entries, attracting a score of 90.2 from an international jury. Produced from trees of the caturra variety of Arabica on the \"Dos Quebradas\" farm of Alonso Sevilla Zuniga at a growing altitude of approximately 5,600 feet. This coffee is part of Green Mountain's newly launched \"Special Reserve\" series of select small lots of seasonally available coffees. Keurig/Green Mountain, formerly Green Mountain Coffee Roasters, pioneered single-serve capsule brewing in the United States with its Keurig brewing system, and remains one of the country’s leading large specialty roasters, offering a particularly wide-ranging variety of origins and roast styles. Visit www.GreenMountainCoffee.com or call 888-879-4627 for more information.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont",
        "coffee origin": "Huila Department, southern Colombia.",
        "roast level": "Medium",
        "agtron": "50/67",
        "review date": "August 2006",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "George Howell Coffee Company",
        "title": "Yukro Ethiopia",
        "blind_assessment": "Intensely sweet, complex fruit (marmalade-like orange, plum, blackberry) and flowers (rose, lavender) in aroma and particularly cup. Lushly bright, juicy acidity; lightly syrupy mouthfeel. Flavor consolidates but sustains in a long, deep finish.",
        "notes": "Produced by small-holding members of the Yukro Cooperative at high growing elevations from indigenous heirloom varieties of Arabica. Terroir is a microroaster focusing on elite single-origin coffees. It was a pioneer in the revival of medium roast styles designed to foreground the character of the green coffee. Terroir is the creation of George Howell, one of the world's leading coffee visionaries. Visit www.georgehowellcoffee.com or call 866-444-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Acton, Massachusetts",
        "coffee origin": "Gera District of Oromia Region, western Ethiopia.",
        "roast level": "Medium-Light",
        "agtron": "57/72",
        "est. price": "$21.00/12 ounces",
        "review date": "February 2013",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "10",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Intelligentsia Coffee",
        "title": "Colombia Tres Santos Micro-Lot Melange",
        "blind_assessment": "Very deep, resonant aroma, with distinct floral and cherry-toned coffee fruit notes, buttery chocolate, and a slight, bracing suggestion of fresh-cut cedar. In the cup giddily and sweetly acidy, with continued clear, intense floral notes and a Chardonnay-like fruit. A hint of butter and, as the cup cools, ripe tomato. The cleanly rich finish stiffens just slightly as the cup cools.",
        "notes": "A blend or \"melange\" of two coffee lots purchased by Intelligentsia based on its exclusive relationship with a group of seven small Colombian cooperatives. These two lots, chosen by Intelligentsia coffee buyer Geoff Watts, were produced respectively by farmers Jair Garcia and Alciabiades Garcia. Intelligentsia is a leading Chicago-area roaster with a Keith Haring-style logo, excellent coffee, and a commitment to quality epitomized by the practice of printing roast dates on coffee packaging. Visit www.intelligentsiacoffee.com or call 888-945-9786 for more information.",
        "bottom_line": null,
        "roaster location": "Chicago, Illinois",
        "coffee origin": "Valle de Cauca Department, western Colombia",
        "roast level": "Medium-Light",
        "agtron": "55/69",
        "review date": "February 2006",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "Arbuckle Coffee",
        "title": "Guatemala Atitlan",
        "blind_assessment": "A hint of ferment pleasantly hovers between chocolate and cherry-toned, overripe fruit. The darkish roast turns the sweet fruit dryly rich.",
        "notes": "A hint of ferment pleasantly hovers between roast-induced chocolate and cherry-toned, overripe fruit. La Voz que Clama en el Desierto, The Voice that Calls in the Wilderness, is the poetic name of this coffee from a cooperative in the mountains above Lake Atitlan. It is a triple certified coffee, meaning it is organically grown, Eco-OK (shade-grown and sustainable.",
        "bottom_line": null,
        "roaster location": "Tucson, Arizona",
        "coffee origin": "Lake Atitlan basin, south central Guatemala.",
        "roast level": "NA",
        "agtron": "/",
        "review date": "April 2000",
        "aroma": "7",
        "acidity": "8",
        "body": "6",
        "flavor": "8"
    },
    {
        "rating": "88",
        "roaster": "Armeno Coffee",
        "title": "Kenya – Marua AA",
        "blind_assessment": "A high score but a relatively low wow quotient. Apparently panelists valued this coffee for its rich balance and deeply matrixed fruit; the body was described variously as full, heavy, and thick. However, several panelists felt the cup was a bit faded, restrained, \"past-croppish.\" Perhaps this is an instance when the mid-season timing of the cupping did prejudice the cupping results.",
        "notes": "This big, full-bodied coffee displays a rich balance and deeply matrixed fruit. Awarded the second highest score ever by the Coffee Review Cupping Board. This coffee was reviewed as a green coffee, and is offered by this roaster. This Kenya AA sample is from an auction lot from a single cooperatively owned Kenya mill. This coffee was reviewed as green coffee, and is offered by this roaster.",
        "bottom_line": null,
        "roaster location": "Northborough, Massachusetts",
        "roast level": "NA",
        "agtron": "/",
        "review date": "March 1999",
        "aroma": "7.5",
        "acidity": "7.6",
        "body": "7.0",
        "flavor": "7.7"
    },
    {
        "rating": "92",
        "roaster": "Jebena Coffees",
        "title": "Ethiopia Guji Girma Natural",
        "blind_assessment": "Crisp, richly sweet. Cocoa nib, apricot, almond, cedar, maple syrup in aroma and cup. Sweet-tart in structure with brisk acidity; full, syrupy mouthfeel. The finish consolidates to notes of cocoa toned almond and stone fruit.",
        "notes": "Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian varieties of Arabica long grown in the region. This is a dry-processed or “natural” version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Jebena Coffees is a Dubai-based custom-built roasting facility with a temperature- and humidity-controlled storage area and a professional cupping lab. Jebena offers coffees for both retail and wholesale purchase, as well as coffee training at every level. Visit www.jebenacoffees.com for more information.",
        "bottom_line": "A high-toned natural-processed Ethiopia that is fruit-forward without a hint of ferment.",
        "roaster location": "Dubai, United Arab Emirates",
        "coffee origin": "Guji Zone, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "AED $103.95/250 grams",
        "review date": "September 2019",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Gavagai",
        "title": "Brazil Sitio do Tanque",
        "blind_assessment": "Quiet, delicately lush, gently tart. Peach, a crisply dry version of blackberry and night flowers dominate in aroma and cup. Softly bright acidity; full, plush mouthfeel. Peach carries into a balanced finish.",
        "notes": "From the Fazenda Sitio Tanque in the relatively new growing region of Chapada Diamantina. Processed by the pulped natural method, in which the skin is removed from the coffee fruit immediately after picking but the seeds or beans are dried with the sweet pulp, or fruit flesh, still adhering to them. From trees of the Catuai and Mundo Novo varieties. Gavagai is a Taiwanese one-location, in-store roaster specializing in siphon-brewed single-origin coffees and single-origin espressos. Visit www.facebook.com/GavagaiCafe for more information.",
        "bottom_line": null,
        "roaster location": "Kaohsiung City, Taiwan",
        "coffee origin": "Chapada Diamantina growing region, Bahia State, Brazil.",
        "roast level": "Medium-Light",
        "agtron": "58/75",
        "est. price": "NTD $350/8 ounces",
        "review date": "April 2012",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "JBC Coffee Roasters",
        "title": "Tano Batak Sumatra",
        "blind_assessment": "Juicy sweet, tartly spicy. Blackberry, pungent cedar, moist fresh-fallen leaves, hints of lemon and cocoa. Balanced, rich acidity; lightly syrupy mouthfeel. Long finish rich with pungently sweet berry and cedar.",
        "notes": "JBC Coffee Roasters (formerly Johnson Brothers Coffee Roasters) is a distinguished small-batch roasting company. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Northern Sumatra, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "57/80",
        "est. price": "$12.99/12 ounces",
        "review date": "May 2012",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "Conscious Cup Coffee Roasters",
        "title": "Ethiopia Harrar",
        "blind_assessment": "Intense aroma and flavor dominated by deep, jasmine-like flowers and tartly sweet fruit: pomegranate, bergamot, raspberry. Rich, complexly expressed acidity; lightly syrupy mouthfeel. The finish is lemony, sweet, and very long.",
        "notes": "Grown and processed by members of the Oromia Coffee Farmers Cooperative Union, this coffee is Fair Trade certified, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Harrar is one of the world's oldest and most traditional coffees. As it has been for centuries, it is simply picked and spread in the sun to dry inside the fruit. Conscious Cup Coffee Roasters is independent and family-owned and operated cafe and coffee roaster specializing in socially and environmentally sustainable coffees. Visit www.consciouscup.com or call 815-356-0115 for more information.",
        "bottom_line": null,
        "roaster location": "Crystal Lake, Illinois",
        "coffee origin": "Harrar region of eastern Ethiopia; east Java, Indonesia.",
        "roast level": "Medium",
        "agtron": "48/70",
        "est. price": "$15.40/12 ounces",
        "review date": "November 2011",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "95",
        "roaster": "Flight Coffee Co.",
        "title": "Tanzania Ngorongoro Ridge Peaberry",
        "blind_assessment": "High-toned, richly sweet-savory. Red currant, dark chocolate, tangerine zest, hop flowers, sandalwood in aroma and cup. Richly bittersweet structure with vibrant, juicy acidity; plush, syrupy mouthfeel. Deep, flavor-saturated finish with red currant and dark chocolate carrying well into the long.",
        "notes": "This exceptional coffee was selected as the No. 5 coffee on Coffee Review’s list of the Top 30 Coffees of 2019. This coffee also earned the highest rating in a cupping of coffees from New England roasters for Coffee Review’s February 2019 tasting report. Produced entirely from trees of the Bourbon variety of Arabica, this is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. This particular sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Flight Coffee is a coffee-loving, quality-focused roasting company based in Bedford, New Hampshire. Visit www.flightcoffeeco.com or call 603-836-6228 for more information.",
        "bottom_line": "A lush Tanzania cup laden with red fruit and deep chocolate tones throughout, lifted by a bright acidity.",
        "roaster location": "Bedford, New Hampshire",
        "coffee origin": "Arusha Region, northern Tanzania",
        "roast level": "Medium-Light",
        "agtron": "55/79",
        "est. price": "$16.00/12 ounces",
        "review date": "February 2019",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "93",
        "roaster": "Willoughby's Coffee & Tea",
        "title": "Kenya AA Gachatha Estate",
        "blind_assessment": "A dramatically light roast of a flawless coffee nets an intensely high-toned, delicate cup. Honey and flowers in the aroma, in the cup sweet-toned, wine-like acidity, silky mouthfeel, continued honey, flowers and white wine with a pungent hint of pipe tobacco. The finish is rich and dry without imbalancing astringency.",
        "notes": "Despite national coffee leadership marked by confusion and recent social disorder, Kenya cooperatives continue to produce some of the world's most elegant and distinctive coffees. Willoughby's Coffee & Tea is a pioneer specialty coffee roaster recently reinvigorated and refocused on artisan roasting and a very extensive collection of elite single-origin coffees. Visit www.willoughbyscoffee.com or call 800-388-8400 for more information.",
        "bottom_line": null,
        "roaster location": "Branford, Connecticut",
        "coffee origin": "South-central Kenya.",
        "roast level": "Light",
        "agtron": "69/94",
        "review date": "August 2008",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Madness Roastworks",
        "title": "The Godfather",
        "blind_assessment": "Evaluated as espresso. Floral-toned, gently spicy. Freesia, baking chocolate, candied walnut, fresh-cut cedar, agave syrup in aroma and small cup. Crisply sweet structure with brisk acidity; lightly satiny mouthfeel. Bittersweet finish with notes of freesia and candied walnut. Crisply chocolaty in cappuccino-scaled milk.",
        "notes": "A blend of coffees from Ethiopia, Panama and Peru. Madness Roastworks is a specialty coffee roaster, coffee shop, and coffee consulting firm based in Sabah, Malaysia. Visit www.facebook.com/madnessroastworks for more information.",
        "bottom_line": "A straight-ahead blend of three washed-process coffees, crisply chocolaty and delicately floral-toned.",
        "roaster location": "Kota Kinabalu, Sabah, Malaysia",
        "coffee origin": "Ethiopia; Panama; Peru",
        "roast level": "Medium-Light",
        "agtron": "56/70",
        "est. price": "RM 120/350 grams",
        "review date": "July 2022",
        "aroma": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "8"
    },
    {
        "rating": "91",
        "roaster": "Barrington Coffee Roasting Co.",
        "title": "165 Espresso",
        "blind_assessment": "Evaluated as espresso. Suggestions of flowers, aromatic wood and a vanilla-infused dark chocolate in the aroma. In the small cup medium body and deeper flavors leaning toward black cherry and molasses. Sustains character in two parts milk: aromatic wood, dark chocolate, even a hint of flowers and vanilla.",
        "notes": "This espresso blend combines wet-processed and pulped natural (dried in the fruit pulp) coffees from El Salvador and Ethiopia. Barrington Coffee is an artisan roaster dedicated to elite coffees, fresh delivery and roasting that foregrounds the coffee and not the roast. Visit www.barringtoncoffee.com or call 800-528-0998 for more information.",
        "bottom_line": null,
        "roaster location": "Lee, Massachusetts",
        "coffee origin": "El Salvador; Ethiopia.",
        "roast level": "Medium",
        "agtron": "45/59",
        "est. price": "$13.45/16 oz.",
        "review date": "July 2010",
        "aroma": "9",
        "body": "7",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "8"
    },
    {
        "rating": "94",
        "roaster": "Paradise Roasters",
        "title": "Kona Maragogype Natural",
        "blind_assessment": "Deeply and richly sweet, resonantly aromatic. Dried mango, wild honey, lilac, pistachio, tangerine zest in aroma and cup. Juicy-sweet structure with refined acidity; lush, syrupy mouthfeel. The finish centers around notes of mango, honey and pistachio.",
        "notes": "Produced at Aloha Hills Farm entirely of the Maragogype (also Maragogipe) variety of Arabica and processed by the natural method (beans are dried in the whole fruit). Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "A pretty, tropical-leaning, richly floral Kona Maragogype processed by the natural method — juicy, vibrant, complex, nuanced.",
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Kainaliu, Kona, Big Island of Hawai’i",
        "roast level": "Medium-Light",
        "agtron": "58/82",
        "est. price": "$29.95/4 ounces",
        "review date": "April 2021",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "DOMA Coffee Roasting Company",
        "title": "Costa Rica Las Lajas Natural",
        "blind_assessment": "A richly balanced cup. Notes of sweet orange and floral-toned herb (coriander?) in the aroma. Softly bright acidity, lightly syrupy mouthfeel. In the cup flavor leans toward black cherry and grapy dessert wine. Richness carries deep into the finish, as does flavor.",
        "notes": "Produced by third generation coffee farmer Francisca Salas and her family. The term natural refers to the dry-processed method wherein the coffee is dried inside the fruit, an unusual procedure for Costa Rica coffee. Doma Coffee Roasting specializes in organic and Fair-Trade certified coffees and takes pride in a rigorous program of recycling and environmentally responsible business practices. The Doma slogan is \"Coffee/Culture/Meaning.\" Visit www.domacoffee.com or call 208-667-1267 for more information.",
        "bottom_line": null,
        "roaster location": "Post Falls, Idaho",
        "coffee origin": "Alajuela growing region, central Costa Rica.",
        "roast level": "Medium",
        "agtron": "47/60",
        "est. price": "$10.90/12 ounces",
        "review date": "February 2011",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "Dragonfly Coffee Roasters",
        "title": "Rwanda Kanzu",
        "blind_assessment": "Spiced-toned, richly floral. Wisteria, sweet lime zest, date, white peppercorn, cocoa powder in aroma and cup. Sweet-tart structure with punchy acidity; crisp, lively, satiny mouthfeel. The short finish suggests a cannabis-like pungency, while cocoa and wisteria notes carry into the long.",
        "notes": "Produced entirely from trees of the heirloom Bourbon variety and processed at the award-winning Kanzu washing station or wet mill. Rwanda’s potential as fine coffee producer has only come to fruition over the past two decades owing to generous support from international aid agencies, the specialty coffee community and the industry of its growers. Boulder, Colorado-based Dragonfly Coffee was named 2019 Micro-Roaster of the Year by Roast magazine. Visit dragonflycoffeeroasters.com or call 303-579-2154 for more information.",
        "bottom_line": "Big, characteristic Rwanda sweet-tartness juxtaposed with savory depth, with a supporting intrigue of spice, flowers and complex fruit.",
        "roaster location": "Boulder, Colorado",
        "coffee origin": "Nyamasheke, Rwanda",
        "roast level": "Medium-Light",
        "agtron": "55/77",
        "est. price": "$24.00/12 ounces",
        "review date": "February 2019",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Counter Culture Coffee",
        "title": "Kenya Ndaroini Microlot",
        "blind_assessment": "An intensely complex aroma: flowers, lemon, plum, pungent fresh-cut pine, toast. Fruit tones persist in the sweet acidity and delicately juicy mouthfeel. Balanced, rounded flavor: orangy sweetness to heady flowers to gentle chocolate notes. Finishes cleanly, with mild citrus notes that sweeten in the long.",
        "notes": "Despite stresses brought on by social unrest, charges of corruption and a confused transition toward an open market, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. Counter Culture Coffee is a small-batch wholesale specialty roaster with an informative and lively website, a commitment to exceptional coffee and youthful, enthusiastic leadership. Visit www.counterculturecoffee.com or call 888-238-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Durham, North Carolina",
        "coffee origin": "South-central Kenya.",
        "roast level": "Medium",
        "agtron": "52/69",
        "review date": "December 2008",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "92",
        "roaster": "Roadmap CoffeeWorks",
        "title": "Blue Ridge Blend",
        "blind_assessment": "Chocolaty, richly nut-toned. Dark chocolate, hazelnut butter, red apple, gently scorched fir, gardenia in aroma and cup. Sweet structure with gentle, round acidity; full, satiny mouthfeel. Chocolaty finish with undertones of gently scorched fir and hazelnut.",
        "notes": "Founded in 1990, Roadmap CoffeeWorks, formerly Lexington Coffee Roasters, is an award-winning artisan roasting company based in Lexington, Virginia. Roadmap CoffeeWorks focuses on producing fresh, distinctive and sustainable coffees. Visit www.roadmapcoffeeworks.com or call 800-322-6505 for more information.",
        "bottom_line": "A deftly, darker-roasted blend, richly sweet and chocolaty and delicious with a splash of whole milk if you’re so inclined.",
        "roaster location": "Lexington, Virginia",
        "coffee origin": "Not disclosed",
        "roast level": "Medium",
        "agtron": "46/72",
        "est. price": "$16.95/12 ounces",
        "review date": "October 2022",
        "aroma": "8",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "79",
        "roaster": "Melitta",
        "title": "A Cafe Kind of Day Colombian (pod)",
        "blind_assessment": "The aroma is woody with faint lemon and chocolate suggestions. The body is substantial, the cup round in mouthfeel with a low-toned acidity complicated by a vague dry fruit, more like prune pits than prunes. Further flattens and turns astringent as the cup cools.",
        "notes": "This coffee is delivered in proprietary pods designed for the Melitta One:One single-serve brewer. The One:One brewing device is a Salton design, manufactured and distributed by Melitta under a licensing agreement. Melitta, the coffee giant with world headquarters in Minden, Germany, roasts and packages its coffees in New Jersey for the American market. Visit www.1to1coffee.com for more info.",
        "bottom_line": null,
        "roaster location": "Clearwater, Florida",
        "coffee origin": "Colombia",
        "roast level": "Very Dark",
        "agtron": "0/60",
        "review date": "January 2004",
        "aroma": "6",
        "acidity": "6",
        "body": "8",
        "flavor": "5"
    },
    {
        "rating": "94",
        "roaster": "Paradise Roasters",
        "title": "Nicaragua La Benedicion SL28 Natural",
        "blind_assessment": "Deep, chocolaty, fruit-forward. Black cherry, almond nougat, frankincense, fresh-cut oak, honey in aroma and cup. Sweet-tart structure with bright, winy acidity; viscous, creamy mouthfeel. Focused fruit-forward finish with undertones of honey.",
        "notes": "Produced by Luis Alberto entirely of the Kenya-originated SL28 variety of Arabica and processed by the natural method. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "Interesting for several reasons: variety (Kenya’s famous SL28), origin (Nicaragua) and processing method (dried-in-the-fruit or natural) — a trifecta of compelling reasons to experience this innovative coffee.",
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Nueva Segovia, Nicaragua",
        "roast level": "Light",
        "agtron": "62/80",
        "est. price": "$19.95/6 ounces",
        "review date": "August 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Cafe Virtuoso",
        "title": "Virtuoso Espresso",
        "blind_assessment": "Deep, savory/sweet. Dark chocolate, fresh-cut cedar, plum, hints of rose and perhaps thyme in aroma and small cup. Full, lightly syrupy mouthfeel; clean, rich and, chocolate-toned in the finish. In three parts milk a complexly expressed, plummy dark chocolate dominates.",
        "notes": "Coffees in this blend are certified organically grown and Fair Trade certified, meaning they were purchased from small-holding farmers at a \"fair\" or economically sustainable price. Café Virtuoso subtitles this blend a “traditional European style” espresso. Virtuoso is a small-batch coffee roaster that strives to procure, roast and deliver the best quality coffee in San Diego. Visit www.cafevirtuoso.com or call 619-550-1830 for more information.",
        "bottom_line": null,
        "roaster location": "San Diego, California",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium",
        "agtron": "49/53",
        "est. price": "$14.00/12 ounces",
        "review date": "July 2013",
        "aroma": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9",
        "with milk": "9"
    },
    {
        "rating": "88",
        "roaster": "Green Mountain Coffee",
        "title": "Sumatra Reserve Fair-Trade Organic",
        "blind_assessment": "Pungent, deep and roasty. Lightly scorched cedar, nut-toned dark chocolate and hints of flowers and earth in aroma and cup. Roast-muted acidity; leanish mouthfeel. Dark chocolate in particular emerges in a long, rich finish.",
        "notes": "Certified organically grown and Fair Trade, meaning this coffee was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Keurig/Green Mountain, formerly Green Mountain Coffee Roasters, pioneered single-serve capsule brewing in the United States with its Keurig brewing system, and remains one of the country’s leading large specialty roasters, offering a particularly wide-ranging variety of origins and roast styles. Visit www.GreenMountainCoffee.com or call 888-879-4627 for more information.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont.",
        "coffee origin": "Northern Sumatra, Indonesia.",
        "roast level": "Medium-Dark",
        "agtron": "37/45",
        "est. price": "$9.49/10 ounces",
        "review date": "February 2012",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "Kakalove Cafe",
        "title": "Golden Parrot Blend Espresso",
        "blind_assessment": "Deep-toned, richly chocolaty. Dark chocolate, raspberry coulis, tangerine zest, hazelnut, cedar in aroma and small cup. Creamy-smooth mouthfeel; crisp, chocolaty finish. In three parts milk, both chocolate and raspberry notes are amplified, supported by tangerine zest and cedar.",
        "notes": "Evaluated as espresso. A blend of coffees from Guatemala, Ethiopia and Colombia roasted for espresso applications. Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information",
        "bottom_line": "An inviting, richly chocolaty, deeply berry-driven espresso blend with exciting aromatics.",
        "roaster location": "Chia-Yi, Taiwan",
        "coffee origin": "Guatemala; Ethiopia; Colombia",
        "roast level": "Medium-Light",
        "agtron": "58/78",
        "est. price": "NT $210/8 ounces",
        "review date": "March 2023",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "91",
        "roaster": "Temple Coffee and Tea",
        "title": "Costa Rica Sonoran Estate Red Catuai",
        "blind_assessment": "Sweetly pungent, balanced. Baker’s chocolate, magnolia, almond, pomegranate, oak in aroma and cup. Crisp, gentle acidity; lightly velvety mouthfeel. The balance of the cup carries through to the sweet-toned finish, equal parts flower, fruit and nut.",
        "notes": "Produced exclusively from trees of the respected Red Catuai variety of Arabica by farmers Alberto and Diego Guardia of Sonora Estate in Costa Rica. This coffee was processed by the honey method, which means that the outer skin is removed as it is in the wet or “washed” process, but at least some of the sticky fruit residue is allowed to dry on the bean and later removed by machine along with the parchment skin. Temple Coffee is a quality-focused retail and wholesale specialty roaster active in Sacramento, California since 2005. Committed to sourcing, roasting and brewing the finest coffees, Temple features coffee from distinguished single estates and cooperatives around the world. Visit www.templecoffee.com or call 916-454-1282 for more information.",
        "bottom_line": "A delightfully balanced Costa Rica cup, classic in its expression of crisp, gentle acidity and ripe fruit and sweet floral notes.",
        "roaster location": "Sacramento, California",
        "coffee origin": "Central Valley, Costa Rica",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "$15.49/12 ounces",
        "review date": "April 2017",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "86",
        "roaster": "Barnie's Coffee & Tea",
        "title": "Guatemala Antigua, 1998",
        "blind_assessment": "A classic Latin-American cup, dominated by an austere, powerful, full-throated acidity. The big, acidy profile is both impressive and monolithic, complicated only by barely felt floral tones, a sort of deeply held essence of flowers.",
        "notes": "A classic Latin-American cup, dominated by a powerful acidity with deeply held essence of flowers. Bold, simple, arresting. Barnie's, a many-stored retailer founded in 1980, donates $1 of every pound of this coffee sold to Habitat for Humanity.",
        "bottom_line": null,
        "roaster location": "Orlando, Florida",
        "roast level": "Medium-Dark",
        "agtron": "41/45",
        "review date": "July 1999",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "7"
    },
    {
        "rating": "86",
        "roaster": "Santa Cruz Coffee Company",
        "title": "Beethoven’s Viennese Blend",
        "blind_assessment": "Medium-bodied but smooth, sweet, chocolaty, with a glint of dry acidity to animate the sweetness. The roast taste is backgrounded and unobtrusive, wrapped in the chocolate-toned sweetness.",
        "notes": "Medium-bodied but smooth, sweet, chocolaty, with a glint of dry acidity to animate the sweetness. A fine example of a smooth, discreetly dark-roasted coffee. A blend composed entirely of certified organically grown and Fair-Trade certified coffees. Santa Cruz Coffee Company was founded in 1978, making it the longest established roasting company on California 's central coast. It operates three retail locations",
        "bottom_line": null,
        "roaster location": "Watsonville, California",
        "roast level": "NA",
        "agtron": "/",
        "review date": "August 2001",
        "aroma": "6",
        "acidity": "6",
        "body": "7",
        "flavor": "8"
    },
    {
        "rating": "90",
        "roaster": "Allegro Coffee",
        "title": "Masai Blend",
        "blind_assessment": "A startlingly distinctive coffee: richly fruity with almost symphonic aromatics and pronounced but sweet acidity. \"Best blend in the world!\" exclaims the nominating reader. \"One of the few blends that has distinctive regional characteristics --  in this case a lighter roast highlights and protects a wonderfully lively flavor.\"",
        "notes": "A blend of coffees from East Africa. Allegro is one of the country's leading and most sophisticated sellers of premium single origin coffees, committed to giving equal value to intrinsic coffee character and to environmental and social issues in its coffee sourcing. Visit www.allegrocoffee.com or call 800-277-1107 for more info.",
        "bottom_line": null,
        "roaster location": "Thornton, Colorado",
        "coffee origin": "East Africa",
        "roast level": "Medium-Light",
        "agtron": "77/56",
        "review date": "December 2002",
        "aroma": "9",
        "acidity": "8",
        "body": "7",
        "flavor": "8"
    },
    {
        "rating": "94",
        "roaster": "Batdorf & Bronson",
        "title": "Sumatra Lake Tawar",
        "blind_assessment": "Intense aroma and flavor, dominated by one of the most distinctive notes in coffee, a kind of earthy, pungent citrus sensation that may suggest grapefruit to some, butterscotch to others, but essentially is a pleasure that belongs to this style of coffee alone. Complicated by flowering grass, nut, dark chocolate. Balanced, integrated acidity, silky mouthfeel, sweetly rich, resonantly flavor-saturated finish.",
        "notes": "A clean yet intense version of the traditional Sumatra wet-hulled coffee type with its richly fruity and earthy tendencies. Batdorf & Bronson is a premium wholesale specialty roaster with operations in Olympia, Washington and Atlanta, Georgia and a long and honorable commitment to quality and sound relationships with growers. Visit www.batdorfcoffee.com or call 800-955-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Olympia, Washington",
        "coffee origin": "Lake Tawar basin, Aceh Province, northern Sumatra, Indonesia",
        "roast level": "Medium",
        "agtron": "46/60",
        "est. price": "$14.50 / 16 oz.",
        "review date": "April 2010",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "78",
        "roaster": "Folgers",
        "title": "Simply Smooth",
        "blind_assessment": "Sweet, simple aroma dominated by walnut and neutral wood notes. In the cup lean in mouthfeel with some raisiny fruit in front, but the main sensation is salty wood - think licking driftwood. The salty/sweet theme continues in the finish, though the fruit hangs on, an agreeably soft banana-like sensation. It's difficult to assign a rating to such an oddly woody, lifeless beverage; but it does show sweetness and a little agreeable fruit, hence the 78 as opposed to, say, 60, or 50, or 0.",
        "notes": "A pre-ground supermarket brand launched in 2007, Simply Smooth describes itself as \"Gentle on Your Stomach.\" The process used to reduce acidity apparently happens during the roasting; perhaps simply involving a very slow roast, a common strategy used to reduce acidity. But other processes, like steaming to remove the acidy wax on the green bean, may be involved as well. Clearly contains some coffees of the robusta species. Folgers is a brand of Procter & Gamble. Visit www.folgers.com or call 800-937-9745 for more information.",
        "bottom_line": null,
        "roaster location": "Cincinnati, Ohio",
        "coffee origin": "Not disclosed.",
        "roast level": "Dark",
        "agtron": "0/81",
        "review date": "May 2007",
        "aroma": "6",
        "body": "7",
        "flavor": "5",
        "aftertaste": "7"
    },
    {
        "rating": "93",
        "roaster": "Pro Aroma Enterprise Coffee",
        "title": "Ethiopia Guji Queen Honey",
        "blind_assessment": "Richly sweet, fruit-forward. Dried peach, baker’s chocolate, jasmine, cedar, molasses in aroma and cup. Sweetly tart structure with bright, juicy acidity; crisp, satiny mouthfeel. Long, lingering finish that centers around dried peach and chocolate notes, supported by cedar-like wood.",
        "notes": "Southern Ethiopia coffees like this one are produced from traditional Ethiopian varieties of Arabica long grown in the region. It was processed by the honey method, which means that the outer skin is removed as it is in the wet or “washed” process, but at least some of the sticky fruit residue is allowed to dry on the bean and later removed by machine along with the parchment skin. Pro Aroma Enterprise Coffee Co., Ltd. is a Taiwan-based specialty coffee company. For more information, visit proaroma.weebly.com or email [email protected].",
        "bottom_line": "Deep, floral and cleanly fruit-toned, with prominent notes of dried stone fruit, spicy florals, and rich aromatic wood.",
        "roaster location": "Taichung City, Taiwan",
        "coffee origin": "Sidamo (also Sidama) growing region, south-central Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "$30.00/8 ounces",
        "review date": "July 2019",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "Theory Coffee Roasters",
        "title": "Ethiopia Keramo Village",
        "blind_assessment": "Chocolaty, sweetly tart. Concord grape, dark chocolate, cedar, lemon verbena, saltwater taffy in aroma and cup. Juicy-sweet structure with tart-leaning, balanced acidity; full, syrupy smooth mouthfeel. Chocolaty and fruit-toned finish.",
        "notes": "Produced by Assefa Dukamo from trees of the 74/158, 74/110 and Setami varieties of Arabica and processed by the anaerobic natural method (whole fruit is fermented with limited oxygen before drying). Theory Coffee Roasters is a specialty roaster and coffee shop based in Redding, California. Visit www.theorycoffee.com for more information.",
        "bottom_line": "An intensely fruit-forward, richly chocolaty anaerobic natural cup — juicy, bright, sweetly herbaceous.",
        "roaster location": "Redding, California",
        "coffee origin": "Sidamo growing region, south-central Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "60/77",
        "est. price": "$30.00/300 grams",
        "review date": "June 2021",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Stumptown Coffee Roasters",
        "title": "Panama Don Pachi Estate Geisha",
        "blind_assessment": "Exceptional aroma: floral notes complicated by vanilla for co-cupper Rodger Owen and lemon and pineapple for Ken. In the cup brightly but sweetly acidy and delicately smooth in mouthfeel with a subtly balanced flavor that disappointed Rodger but excited Ken with its jasmine-like floral notes and (for Ken at least) a rich, chocolaty lemon.",
        "notes": "Produced from trees of the Geisha variety of arabica, a variety with Ethiopian parentage that in the Boquete region of Panama appears to produce a lyrically soft, subtle version of the great floral and citrus wet-processed coffees of Ethiopia. Stumptown Coffee is a small-batch premium roasting company that wholesales its coffees as well as serves them in French press format in its three Portland cafes. Visit www.stumptowncoffee.com or call 503-230-7797 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Boquete growing district, western Panama",
        "roast level": "Medium",
        "agtron": "53/63",
        "est. price": "NA",
        "review date": "August 2005",
        "aroma": "8",
        "acidity": "9",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "83",
        "roaster": "Torreo Coffee",
        "title": "French Roast",
        "blind_assessment": "Not much nuance here, but a solid ultra-dark roast. John Weaver: \"Good clean flavor with mellow body and a nice finish\" (83). Ken: \"Balanced dark roast. Bittersweet, medium body, smooth mouthfeel, though a touch astringent in the finish\" (82).",
        "notes": "Torreo is a quality oriented, mainly wholesale specialty roaster serving the larger Philadelphia area. Visit www.torreo.com or call 888-2-TORREO for more info.",
        "bottom_line": null,
        "roaster location": "Philadelphia, Pennsylvania",
        "roast level": "Very Dark",
        "agtron": "30/31",
        "review date": "October 2002",
        "aroma": "7",
        "acidity": "na",
        "body": "7",
        "flavor": "7"
    },
    {
        "rating": "96",
        "roaster": "Simon Hsieh Aroma Roast Coffees",
        "title": "Ethiopia Aphrodite Washed Espresso",
        "blind_assessment": "Evaluated as espresso. Aromatic orchid, dark chocolate, black cherry, gently scorched sandalwood, tarragon in aroma and small cup. Creamy-smooth mouthfeel; resonant, complex, long finish. In three parts milk, floral and fruit tones harmonize with dark chocolate for a particularly complex cappuccino.",
        "notes": "This exceptional coffee was selected as the No. 3 coffee on Coffee Review’s list of the Top 30 Coffees of 2022. Produced by smallholding farmers from trees of the 74110 and 74112 varieties of Arabica, and processed by the washed method. In addition to his retail roasting operation, Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purpose-built commercial espresso blends and high-quality single-origin coffees. Customers can also visit the new showroom, Chateau Andy, in Taipei City. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": "A superb single-origin espresso. Floral- and spice-toned in the straight shot, fruit-toned in cappuccino-scaled milk, with tremendous depth and range throughout.",
        "roaster location": "Taoyuan, Taiwan",
        "coffee origin": "Yirgacheffe growing region, south-central Ethiopia",
        "roast level": "Medium",
        "agtron": "44/60",
        "est. price": "NT $850/8 ounces",
        "review date": "January 2022",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "10",
        "with milk": "9"
    },
    {
        "rating": "88",
        "roaster": "Green Mountain Coffee",
        "title": "Special Reserve Guatemala Chajulense Fair-Trade Organic",
        "blind_assessment": "A coffee distinguished more by a gently pungent, quiet richness than by any aromatic complexity. Restrained acidity, silky mouthfeel. Dark chocolate and nut hints carry from aroma through cup to the particularly sweet finish.",
        "notes": "This coffee is certified organically grown and Fair-Trade certified, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. A special purchase from the Chajulense cooperative of 1,600 indigenous farmers in Guatemala's Quiche Department, this is one of Green Mountain's \"Special Reserve\" series of select small lots of seasonally available coffees. Keurig/Green Mountain, formerly Green Mountain Coffee Roasters, pioneered single-serve capsule brewing in the United States with its Keurig brewing system, and remains one of the country’s leading large specialty roasters, offering a particularly wide-ranging variety of origins and roast styles. Visit www.GreenMountainCoffee.com or call 888-879-4627 for more information.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont",
        "coffee origin": "Quiche Department, Guatemala.",
        "roast level": "Medium-Dark",
        "agtron": "43/58",
        "review date": "September 2008",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "7",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "JBC Coffee Roasters",
        "title": "Palo de Rosa Pink Bourbon Colombia",
        "blind_assessment": "Juicy-tart, bright, vibrant. Pomegranate, neroli, cocoa nib, lemon verbena, sandalwood in aroma and cup. Sparkling acidity; elegantly silky mouthfeel. Flavor-saturated finish centered around notes of pomegranate and cocoa nib.",
        "notes": "Produced by 16 smallholding farmers in collaboration with Terra Coffee SASJBC, entirely of the Pink Bourbon variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying) and adding a second fermentation step (double-washed). Coffee Roasters’ vision is simple: “Let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A fun, lively, juicy-bright, richly aromatic, impeccably processed Colombia Pink Bourbon.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "La Argentina, Huila Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "61/79",
        "est. price": "$22.00/8 ounces",
        "review date": "June 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Oak & Bond Coffee Company",
        "title": "Colombia Buesaco",
        "blind_assessment": "High-toned, crisply sweet-tart. Tangerine zest, cocoa nib, apricot, cedar, freesia-like flowers in aroma and cup. Brightly sweet-tart structure with lively, juicy acidity; satiny-smooth mouthfeel. The resonant finish centered around notes of cocoa nib, tangerine zest and cedar.",
        "notes": "Produced from trees of the Caturra, Castillo and Colombia varieties of Arabica and processed by the wet, or washed, method. Oak & Bond is a specialty retail and wholesale coffee roaster based in Charlotte, North Carolina. The company’s name combines “oak,” a reference to its first coffee, a barrel-aged release, and “bond,” referring to the founders’ happy marriage. For more information, visit www.oakandbondcoffee.com.",
        "bottom_line": "A balanced, engaging, classic Colombia cup: bright, chocolaty, deeply sweet, richly vibrant.",
        "roaster location": "Charlotte, North Carolina",
        "coffee origin": "Nariño, Colombia",
        "roast level": "Medium-Light",
        "agtron": "60/76",
        "est. price": "$18.00/12 ounces",
        "review date": "July 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Coffee Emergency",
        "title": "Ethiopian Misty Valley",
        "blind_assessment": "Big, rich, sweet fruit-toned aroma: blueberries, Port wine and a hint of flowers. In the cup, a pleasant fermented version of berry and wine tones develop, as well as a fruity dark chocolate-like quality. Pleasingly smooth aftertaste, with a suggestion of citrus peel lingering in the long finish.",
        "notes": "A region of lush, rolling hills in south-central Ethiopia, Yirgacheffe is the most celebrated Ethiopian growing region. Most Yirgacheffe coffees are processed by the wet or washed method, meaning the fruit is removed from the beans or seeds before they are dried, which emphasizes the cleanly high-toned, intensely floral- and citrus-toned aspects of the Yirgacheffe cup. The Yirgacheffe reviewed here, however, is a \"natural\" or dry-processed version of the great Yirgacheffe profile, meaning the beans/seeds were dried inside the fruit, producing a flavor profile that is lower toned and richer with a giddy, wild, slightly fermented fruit. Like most Ethiopia coffees, this striking and unusual coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Coffee Emergency is a husband-and-wife-owned and operated small-batch roasting company and coffeehouse offering \"coffee prescriptions\" to their customers. Visit www.coffeeemergency.com or call 402-325-9154 for more information.",
        "bottom_line": null,
        "roaster location": "Lincoln, Nebraska",
        "coffee origin": "Yirgacheffe growing region, south-central Ethiopia.",
        "roast level": "Medium-Dark",
        "agtron": "38/49",
        "review date": "July 2008",
        "aroma": "9",
        "acidity": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Klatch Coffee",
        "title": "Sumatra Bodhi Peaberry Grade A Mandheling",
        "blind_assessment": "Aromatic hints of berry-like fruit mix with aromatic wood and a deep, molasses-like sweetness. Rich acidity, continuing sweetness and cedary wood in the cup, rounding toward a ripe peach. The flavor mutes but hangs on in the sweet finish.",
        "notes": "Consisting entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Mandheling is a term variously used to describe a growing region surrounding Lake Toba in North Sumatra Province and a traditional type of wet-hulled coffee like this one associated with that region. Formerly Coffee Klatch, Klatch Coffee is an award-winning small-batch roasting company based in the Los Angeles area whose resident barista and trainer, Heather Perry is a former United States Barista Championships. Visit www.klatchroasting.com or call 877-455-2824 for more information.",
        "bottom_line": null,
        "roaster location": "San Dimas, California",
        "coffee origin": "Aceh Province, northern Sumatra, Indonesia.",
        "roast level": "Medium-Light",
        "agtron": "53/80",
        "est. price": "$11.95 / 12 oz.",
        "review date": "April 2010",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "95",
        "roaster": "Buon Caffe",
        "title": "Ethiopia Yirgacheffe Adame G1 Washed 95",
        "blind_assessment": "Rich-toned, flavor-saturated. Black currant, magnolia, dark chocolate, candied walnut, hint of smoked paprika in aroma and cup. Sweet-savory structure with elegantly juicy acidity; syrupy-smooth mouthfeel. Richly chocolaty finish with undertones of black currant and candied walnut.",
        "notes": "Produced by Mulugeta Tsige, from local heirloom varieties of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying) at the Mulugeta Tsige Washing Station. Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.",
        "bottom_line": "Deeply aromatic, complex and rich, this G1-washed Yirgacheffe delivers in all categories with its balanced brightness, viscosity and interesting smoky spice note (unrelated to roast).",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Yirgacheffe growing region, south-central Ethiopia",
        "roast level": "Light",
        "agtron": "67/92",
        "est. price": "NT 319/8 ounces",
        "review date": "June 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "93",
        "roaster": "Buon Caffe",
        "title": "Ethiopia Sidamo Assefa 74158 SLD Natural",
        "blind_assessment": "Richly sweet, cocoa-toned. Dark chocolate, dried apricot, hazelnut, freesia-like flowers, maple syrup in aroma and cup. Balanced, sweet structure with high-toned acidity; satiny-smooth mouthfeel. The finish is crisply chocolaty with undertones of dried apricot and hazelnut.",
        "notes": "Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian landrace varieties of Arabica long grown in their respective regions. This is a dry-processed or “natural” version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.",
        "bottom_line": "A balanced, inviting natural-processed Ethiopia with leading notes of cocoa-toned fruit and spice-toned florals.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Sidamo growing region, south-central Ethiopia",
        "roast level": "Light",
        "agtron": "64/82",
        "est. price": "NT $369/8 ounces",
        "review date": "December 2022",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "Rusty's Hawaiian",
        "title": "Ka’u Classic Medium Roast",
        "blind_assessment": "Floral-toned, richly aromatic, chocolaty. Elegantly sweet structure with Meyer lemon-like acidity; full, viscous mouthfeel. Apricot, honey, lavender, baking chocolate, a hint of pipe tobacco in aroma and cup. The inviting finish leads with notes of baking chocolate and apricot, with pipe tobacco resurfacing in the long.",
        "notes": "This coffee tied for the third-highest rating in a cupping of coffees roasted by Black-owned coffee companies for Coffee Review’s August 2020 report. Ka’u is an emerging Hawai’i coffee-growing district centered approximately 30 miles southeast of the famous Kona region. This 100% Ka’u coffee was developed by Lorie Obra of Rusty’s, one of Ka’u’s best-known and most celebrated farms. Produced from trees of the traditional Typica variety and processed by the washed method. Visit www.rustyshawaiian.com or call 808-928-8916 for more information.",
        "bottom_line": "A classic Typica profile — nuanced, balanced and quietly complex — with notes of stone fruit, chocolate and an intriguing whisper of pipe tobacco.",
        "roaster location": "Pahala, Hawai'i",
        "coffee origin": "Ka'u growing district, \"Big Island\" of Hawai’i",
        "roast level": "Medium",
        "agtron": "53/68",
        "est. price": "$19.00/7 ounces",
        "review date": "August 2020",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "89",
        "roaster": "Green Mountain Coffee",
        "title": "Organic Peru Cajamarca (K-Cup)",
        "blind_assessment": "(As brewed in a Keurig 2.0 K500 Series single-serve brewing device at a 6-ounce serving size). Crisply sweet, caramelly. Malt, burnt caramel, almond, lily-like flowers, cherry in aroma and cup. Balanced, gently brisk acidity; lightly syrupy mouthfeel. The richly drying short finish consolidates around caramel and almond in the long.",
        "notes": "This coffee is certified organically grown and Fair Trade Certified, meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. Keurig/Green Mountain, formerly Green Mountain Coffee Roasters, pioneered single-serve capsule brewing in the United States with its Keurig brewing system, and offers a particularly wide-ranging variety of origins and roast styles for use in its sophisticated 2.0 brewing system. Visit www.greenmountaincoffee.com for more information.",
        "bottom_line": "A crisp yet deeply sweet, caramel-toned K-cup Peru with impressive environmental and socio-economic credentials.",
        "roaster location": "Waterbury, Vermont",
        "coffee origin": "Cajamarca growing region, Peru",
        "roast level": "Very Dark",
        "agtron": "0/46",
        "est. price": "$11.49/16 K-cups",
        "review date": "March 2016",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "92",
        "roaster": "Fratello Coffee Roasters",
        "title": "Ethiopian Konga Co-op Yirgacheffe",
        "blind_assessment": "Rich, brandy-like fruit with suggestions of honey, almond, dark chocolate, cherry and more in aroma and cup. Round, wine-like acidity; lightly syrupy mouthfeel. Brandy and chocolate in particular persist in a sweet finish.",
        "notes": "Most Yirgacheffe coffee is prepared by the conventional wet method, in which the skin and pulp are removed from the beans or seeds before they are dried, encouraging a cleanly high-toned, often intensely floral- and citrus-toned cup. This Yirgacheffe is a \"natural\" or dry-processed version, however, meaning the beans/seeds were dried inside the fruit, encouraging a more idiosyncratic profile more pungent than bright though still extravagant in its aromatics. Like virtually all Ethiopia coffees, this striking and unusual coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Calgary-based Fratello is a second-generation boutique coffee roaster owned by three brothers who focus on responsible trade relationships with coffee growers. Visit www.fratellocoffee.com or call 800-944-2545 for more information.",
        "bottom_line": null,
        "roaster location": "Calgary, Alberta, Canada",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia.",
        "roast level": "Medium-Light",
        "agtron": "62/76",
        "est. price": "$17.78/12 ounces",
        "review date": "September 2012",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "93",
        "roaster": "PT's Coffee Roasting Co.",
        "title": "Costa Rica Cafetín San Martin 2000m",
        "blind_assessment": "Richly and sweetly tart with quiet but original aromatics. Cane sugar, blood orange, rhododendron-like flowers, roasted Brazil nut in aroma and cup. Sweetly citrusy acidity; silky mouthfeel. Suggestions of fruit, flowers and nut all carry into a particularly sweet, cleanly balanced finish.",
        "notes": "Cafetín is a collective of twenty-five small farmers around the village of San Martin. This particular coffee is from the farm of Asdrúbal Gamboa Jiménez, who has one of the highest elevation farms in the cooperative at two-thousand meters. Only five bags of this coffee were produced at this harvest. Roasted at PT’s Coffee, where the motto is “without the love, it’s just coffee.” Visit www.ptscoffee.com or call 888-678-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Topeka, Kansas",
        "coffee origin": "Tarrazu growing region, Costa Rica.",
        "roast level": "Light",
        "agtron": "61/82",
        "est. price": "$18.72/12 ounces",
        "review date": "October 2014",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "92",
        "roaster": "Wonderstate Coffee",
        "title": "Congo Muungano",
        "blind_assessment": "Pungent, sweetly tart. Tangerine, agave syrup, roasted cacao nib, plum in aroma and cup. Impressively lush, sweetly bright acidity; plush mouthfeel. The tart tangerine carries into a deeply resonant, sweet-toned finish.",
        "notes": "The Democratic Republic of the Congo has very recently established itself as a source of specialty coffee with the founding of the Muungano Cooperative in an area overlooking Lake Kivu, on the opposite side of the lake from Rwanda. The rapidly growing cooperative now has 2,300 members, and apparently is succeeding its goal to help heal the wounds left by the latest in eastern Congo’s seemingly endless string of horrific rebellions and civil wars. Wonderstate Coffee, formerly Kickapoo Coffee, is an award-winning roaster based in rural Wisconsin known for their commitment to guaranteeing higher pay for farmers and being the country’s first 100% solar powered roastery. Visit https://wonderstate.com for more information.",
        "bottom_line": null,
        "roaster location": "Driftless, Wisconsin",
        "coffee origin": "Kalehe, Southern Kivu, Democratic Republic of the Congo.",
        "roast level": "Medium-Light",
        "agtron": "58/79",
        "est. price": "$15.75/12 ounces",
        "review date": "May 2014",
        "aroma": "8",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "79",
        "roaster": "Starbucks Coffee",
        "title": "Arabian Mocha Java",
        "blind_assessment": "A rather complex dark-roast cup. Clear carbon, but the roast was conducted with enough deliberation to preserve some richness and a touch of sweetness. The most engaging complication was in the dry center of the profile: a pruny, complex pungency that read as chocolate in the aroma. The carbon reasserted itself in the aftertaste.",
        "notes": "A rather complex dark-roast cup, with clear carbon but some richness and a touch of sweetness were preserved. The Center of the profile was dry, pruny, complex, and pungent. Another Yemen Mocha and estate Java.",
        "bottom_line": null,
        "roaster location": "Seattle, Washington",
        "roast level": "Dark",
        "agtron": "35/37",
        "review date": "January 1998",
        "aroma": "7",
        "acidity": "4",
        "body": "6",
        "flavor": "5"
    },
    {
        "rating": "92",
        "roaster": "Magnolia Coffee",
        "title": "Ethiopia Yirgacheffe Konga",
        "blind_assessment": "Crisp, quietly juicy. Orange, roasted cacao nib, caramel, wisteria-like flowers, a brisk hint of peppermint in aroma and cup. Gently bright, fruit-toned acidity; satiny mouthfeel. Flavor, particularly an orangy chocolate, saturates a richly drying finish.",
        "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces distinctively floral- and fruit-toned coffees from traditional varieties of Arabica long grown in the region. This is a “natural” or dry-processed Yirgacheffe, meaning the beans were dried inside the fruit, encouraging a flavor profile that is lower-toned and more pungent than the more familiar wet-processed Yirgacheffe floral- and citrus-toned profile. Magnolia Coffee is a Charlotte, North Carolina based boutique roaster whose motto is “Artisan roasted, truly delicious, socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs.Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.",
        "bottom_line": null,
        "roaster location": "Charlotte, North Carolina",
        "coffee origin": "Konga District, Yirgacheffe growing region, southern Ethiopia.",
        "roast level": "Medium-Light",
        "agtron": "60/78",
        "est. price": "$12.99/12 ounces",
        "review date": "January 2015",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "Crescent Moon Coffee & Tea",
        "title": "Honduras Marcala",
        "blind_assessment": "The sweet-toned aroma suggests butter, toast, raisiny fruit. In the cup, deep, roast-muted acidity, medium body, soft mouthfeel and straightforward flavors of molasses and nut-toned chocolate with a continued hint of dried fruit. A mild bittersweet chocolate character fades quickly in the finish.",
        "notes": "This coffee is certified organically grown and Fair Trade, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Crescent Moon is an artisan small-batch roaster in the Philadelphia area emphasizing sustainability and quality in its coffee sourcing. Visit www.cmcoffee.com or call 856-223-1237 for more information.",
        "bottom_line": null,
        "roaster location": "Mickleton, New Jersey",
        "coffee origin": "Marcala growing region, La Paz Department, Honduras.",
        "roast level": "Medium-Dark",
        "agtron": "42/53",
        "review date": "November 2009",
        "aroma": "8",
        "acidity": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "87",
        "roaster": "Green Mountain Coffee",
        "title": "Newman’s Own Organics Special Decaf (K-Cup)",
        "blind_assessment": "(As brewed in a Keurig B60 single-serve brewing device using a \"K-Cup\" capsule at a cup volume of 5.25 ounces): Mild but complex aroma: distinct caramel notes and hints of butter (perhaps butterscotch), vanilla and chocolate. Gentle, wine-toned acidity and sweet, delicate flavor with grapey red wine and floral notes and a hint of chocolate. Shallow but quietly persistent finish.",
        "notes": "Sales of this coffee help support a variety of educational and charitable organizations through the Newman's Own Organics organization. It is certified organically grown and Fair Trade, the latter meaning the green beans were purchased from small-holding farmers at a \"fair\" or economically sustainable price. Keurig brewing devices were among the first single-serve brewers on the market, starting in the mid 1990's with office models and now with three home models. Green Mountain Coffee Roasters is one of the country's leading specialty roasters, offering a particularly wide-ranging variety of origins and roast styles, including an impressive selection of Fair-Trade and certified organic coffees under various labels, among them Newman's Own Organics. Visit www.greenmountaincoffee.com or call 888-879-4627 for more information.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont",
        "coffee origin": "Blend",
        "roast level": "Very Dark",
        "agtron": "0/48",
        "review date": "March 2006",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "8"
    },
    {
        "rating": "90",
        "roaster": "Java D'oro Gourmet Coffee",
        "title": "Espresso Supremo",
        "blind_assessment": "Evaluated as espresso. Crisp, chocolaty, sweetly nut-toned. Baking chocolate, hazelnut, rhododendron, date, gently scorched oak in aroma and cup. Full velvety mouthfeel. Smoky, nut-toned finish with chocolate undertones. Baking chocolate, hazelnut and scorched oak carry pleasingly into three parts milk.",
        "notes": "Java D’oro Gourmet Coffee is a family-owned specialty coffee roaster in Cape Coral, Florida founded by the Latassa family in 1998. Visit www.javadoro.com for more information.",
        "bottom_line": "A balanced espresso blend designed as a classic Italian espresso: chocolaty, richly nut-toned, accessible.",
        "roaster location": "Cape Coral, Florida",
        "coffee origin": "Not disclosed",
        "roast level": "Medium-Dark",
        "agtron": "42/54",
        "est. price": "$12.95/16 ounces",
        "review date": "March 2020",
        "aroma": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8",
        "with milk": "8"
    },
    {
        "rating": "84",
        "roaster": "Yuban",
        "title": "100% Colombian",
        "blind_assessment": "Sweet, balanced, restrained. The fruit and vegetal cocoa notes are faint but pleasant, the roasty tones understated.",
        "notes": "Sold roasted and ground in a 12-ounce can; 33 cents per ounce. Visit www.yuban.com or call 1-800-982-2649 for more info.",
        "bottom_line": null,
        "roaster location": "Rye Brook, New York",
        "roast level": "Very Dark",
        "agtron": "0/46",
        "review date": "March 2002",
        "aroma": "5",
        "acidity": "5",
        "body": "7",
        "flavor": "7"
    },
    {
        "rating": "93",
        "roaster": "St1 Cafe/Work Room",
        "title": "Bean Series Ethiopia Guji Raro",
        "blind_assessment": "Suavely bright, quietly lively, balanced. Tangerine, hazelnut, cedar, cashew, floral vanilla in aroma and cup. Sweetly tart in structure; roundly bright acidity. Plush, buoyant mouthfeel. Impressive finish: deep, layered, vanilla with cedar and tangerine back notes.",
        "notes": "Produced by smallholding farmers from the Kurume and Welicho selections of Ethiopia landrace varieties of Arabica, and processed at the Raro Boda washing station by the traditional washed method (fruit skin and flesh are removed from the beans before they are dried). St1 Cafe and Work Room is based in Tainan City, Taiwan, offering customers top-quality coffee in a cafe environment conducive to remote work. Visit www.st1cafe.com for more information.",
        "bottom_line": "Complex vanilla and floral suggestions emerge in a softly lively structure.",
        "roaster location": "Tainan City, Taiwan",
        "coffee origin": "Guji Zone, Oromia Region, Ethiopia",
        "roast level": "Light",
        "agtron": "63/80",
        "est. price": "NT $500/200 grams",
        "review date": "August 2022",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9"
    },
    {
        "rating": "94",
        "roaster": "A.R.C.",
        "title": "Flora Blend Espresso",
        "blind_assessment": "Evaluated as espresso. Sweetly tart, floral-toned. Honeysuckle, oak, dried apricot, dark chocolate, thyme in aroma and small cup. Delicately syrupy body; gently drying, floral-driven finish in the short and sweetly herb-toned in the long. In three parts milk, chocolate, florals and fruit all take center stage, and thyme-like herb notes gently follow.",
        "notes": "An espresso blend comprised of coffees from Africa and the Asia-Pacific. A.R.C., whose motto is “more than specialty,” rigorously controls three vital elements: sourcing of green coffee, roasting, and, in cafe environments, water quality for brewed coffee. For more information, visit http://www.arc.coffee/en/index.html.",
        "bottom_line": "A floral-driven straight shot, amplified with notes of stone fruit and chocolate in cappuccino-scaled milk.",
        "roaster location": "Hong Kong, China",
        "coffee origin": "Africa; Asia Pacific",
        "roast level": "Medium-Light",
        "agtron": "54/77",
        "est. price": "HKD $158/227 grams",
        "review date": "November 2017",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "92",
        "roaster": "Kakalove Cafe",
        "title": "Ethiopia Washed Yirgacheffe Z G1",
        "blind_assessment": "Delicate; lightly pungent. Fir, lemon blossom, maple syrup, gingko fruit in aroma and cup. Vibrant, juicy acidity; velvety, buoyant mouthfeel. Crisp, long finish with notes of gingko throughout.",
        "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe coffees like this one processed by the wet or washed method (fruit skin and pulp are removed before drying) typically express great aromatic complexity and intensity with a particular emphasis on floral notes. Like virtually all Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. G1 (Grade 1) is the highest grade of Ethiopia coffee; “Z” means zero defects, a coffee without physical imperfections. Kakalove Café is a nano-roaster located the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.",
        "bottom_line": null,
        "roaster location": "Chia-Yi, Taiwan",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "63/87",
        "est. price": "$14.50/16 ounces",
        "review date": "November 2015",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "91",
        "roaster": "Hub Coffee Roasters",
        "title": "Colombia Finca Las Nubes",
        "blind_assessment": "Richly sweet-savory. Tamarind, candycap mushroom, fresh-cut fir, grapefruit zest, freesia in aroma and cup. Bittersweet structure with brisk acidity; crisp, satiny mouthfeel. Gently drying finish centered around notes of tamarind and fresh-cut fir.",
        "notes": "Produced by Claudia Samboni, entirely of the Caturra variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Hub Coffee Roasters is a specialty roaster focused on single-origin coffees, with several cafes in the Reno area. Visit www.hubcoffeeroasters.com for more information.",
        "bottom_line": "A savory-leaning Colombia cup with undertones of spicy florals and tangy tropical fruit.",
        "roaster location": "Reno, Nevada",
        "coffee origin": "Huila, Colombia",
        "roast level": "Medium-Light",
        "agtron": "60/79",
        "est. price": "$19.00/300 grams",
        "review date": "April 2023",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "7"
    },
    {
        "rating": "93",
        "roaster": "Once N Cafe Etude",
        "title": "Meriah Aceh King Batak",
        "blind_assessment": "Pungent but delicately sweet. Molasses, hazelnut, fresh-cut redwood, sweet tobacco, magnolia-like flowers in aroma and cup. Juicy-tart acidity; smoothly silky mouthfeel. Finishes with hazelnut and sweet, molasses-inflected tobacco notes.",
        "notes": "Processed by the honey (also called pulped natural) method, in which the fruit skin is removed as it is in the wet or “washed” process, but some of the sticky fruit residue is allowed to dry on the bean and later removed by machine along with the parchment skin. This coffee tied for the second-highest rating in a cupping of Sumatra coffees for Coffee Review‘s July 2016 tasting report. Once N Cafe Etude is a roaster and Internet retailer in Taiwan. For more information, visit https://www.facebook.com/OnceNCafeEtude or email [email protected].",
        "bottom_line": "Quiet oppositions: A sweet floral character pleasantly overlays a ground of tobacco and nut.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Gayo (also Aceh) growing region, Aceh Province, northern Sumatra, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "NT $400/200 grams",
        "review date": "July 2016",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "87",
        "roaster": "Lavazza",
        "title": "GranCrema (ESE pod)",
        "blind_assessment": "Produced from an ESE pod on a FrancisFrancis! pod brewer. The low-acid wood and nut character of robusta dominates. Surprisingly lean mouthfeel, but the woody nut notes hint nicely at chocolate in the small cup and turn sweetly rich in the finish. Blooms nicely in milk with a gently fat dark chocolate character.",
        "notes": "ESE (Easy Serving Espresso) pods are wafer-like single-serving sized portions of ground espresso coffee compressed and enclosed in filter paper. Any coffee company that has access to the proper machinery can produce them. Although \"pod adaptors\" are available for many home espresso machines, ESE pods seem to produce best results when used on home machines exclusively designed for them. We tested this set of sample pods on the pod-only FrancisFrancis! X6 Trio home espresso machine, which allows for some control of extraction rate by how firmly the pod-bearing portafilter is tightened into the machine. We evaluated this espresso at a 26-second extraction for a one-ounce serving, probably a bit too short an extraction for this blend, but the best we could do with the available set of sample pods and the FrancisFrancis! machine. At this writing about 50 to 55 cents per pod purchased online. Italy-based Lavazza is one of the world?s largest coffee roasting companies, with a great variety of espresso blends, though few are available in the United States. Visit www.lavazza.com for more information.",
        "bottom_line": null,
        "roaster location": "Turin, Italy",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium-Dark",
        "agtron": "0/84",
        "review date": "January 2009",
        "aroma": "7",
        "body": "7",
        "flavor": "7",
        "aftertaste": "8",
        "with milk": "8"
    },
    {
        "rating": "90",
        "roaster": "Atomic Cafe Coffee Roasters",
        "title": "Ethiopia Yirgacheffe",
        "blind_assessment": "Honey-like sweetness in the aroma with notes of flowers, wine and aromatic wood. Balanced, floral toned acidity, medium body with smoothness in mouthfeel. The floral qualities carry into the flavor with hints of savory herbs, berry and citrus that fade to milk chocolate. Chocolate turns fruity and bittersweet in the finish, along with a touch of astringency.",
        "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces intensely floral- and fruit-toned coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe coffees like this one processed by the wet or washed method (fruit skin and pulp is removed before drying) express floral and citrus notes with particular intensity. Atomic Cafe is a coffee house on the North Shore of Massachusetts that began its refined in-house roasting program in 2005. Visit www.atomicafe.com or call 978-922-0042 for more information.",
        "bottom_line": null,
        "roaster location": "Beverly, Massachusetts",
        "coffee origin": "Yirgacheffe growing region, Sidamo Province, southern Ethiopia.",
        "roast level": "Medium-Light",
        "agtron": "52/71",
        "review date": "February 2009",
        "aroma": "8",
        "acidity": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Paradise Roasters",
        "title": "Romance by Paradise",
        "blind_assessment": "Rich, round, deep. Baker’s chocolate, fresh-cut cedar, pungent grapefruit, hints of narcissus-like flowers in aroma and cup. Brisk but juicy acidity; delicately lively, satiny mouthfeel. The baker’s chocolate note animates a dry finish.",
        "notes": "A blend based on the traditional Mocha-Java formula, combining a particularly distinguished traditionally processed Sumatra – Ulos Batak – in place of the original Java, and a “natural” or dried-in-the-fruit coffee from southern Ethiopia (Sidamo Ardi) that presents an arguably cleaner, more refined alternative to the Yemen Mocha component of the original formula. Paradise Roasters specializes in micro-lot coffees and espressos from Hawaii and other premier coffee growing regions. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": null,
        "roaster location": "Ramsey, Minnesota",
        "coffee origin": "Southwestern Ethiopia; northern Sumatra, Indonesia.",
        "roast level": "Medium",
        "agtron": "48/59",
        "est. price": "$13.95/12 ounces",
        "review date": "July 2015",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "94",
        "roaster": "JBC Coffee Roasters",
        "title": "Kivu DR Congo",
        "blind_assessment": "High-toned, balanced, crisply sweet. Apricot, tangerine zest, dark chocolate, honey, rhododendron in aroma and cup. Sweet-tart structure with juicy, bright acidity; buoyant, syrupy mouthfeel. The rich finish is centered around notes of dark chocolate and tangerine zest, with vanilla-toned florals.",
        "notes": "Produced entirely from trees of Bourbon-related varieties of Arabica by members of the SOPACDI coop. Located overlooking Lake Kivu, on the opposite side of the lake from Rwanda, this rapidly growing cooperative now has nearly 6,000 members and apparently is succeeding in its goal to help heal wounds left by the latest in eastern Congo’s seemingly endless string of horrific rebellions and civil wars. A wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. This coffee is certified organically grown and certified fair trade, meaning it was purchased at no less than a minimum price determined by the certifying agency to be economically sustainable for the farmers. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A richly sweet, elegantly composed Bourbon cup from the Democratic Republic of the Congo; multi-layered and deeply engaging.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Kalehe, South Kivu Province, Democratic Republic of the Congo",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "$16.90/12 ounces",
        "review date": "January 2019",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Regular Coffee",
        "title": "Regular Coffee",
        "blind_assessment": "Soft, crisp, quietly complete. Caramel, hazelnut, raspberry-like fruit, fresh-cut fir in aroma and cup. Gentle but lively acidity; lightly though distinctly syrupy mouthfeel. Raspberry in particular carries into a quietly flavor-saturated finish.",
        "notes": "Regular Coffee is a specialty coffee company based in Grand Rapids, Michigan that specializes in bringing consumers a good cup of coffee at a good price without fuss, hyperbole or fancy packaging. The tall 24-ounce can wrapped in a kraft paper label with plain black lettering drives the point home. Regular sells its coffees on a no-commitment subscription basis. The purchase price includes shipping.",
        "bottom_line": null,
        "roaster location": "Grand Rapids, Michigan",
        "coffee origin": "Inza Municipality, Cauca Province, southwestern Colombia.",
        "roast level": "Medium",
        "agtron": "54/63",
        "est. price": "$30.00/24 ounces",
        "review date": "June 2014",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "90",
        "roaster": "Ithaca Coffee Company",
        "title": "Costa Rica La Cereza Roja Semi-Washed",
        "blind_assessment": "Deeply sweet, fruit-toned. Ripe strawberry, cashew, fine musk, cocoa powder, fir in aroma and cup. Gentle, fruit-forward acidity; satiny mouthfeel. The gently drying finish is characterized by aromatic wood notes, sweetly fermenty berry tones, and suggestions of cocoa powder.",
        "notes": "Produced from trees of the Caturra and Catuai varieties of Arabica. Processed by the honey method (sometimes referred to as “semi-washed”), which means that the outer skin of the coffee fruit is removed as it is in the wet or “washed” process, but at least some of the sticky fruit residue is allowed to dry on the bean and later removed by machine along with the parchment skin. Founded in 2004, Ithaca Coffee Company now has two retail locations, a roastery and a bakery. The company prides itself in offering gourmet foods and gifts, as well as small-batch-roasted coffees. For more information, visit www.ithacacoffee.com.",
        "bottom_line": "A discreetly fruit-toned, honey-processed coffee with aromatic wood notes as ballast.",
        "roaster location": "Ithaca, New York",
        "coffee origin": "Tarrazu growing region, Costa Rica",
        "roast level": "Medium-Light",
        "agtron": "55/75",
        "est. price": "$14.99/12 ounces",
        "review date": "August 2017",
        "aroma": "8",
        "acidity/structure": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "88",
        "roaster": "The Roasterie",
        "title": "Papua New Guinea Kimel Estate",
        "blind_assessment": "Sweet, round aroma with soft notes of nut, milk chocolate and a suggestion of fruit. In the cup full body, smooth mouthfeel, soft acidity, with aromatic notes turning deeper and more intense: dark chocolate, aromatic wood, nut. The dark chocolate turns very slightly bitterish in the long, dry finish.",
        "notes": "Kimel Estate is a large farm founded by Australian expatriates but now owned and operated by local tribal groups who claim traditional ownership of the land. It is located in the Wahgi Valley, near the town of Mount Hagen. The Roasterie is a leading, quality-oriented specialty roaster that emphasizes its commitment to \"air roasting,\" a technology utilizing a column of hot air rather than the conventional turning drum to agitate the roasting beans. Visit www.theroasterie.com or call 800-376-0245 for more information.",
        "bottom_line": null,
        "roaster location": "Kansas City, Missouri",
        "coffee origin": "Waghi Valley, Western Highlands, Papua New Guinea",
        "roast level": "Medium",
        "agtron": "47/61",
        "est. price": "$10.50/12 oz.",
        "review date": "May 2010",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7"
    },
    {
        "rating": "93",
        "roaster": "Roadmap CoffeeWorks",
        "title": "El Salvador El Mirador",
        "blind_assessment": "Rich-toned, deeply sweet. Salted caramel, pomegranate, almond butter, narcissus, pink grapefruit zest in aroma and cup. Sweetly savory structure with citrusy acidity; plush, syrupy mouthfeel. Crisp, focused finish centered around notes of salted caramel and almond.",
        "notes": "Produced by Jancarlo and Sofia Handtke of Mapache Estate entirely of the big-beaned Pacamara variety of Arabica, and processed by the natural method (dried in the whole fruit). Founded in 1990, Roadmap CoffeeWorks, formerly Lexington Coffee Roasters, is an award-winning artisan roasting company based in Lexington, Virginia. Roadmap CoffeeWorks focuses on producing fresh, distinctive and sustainable coffees. Visit www.roadmapcoffeeworks.com or call 800-322-6505 for more information.",
        "bottom_line": "An inviting El Salvador Pacamara cup with tart fruit and caramel notes throughout, and an especially viscous mouthfeel.",
        "roaster location": "Lexington, Virginia",
        "coffee origin": "Apaneca-Ilamatepec growing region, El Salvador",
        "roast level": "Medium-Light",
        "agtron": "60/77",
        "est. price": "$20.95/12 ounces",
        "review date": "February 2023",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8"
    },
    {
        "rating": "81",
        "roaster": "Allegro Coffee Roasters",
        "title": "Guatemalan Santiago Atitlan",
        "blind_assessment": "The aroma was curiously flat, the body ordinary, but the acidity splendid: powerful without shrillness, complex, alive with muted wine tones. Smoky hints in the cup turned slightly hard and tobacco-like in the finish, but softened again in the rich aftertaste. .",
        "notes": "A lot going on in this coffee, smoky tones and powerful acidity with muted wine tones. The aroma is flat, the body ordinary, but aftertaste is rich . Produced by the Tzutuhil Mayans of the town of Santiago Atitlan. Shade-grown; certified organically grown.",
        "bottom_line": null,
        "roaster location": "Boulder, Colorado",
        "roast level": "Medium",
        "agtron": "55/60",
        "review date": "November 1997",
        "aroma": "4",
        "acidity": "8",
        "body": "6",
        "flavor": "7"
    },
    {
        "rating": "94",
        "roaster": "Simon Hsieh's Aroma Roast Coffees",
        "title": "Ecuador “Mama Kilya” Espresso",
        "blind_assessment": "Evaluated as espresso. Profoundly floral-toned, delicately bright. Complex flowers (lilac, lily, honeysuckle), tangerine-like citrus, cedar, nut-toned chocolate in aroma and small cup. Lightish but velvety mouthfeel; chocolate and cedar in particular carry into a clean finish. In three parts milk delicate but authoritative: very sweet citrus, chocolate, flowers.",
        "notes": "In addition to his retail roasting operation, Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purposed-built commercial espresso blends and high quality single-origin coffees. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": null,
        "roaster location": "Taoyuan City, Taiwan",
        "coffee origin": "Ecuador.",
        "roast level": "Medium-Dark",
        "agtron": "44/50",
        "est. price": "NT $2,000/16 ounces",
        "review date": "September 2015",
        "aroma": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9"
    },
    {
        "rating": "89",
        "roaster": "JBC Coffee Roasters",
        "title": "Guatemala Huehuetenango Fair Trade Organic",
        "blind_assessment": "Deep, sweet-toned aroma with cedar and muted hints of flowers, orange and semi-sweet chocolate. In the cup softly acidy, rather full-bodied, with continued hints of flowers and orange- and peach-toned fruit. Rich finish.",
        "notes": "Certified organically grown and Fair Trade certified, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. JBC Coffee Roasters (formerly Johnson Brothers Coffee Roasters) is a distinguished small-batch roasting company. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Huehuetenango growing region, Guatemala.",
        "roast level": "Medium-Light",
        "agtron": "54/73",
        "review date": "September 2007",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8"
    },
    {
        "rating": "92",
        "roaster": "Coffee Masters",
        "title": "Colombian Los Idolos",
        "blind_assessment": "A contradictory but balanced profile: The sweetly winy acidity is rounded by a cedar-toned roastiness, with raisin, apple, semi-sweet chocolate and caramel complications. Raisin is particularly prominent in the deep, gently roasty aroma, chocolate in the finish.",
        "notes": "Los Idolos, named for the pre-Colombian stone carvings in the San Agustin region where this coffee originates, is produced with the support of ACDI/VOCA, a USAID-funded program aimed at promoting the production of high-end specialty coffees by small-holding farmers who might otherwise be forced to resort of growing coca. Coffee Masters is a leading, quality-oriented wholesale roaster founded in 1985. Visit www.coffeemasters.com or call 800-334-6485 for more information.",
        "bottom_line": null,
        "roaster location": "Spring Grove, Illinois",
        "coffee origin": "San Agustin growing region, Huila Department, southern Colombia",
        "roast level": "Medium",
        "agtron": "46/61",
        "review date": "February 2006",
        "aroma": "8",
        "acidity": "8",
        "body": "7",
        "flavor": "9",
        "aftertaste": "8"
    }
]