[
    {
        "rating": "93",
        "roaster": "U&Me Buna",
        "title": "Ethiopia Washed Guji Uraga Tome Variety 74110",
        "blind_assessment": "Balanced, sweetly tart. Cocoa nib, apricot, narcissus, almond, brown sugar in aroma and cup. Gentle, round acidity; crisp, syrupy mouthfeel. Finish centers around notes of cocoa nib and apricot.",
        "notes": "Produced by smallholding farmers, entirely of the 74110 variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). U&Me Buna’s mission is to bring Ethiopian coffee culture to coffee enthusiasts worldwide. Visit www.umebuna.de for more information.",
        "bottom_line": "A balanced, sweet-toned washed Ethiopia characterized by bright apricot and cocoa nib notes, alongside spicy-sweet florals.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Guji Zone, Oromia Region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "64/80",
        "est. price": "NT $600/227 grams",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-washed-guji-uraga-tome-variety-74110/"
    },
    {
        "rating": "94",
        "roaster": "Utopian Coffee",
        "title": "Guatemala Bella Carmona",
        "blind_assessment": "Complex, deep-toned, flavor-saturated. Satsuma, almond butter, narcissus, marjoram, agave syrup in aroma and cup. Bright, balanced acidity; crisp, syrupy mouthfeel. Finish consolidates to notes of satsuma and almond butter.",
        "notes": "Produced by Luis Pedro Zelaya Zamora, from trees of the Bourbon, Red Caturra, Yellow Caturra and Catimor Hybrid varieties of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Utopian Coffee is a specialty roaster based in Fort Wayne, Indiana. Visit www.utopiancoffee.com for more information.",
        "bottom_line": "A rich, deeply sweet washed Guatemala whose profile centers around citrus, almond and spice-toned florals, supported by sweet heb notes.",
        "roaster location": "Fort Wayne, Indiana",
        "coffee origin": "Antigua valley, Sacatepequez Department, Guatemala",
        "roast level": "Medium-Light",
        "agtron": "57/79",
        "est. price": "$20.00/12 ounces",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/guatemala-bella-carmona-5/"
    },
    {
        "rating": "93",
        "roaster": "Side by Each Brewing Co.",
        "title": "Burundi Kayanza Cima Yeast Natural",
        "blind_assessment": "Melony-sweet, deep-toned. Cantaloupe, amber, narcissus, bay leaf, cinnamon in aroma and cup. Gentle, balanced acidity; very full, syrupy mouthfeel. The sweet finish leads with notes of cantaloupe and amber.",
        "notes": "Produced by smallholding farmers, entirely of the Bourbon variety of Arabica, and processed at the Kayanza Washing Station by fermenting the whole cherries with yeast and then drying them in the whole fruit. Side By Each Brewing Co. is a specialty roaster, craft brewery, kitchen, and community gathering space all under one roof in sunny Auburn, Maine. Visit www.sidebyeachbrewing.com for more information.",
        "bottom_line": "A richly sweet yeast-inoculated Burundi natural with distinct cantaloupe notes supported by amber-like resin and spice-toned florals.",
        "roaster location": "Auburn, Maine",
        "coffee origin": "Kayanza, Burundi",
        "roast level": "Medium-Light",
        "agtron": "57/80",
        "est. price": "$19.00/16 ounces",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/burundi-kayanza-cima-yeast-natural/"
    },
    {
        "rating": "93",
        "roaster": "1980 CAFE",
        "title": "Ethiopia Guji Floral Blueberry Natural G1",
        "blind_assessment": "Crisply sweet, rich-toned. Dried blueberry, baking chocolate, gardenia, grapefruit zest, hazelnut in aroma and cup. Round, fruity acidity; full, creamy mouthfeel. Hazelnut and grapefruit zest predominate in the finish.",
        "notes": "Produced by smallholding farmers, from local heirloom varieties of Arabica, and processed by the natural method (dried in the whole fruit). 1980 Cafe is a Tainan City, Taiwan-based specialty coffee roaster. Visit www.1980cafetw.com for more information.",
        "bottom_line": "A berry-toned, crisply chocolaty Ethiopia natural complicated by spice-toned florals.",
        "roaster location": "Tainan City, Taiwan",
        "coffee origin": "Guji Zone, Oromia Region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "61/85",
        "est. price": "NT $500/227 grams",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-guji-floral-blueberry-natural-g1/"
    },
    {
        "rating": "94",
        "roaster": "U&Me Buna",
        "title": "Ethiopia Washed Sidama Bensa Single Variety 74158",
        "blind_assessment": "Floral-toned, very fruity. Guava, lilac, pralines, cane sugar, calamansi in aroma and cup. Sweet-tart structure with sparkling acidity; full, syrupy-smooth mouthfeel. The rich-toned finish leads with notes of lilac and guava, supported by richly bitter-tart calamansi.",
        "notes": "Produced by smallholding farmers, entirely of the 74158 variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). U&Me Buna’s mission is to bring Ethiopian coffee culture to coffee enthusiasts worldwide. Visit www.umebuna.de for more information.",
        "bottom_line": "A vibrant, flavor-saturated, richly aromatic washed single-variety Ethiopia, headily inviting and complex.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Guji Zone, Oromia Region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "62/82",
        "est. price": "NT $600/227 grams",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-washed-sidama-bensa-single-variety-74158/"
    },
    {
        "rating": "93",
        "roaster": "Raccoon Coffee Roaster",
        "title": "Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Sweetly nut-toned, delicately early. Roasted almond, date, baking chocolate, tamarind, fresh humus in aroma and small cup. Creamy-smooth mouthfeel; crisply sweet, almondy finish. In three parts milk, date and tamarind notes take center stage, supported by baking chocolate.",
        "notes": "Founded by a barista with a Ph.D. in Design, Raccoon Coffee is a specialty roaster whose green coffee selections come from “a rich tapestry of memory.” Visit www.raccoonroaster.com for more information.",
        "bottom_line": "In the straight shot, this espresso blend leans on sweet nut aromas and flavors, while in cappuccino format, it’s more chocolaty and fruit-driven.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Kenya; Brazil; Mexico; Indonesia",
        "roast level": "Medium-Light",
        "agtron": "57/72",
        "est. price": "NT $450/225 grams",
        "review date": "July 2024",
        "aroma": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "with milk": "9",
        "url": "https://www.coffeereview.com/review/espresso-blend-29/"
    },
    {
        "rating": "93",
        "roaster": "1980 CAFE",
        "title": "Ethiopia Sidama Berry Gummies 74158 Natural G1",
        "blind_assessment": "High-toned, sweetly tart. Watermelon candy, salted caramel, lemon balm, cedar, amber in aroma and cup. Balanced, juicy acidity; full, satiny mouthfeel. Gently drying finish centers around notes of salted caramel and lemon balm.",
        "notes": "Produced by smallholding farmers, entirely of the 74158 variety of Arabica, and processed by the natural method (dried in the whole fruit). 1980 Cafe is a Tainan City, Taiwan-based specialty coffee roaster. Visit www.1980cafetw.com for more information.",
        "bottom_line": "This natural-processed, single-variety Ethiopia has a candy-like profile with both sweet and tart impulses.",
        "roaster location": "Tainan City, Taiwan",
        "coffee origin": "Sidamo growing region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "58/81",
        "est. price": "NT $520/227 grams",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/ethiopia-sidama-berry-gummies-74158-natural-g1/"
    },
    {
        "rating": "95",
        "roaster": "JBC Coffee Roasters",
        "title": "Wilton Benitez Sidra",
        "blind_assessment": "Richly fruit-forward, floral-toned. Watermelon candy, violet, orange soda, banana saltwater taffy, lemon verbena in aroma and cup. Juicy, sparkling acidity; plush, syrupy mouthfeel. Fruity, rich-toned finish, long and lingering.",
        "notes": "Produced by Wilton Benitez of Granja Paraiso 92, entirely of the Sidra variety of Arabica, and processed by the double-anaerobic thermal shock method, in which the coffee fruit, after having been first sanitized with ozone, undergoes two stages of fermentation. First, the whole cherries are submerged under water for 48 hours, then the beans are pulped and fermented with a strain of Lactobacillus for 24 hours. JBC Coffee Roasters’ vision is simple: “Let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A candy-like, viscous, brightly juicy Colombia Sidra, confident and flavor-saturated.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Piendamó, Cauca Department, Colombia",
        "roast level": "Light",
        "agtron": "57/89",
        "est. price": "$26.00/8 ounces",
        "review date": "June 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/wilton-benitez-sidra-2/"
    },
    {
        "rating": "94",
        "roaster": "JBC Coffee Roasters",
        "title": "Putra Gayo Sumatra",
        "blind_assessment": "Sweetly herbaceous, deeply rich. Dark chocolate, pomegranate, lemongrass, cedar, magnolia in aroma and cup. Balanced, even-keeled acidity; very full, satiny-smooth mouthfeel. Chocolaty finish supported by pomegranate undertones.",
        "notes": "Produced by smallholding farmers, from trees of the Ateng, Bor Bor, Catimor and Timor varieties of Arabica, and processed at Iwannitosa Putra’s Putra Gayo wet mill by the washed method (fruit skin and pulp removed before drying). JBC Coffee Roasters’ vision is simple: “Let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "Tart fruit, rich chocolate, and sweet herb notes characterize this washed Sumatra.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Aceh Province, Sumatra, Indonesia",
        "roast level": "Light",
        "agtron": "60/88",
        "est. price": "$23.00/12 ounces",
        "review date": "June 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/putra-gayo-sumatra-2/"
    },
    {
        "rating": "94",
        "roaster": "1980 CAFE",
        "title": "Ethiopia Sidama Orange Blossom Washed G1",
        "blind_assessment": "Complex, sweetly citrusy. Bergamot, bay leaf, cocoa nib, violet, pink grapefruit in aroma and cup. Sparkling acidity; silky, viscous mouthfeel. Resonant, citrusy finish with notes of bergamot and pink grapefruit supported by cocoa nib.",
        "notes": "Produced by smallholding farmers, entirely of the 74158 variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). 1980 Cafe is a Tainan City, Taiwan-based specialty coffee roaster. Visit www.1980cafetw.com for more information.",
        "bottom_line": "A deep, delicate, confident washed Ethiopia, resonantly and elegant citrusy.",
        "roaster location": "Tainan City, Taiwan",
        "coffee origin": "Sidamo growing region, southern Ethiopia",
        "roast level": "Light",
        "agtron": "64/82",
        "est. price": "NT $500/227 grams",
        "review date": "July 2024",
        "aroma": "9",
        "acidity/structure": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-sidama-orange-blossom-washed-g1/"
    }
]