[
    {
        "rating": "91",
        "roaster": "Caribou Coffee",
        "title": "Costa Rica Sombra Del Poro",
        "blind_assessment": "Lemon, crisply cocoaish chocolate, dry-roasted nut in aroma and cup. Balanced, well-integrated acidity, smoothly silky mouthfeel. Cleanly rich finish.",
        "notes": "The name Sombra Del Poro, or shade of the poro, refers to a type of shade tree grown in the Tarrazu region. This coffee is Rainforest Alliance Certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. Caribou Coffee is a large (second largest in the U.S. after Starbucks) retail roasting chain based in the upper Middle West whose rather irreverent motto \"Life is short. Stay awake for it\" belies a serious approach to coffee. Visit www.cariboucoffee.com or call 888-227-4268 for more information.",
        "bottom_line": null,
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Tarrazu growing region, central Costa Rica",
        "roast level": "Medium-Dark",
        "agtron": "35/53",
        "est. price": "$12.99/16 ounces",
        "review date": "November 2010",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/costa-rica-sombra-del-poro/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "89",
        "roaster": "Caravan Coffee",
        "title": "Brazil Zinho Peaberry Natural",
        "blind_assessment": "Sweetly and gently pungent. Dark chocolate, cedar, walnut, a hint of orangy fruit in aroma and cup. Roast-rounded acidity; lightly syrupy mouthfeel. Some chocolate sweetness lingers in a rather dry, roasty finish.",
        "notes": "A dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Produced from trees of the respected Red Catuaí variety of Arabica. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. “Zinho” is the affectionate nickname of long-time farmer Joao Sydney de Souza. Caravan Coffee is an artisan roaster that began as a college-town café and now provides quality service and coffee to wholesale and retail customers nationally. Visit www.caravancoffee.com or call 800-875-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Newberg, Oregon",
        "coffee origin": "Campos Altos growing district, Minas Gerais State, Brazil.",
        "roast level": "Medium-Dark",
        "agtron": "38/49",
        "est. price": "$12.75/12 ounces",
        "review date": "April 2012",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/brazil-zinho-peaberry-natural/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Equator Coffees",
        "title": "Ecuador Finca Lugmapata",
        "blind_assessment": "Floral-driven, deep-toned. Lavender, dark chocolate, bing cherry, amber, tangerine zest in aroma and cup. Sweetly tart structure with balanced, juicy acidity; plush, satiny mouthfeel. Resonant finish with notes of lavender and dark chocolate.",
        "notes": "Produced by Enrique Merino, entirely of the Typica Mejorado variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Founded in 1995 by Brooke McDonnell and Helen Russell, Equator Coffees operates retail stores in the San Francisco Bay Area and southern California and provides coffee to hundreds of wholesale accounts. Visit www.equatorcoffees.com or call 800-809-7687 for more information.",
        "bottom_line": "A confident, energetic washed Ecuador cup characterized by spicy floral and rich chocolate notes.",
        "roaster location": "San Rafael, California",
        "coffee origin": "Pallatanga, Chimborazo Province, Ecuador",
        "roast level": "Medium-Light",
        "agtron": "62/79",
        "est. price": "$22.00/6 ounces",
        "review date": "April 2023",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ecuador-finca-lugmapata/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "83",
        "roaster": "Faustino Coffee",
        "title": "Pure Robusta",
        "blind_assessment": "Bittersweet, sharply pungent, earthy. Pungent fir, overripe plum, sweet earth that collectively leans toward chocolate in aroma and cup. Heavy, bitter-toned acidity; heavy mouthfeel. The overripe fruit and earth notes hint at chocolate in the short finish, but turn astringent and composty in the long.",
        "notes": "This coffee is produced entirely from trees of the Robusta species. It appears to be a dried-in-the-fruit or “natural” Robusta. Faustino Coffee Company is an Ontario, California based importer and distributer of coffees from the company’s estates in the Philippines. Visit www.faustinoco.com or call 951-205-2383 for more information.",
        "bottom_line": null,
        "roaster location": "Ontario, California",
        "coffee origin": "Philippines",
        "roast level": "Medium-Dark",
        "agtron": "42/55",
        "est. price": "$11.49/16 ounces",
        "review date": "December 2012",
        "aroma": "7",
        "acidity": "6",
        "body": "8",
        "flavor": "7",
        "aftertaste": "5",
        "url": "https://www.coffeereview.com/review/pure-robusta/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "87",
        "roaster": "Greenwell Farms",
        "title": "Greenwell Estate Private Reserve 100% Kona",
        "blind_assessment": "Delicate, high-toned, brightly acidy but sweet. The acidity turns a touch bitter in the fruit-toned finish but softens as the cup cools.",
        "notes": "Greenwell Farms is one of the oldest coffee farms and mills in Kona, still owned and operated on a direct, daily basis by Tommy Greenwell, a direct descendent of the founders. Greenwell Estate Private Reserve designates coffee grown on the Greenwell farm itself. Other Greenwell coffees are milled by Greenwell but grown on a variety of other Kona farms. Visit www.greenwellfarms.com or call 1-888-592-5662 for more info.",
        "bottom_line": null,
        "roaster location": "Kealakekua, Hawaii",
        "coffee origin": null,
        "roast level": "Medium-Dark",
        "agtron": "47/52",
        "est. price": null,
        "review date": "February 2002",
        "aroma": "7",
        "acidity": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": null,
        "url": "https://www.coffeereview.com/review/greenwell-estate-private-reserve-100-kona/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Regent Coffee",
        "title": "Colombia Tolima Finca El Mirador Washed Anaerobic",
        "blind_assessment": "Delicately fruit-toned. Guava, ginger blossom, cocoa nib, cedar, agave syrup in aroma and cup. Sweet-toned structure with juicy acidity; crisp, satiny mouthfeel. Cocoa-toned finish, supported by notes of cedar and agave.",
        "notes": "Produced by Victor Gutiérrez of Finca Mirador entirely of the Caturra variety of Arabica. Processed by the anaerobic washed method, in which the fermentation step occurs in a hermetically sealed vessel before the beans are washed and dried. With more than 10 years of roasting experience, Regent strives to deliver coffee with care and purpose. Visit regentcoffee.com for more information.",
        "bottom_line": "An appealing washed anaerobic cup: deep-toned, nuanced, richly sweet.",
        "roaster location": "Glendale, California",
        "coffee origin": "Tolima, Colombia",
        "roast level": "Medium-Light",
        "agtron": "59/79",
        "est. price": "$20.50/12 ounces",
        "review date": "November 2022",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/colombia-tolima-finca-el-mirador-washed-anaerobic/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "87",
        "roaster": "Caribou Coffee",
        "title": "Mahogany Blend (K-Cup)",
        "blind_assessment": "(As brewed in a Keurig B70 Platinum single-serve brewing device using a Keurig-compatible capsule to produce a 6-ounce serving): Buttery dark chocolate, a marzipan-like almond note with an enlivening hint of slightly tart fruit in aroma and cup. Brisk, roast-influenced acidity; very light but silky mouthfeel. Hints of chocolate and walnut survive in a sweet but drying finish.",
        "notes": "This blend is 100% Rainforest Alliance certified, meaning the blend components were produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. Caribou Coffee is a large (second largest in the U.S. after Starbucks) retail roasting chain based in the upper Middle West whose rather irreverent motto \"Life is short. Stay awake for it\" belies a serious approach to coffee. Visit www.cariboucoffee.com or call 888-227-4268 for more information.",
        "bottom_line": null,
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Not disclosed.",
        "roast level": "Very Dark",
        "agtron": "0/38",
        "est. price": "$18.49/24 K-Cups",
        "review date": "April 2013",
        "aroma": "8",
        "acidity": "7",
        "body": "7",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/mahogany-blend-k-cup/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Simon Hsieh's Aroma Roast Coffees",
        "title": "Fully Washed Ethiopia Phoenix Special “Dr. Evil”",
        "blind_assessment": "Evaluated as espresso. Floral-toned, sweetly brisk. Dark chocolate, raspberry, lilac-like flowers, incense-like cedar in aroma and small cup. Light, silky mouthfeel; richly drying, flavor-saturated finish. Briskly complex in three-parts milk: lilac, cedar, chocolate.",
        "notes": "Southern Ethiopia coffees like this one are produced from traditional Ethiopian varieties of Arabica long grown in the region. This example was processed by the wet or washed method (fruit skin and pulp are removed before drying). Ethiopia coffees processed with this method typically express great aromatic complexity and intensity, with a particular emphasis on floral and cocoa notes. In addition to his retail roasting operation, Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purposed-built commercial espresso blends and high quality single-origin coffees. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": null,
        "roaster location": "Taoyuan City, Taiwan",
        "coffee origin": "Ethiopia",
        "roast level": "Medium",
        "agtron": "45/57",
        "est. price": "NT $700/8 ounces",
        "review date": "December 2015",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/fully-washed-ethiopia-phoenix-special-dr-evil/",
        "acidity/structure": null,
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "Red Rooster Coffee Roaster",
        "title": "Flight Seasonal Espresso",
        "blind_assessment": "Evaluated as espresso. Bright, richly sweet-tart. Raspberry jam, hazelnut butter, baker’s chocolate, lilac, a hint of bourbon barrel in aroma and small cup. Lightly creamy mouthfeel; cocoa-toned finish with notes of raspberry jam and hazelnut. Florals return in three parts milk, with big wisteria-like notes in the short and more sweet-tart raspberry jam in the long.",
        "notes": "An espresso blend comprised of coffees from Ethiopia, Rwanda and Peru. Established in 2010, Red Rooster is an organic-certified micro-roaster focusing on socially conscious coffee and high-quality coffee. Visit redroostercoffee.com or call 540-745-7338 for more information.",
        "bottom_line": "A brightly lively, complex yet coherent blend of both washed and natural-processed coffees: juicy, sweetly tart, chocolaty and floral-toned, with a hint of appealing sweet ferment.",
        "roaster location": "Floyd, Virginia",
        "coffee origin": "Ethopia; Rwanda; Peru",
        "roast level": "Medium-Light",
        "agtron": "58/80",
        "est. price": "$16.49/12 ounces",
        "review date": "April 2018",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/flight-seasonal-espresso-5/",
        "acidity/structure": null,
        "with milk": "9"
    },
    {
        "rating": "91",
        "roaster": "Lexington Coffee Roasters",
        "title": "Bali Kintamani",
        "blind_assessment": "Complex, brandy-like fruit. Distinct lychee and ripe grape notes in aroma and cup, rounded with dark chocolate and sandalwood. Roundly bright acidity; full, syrupy mouthfeel. The finish is flavor-saturated and sweet, with a faint clove-like crispness.",
        "notes": "This coffee is certified organically grown and Rainforest Alliance Certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. The exotic and colorful island of Bali produces a small volume of coffee in the interior highlands. This is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Founded in 1990, Lexington Coffee is an award-winning artisan roasting company based in Virginia. Lexington’s focus on fresh, flavorful and sustainable coffee is reflected in its motto, “Fresh, Flavorful & Fair.” Visit www.lexingtoncoffee.com or call 800-322-6505 for more information.",
        "bottom_line": null,
        "roaster location": "Lexington, Virginia",
        "coffee origin": "Kintamani, Bali, Indonesia",
        "roast level": "Light",
        "agtron": "61/89",
        "est. price": "$14.25/12 ounces",
        "review date": "November 2012",
        "aroma": "7",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/bali-kintamani/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Barrington Coffee Roasting",
        "title": "Ketiara Sumatra",
        "blind_assessment": "Sweetly pungent, earthy. Moist, fresh-fallen leaves, orange zest, fresh-cut pine, cocoa, lily in aroma and cup. Richly tart in structure, with a savory edge. Light but buoyant mouthfeel. The finish consolidates around cocoa, orange and a deep, lily-like floral note.",
        "notes": "This coffee tied for the fourth-highest rating in a cupping of coffees from Sumatra for Coffee Review’s April 2019 tasting report. Coffees like this one from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet-hulling.” Produced by the Ketiara Cooperative, the only women-led cooperative in Indonesia, with 867 small-holding members. Certified at origin as fair-trade (by Fairtrade International) and organically grown, but not so labeled. Barrington Coffee is an artisan roaster dedicated to elite coffees, fresh delivery and roasting that foregrounds the coffee and not the roast. Visit www.barringtoncoffee.com or call 800-528-0998 for more information.",
        "bottom_line": "Attractive choice for lovers of the traditional Sumatra wet-hulled profile: earthy, pungent, yet bright, offering bonus satisfaction for supporters of progressive, women-led cooperatives.",
        "roaster location": "Lee, Massachusetts",
        "coffee origin": "Gayo (also Aceh) growing region, Aceh Province, northern Sumatra, Indonesia",
        "roast level": "Light",
        "agtron": "57/87",
        "est. price": "$16.95/12 ounces",
        "review date": "April 2019",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ketiara-sumatra/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Vigilante Coffee",
        "title": "Mexico Cañada Fria",
        "blind_assessment": "Sweetly and richly pungent. Violet, peach, almond butter, baker’s chocolate, fresh-cut cedar in aroma and cup. Round, quietly tart acidity; Smooth, satiny mouthfeel. The rich, flavor-saturated short finish consolidates to violet and baker’s chocolate in the long.",
        "notes": "Produce from trees of the Caturra, Typica, Bourbon and Pacamara varieties of Arabica at Cañada Fria Farm in the Veracruz growing region. Vigilante Coffee Company was founded in Washington DC's H Street NE neighborhood in 2012. Vigilante prides itself on directly sourcing its coffees, supporting its local community, and producing the freshest coffee possible. For more information, visit www.vigilantecoffee.com.",
        "bottom_line": "An attractive Mexico coffee with fine floral top notes and chocolate and aromatic wood undertones.",
        "roaster location": "Washington, DC",
        "coffee origin": "Veracruz, Mexico",
        "roast level": "Light",
        "agtron": "58/84",
        "est. price": "$30.00/12 ounces",
        "review date": "August 2016",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/mexico-canada-fria/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Lexington Coffee Roasters",
        "title": "Colombia FUDAM Nariño",
        "blind_assessment": "Sweetly fruit- and nut-toned. Plum, pistachio, magnolia, baking chocolate, oak in aroma and cup. Crisply sweet structure with brisk acidity; velvety-smooth mouthfeel. The finish consolidates to suggestions of plum, pistachio and oak.",
        "notes": "Certified USDA Organic and Fair Trade. From an admired growing region in the southernmost Colombia Department of Nariño and comprised of the Castillo, Caturra and Colombia varieties of Arabica; processed by the wet, or washed method (fruit skin and pulp are removed before drying). Founded in 1990, Lexington Coffee is an award-winning artisan roasting company based in Virginia. Lexington’s focus on fresh, distinctive and sustainable coffee is reflected in its motto, “Fresh, Flavorful & Fair.” Visit www.lexingtoncoffee.com or call 800-322-6505 for more information.",
        "bottom_line": "A friendly, balanced Colombia cup with pleasing stone fruit and rich nut notes as throughlines.",
        "roaster location": "Lexington, Virginia",
        "coffee origin": "Nariño Department, southern Colombia",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "$18.95/12 ounces",
        "review date": "November 2020",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/colombia-fudam-narino/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "88",
        "roaster": "Boyds Coffee",
        "title": "Rip City Blend",
        "blind_assessment": "Seductive aroma: sweet Meyer lemon, roasty chocolate, balanced and elegant. The lyric lemon and chocolate notes survive a sharp roastiness in the cup, but finally lose their way in the rather astringent finish.",
        "notes": "Boyds Coffee is a large, technically sophisticated wholesale and food service roaster with a long history of quality and innovation. Visit www.boyds.com or call 800-545-4077 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Not disclosed",
        "roast level": "Dark",
        "agtron": "36/41",
        "est. price": null,
        "review date": "February 2004",
        "aroma": "9",
        "acidity": "7",
        "body": "7",
        "flavor": "8",
        "aftertaste": null,
        "url": "https://www.coffeereview.com/review/rip-city-blend/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Thirty-Thirty Coffee Co.",
        "title": "Kenya French Mission Oreti Estate",
        "blind_assessment": "Crisp but juicy. Dark chocolate, raspberry, ripe plum, walnut in aroma and cup. Balanced, rich acidity; light but silky mouthfeel. The finish is bittersweet and slightly drying with walnut and chocolate hints.",
        "notes": "Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world's most elegant and distinctive coffees. French Mission is an heirloom, Bourbon-related East Africa tree variety. This is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Thirty-Thirty is a small-batch coffee roasting company located in Peoria Illinois that is committed to sourcing the finest green coffees and to expressing the individuality and character of those coffees through the roasting process all the way to the cup. Visit www.thirty-thirtycoffee.com or call 309-713-2983 for more information.",
        "bottom_line": null,
        "roaster location": "Peoria, Illinois",
        "coffee origin": "Thika Plateau, central Kenya.",
        "roast level": "Medium",
        "agtron": "55/66",
        "est. price": "$29.00/12 ounces",
        "review date": "November 2013",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-french-mission-oreti-estate/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "85",
        "roaster": "Dunkin' Donuts",
        "title": "Original Blend",
        "blind_assessment": "Delicate, perhaps a bit subdued. Vaguely sweet-toned, slightly cardboardy aroma with hints of flowers, nut, and raisiny dark chocolate. Gentle, muted acidity; smooth, almost silky mouthfeel. Very simple in the cup; bare hints of lemon, cocoaish nut, flowers perhaps. Clean finishing; rich in the short but flavor fades quickly in the long.",
        "notes": "Dunkin' Donuts claims to be the world's largest coffee and baked food chain. The Dunkin' Donuts Original Blend has distinguished itself over the last two decades by carrying the torch for the classic medium-roasted American breakfast cup against the darker-roasted onslaught of Starbucks. Visit www.dunkindonuts.com for more information.",
        "bottom_line": null,
        "roaster location": "Canton, Massachusetts",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium-Light",
        "agtron": "51/75",
        "est. price": "$10.39/12 ounces",
        "review date": "February 2012",
        "aroma": "7",
        "acidity": "7",
        "body": "7",
        "flavor": "7",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/original-blend-7/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "91",
        "roaster": "Coffee Emergency",
        "title": "Ethiopian Misty Valley",
        "blind_assessment": "Big, rich, sweet fruit-toned aroma: blueberries, Port wine and a hint of flowers. In the cup, a pleasant fermented version of berry and wine tones develop, as well as a fruity dark chocolate-like quality. Pleasingly smooth aftertaste, with a suggestion of citrus peel lingering in the long finish.",
        "notes": "A region of lush, rolling hills in south-central Ethiopia, Yirgacheffe is the most celebrated Ethiopian growing region. Most Yirgacheffe coffees are processed by the wet or washed method, meaning the fruit is removed from the beans or seeds before they are dried, which emphasizes the cleanly high-toned, intensely floral- and citrus-toned aspects of the Yirgacheffe cup. The Yirgacheffe reviewed here, however, is a \"natural\" or dry-processed version of the great Yirgacheffe profile, meaning the beans/seeds were dried inside the fruit, producing a flavor profile that is lower toned and richer with a giddy, wild, slightly fermented fruit. Like most Ethiopia coffees, this striking and unusual coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Coffee Emergency is a husband-and-wife-owned and operated small-batch roasting company and coffeehouse offering \"coffee prescriptions\" to their customers. Visit www.coffeeemergency.com or call 402-325-9154 for more information.",
        "bottom_line": null,
        "roaster location": "Lincoln, Nebraska",
        "coffee origin": "Yirgacheffe growing region, south-central Ethiopia.",
        "roast level": "Medium-Dark",
        "agtron": "38/49",
        "est. price": null,
        "review date": "July 2008",
        "aroma": "9",
        "acidity": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopian-misty-valley/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Finca Tasta",
        "title": "Coral",
        "blind_assessment": "Gently fruit-toned, harmonious and balanced. Strawberry, almond nougat, sandalwood, narcissus, lemon verbena in aroma and cup. Sweetly tart with juicy, bright acidity; vibrant, syrupy mouthfeel. Nicely composed finish centered around strawberry and sandalwood notes.",
        "notes": "This exceptional coffee was selected as the No. 25 coffee on Coffee Review’s list of the Top 30 Coffees of 2021. Produced and roasted by the Meza family at Finca Tasta, a 56-acre farm in Peru that has 19 acres cultivated with coffee and 22 acres of forest preserve. This coffee consists entirely of the bold-beaned Pacamara variety of Arabica and is processed by the natural method (dried in the whole fruit). International shipping available. Visit www.fincatasta.com for more information.",
        "bottom_line": "A pretty, berry-driven, richly sweet-tart Pacamara processed by the natural method.",
        "roaster location": "Llayla District, Satipo Province, Peru",
        "coffee origin": "Llayla District, Satipo Province, Peru",
        "roast level": "Medium-Light",
        "agtron": "58/78",
        "est. price": "$10.00/250 grams",
        "review date": "January 2021",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/coral/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "JBC Coffee Roasters",
        "title": "Tatu Kenya Peaberry",
        "blind_assessment": "Quietly rich, savory-sweet. Vanilla, dark chocolate, black sage, tart raspberry, sweet butter in aroma and more pungently in the cup. Tart but richly rounded acidity; smooth, lively mouthfeel. The finish is crisp with aromatic black sage in the long.",
        "notes": "Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world's most elegant and distinctive coffees. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. JBC Coffee Roasters (formerly Johnson Brothers Coffee Roasters) is a distinguished small-batch roasting company. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "South-central Kenya.",
        "roast level": "Medium-Light",
        "agtron": "55/73",
        "est. price": "$12.99/12 ounces",
        "review date": "August 2013",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/tatu-kenya-peaberry/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "88",
        "roaster": "Espresso Republic",
        "title": "Static Santa Luzia Brazil",
        "blind_assessment": "Sweetly spice-toned. Gardenia, baker’s chocolate, green grape, pecan, black peppercorn in aroma and cup. Brisk, sweet-tart acidity; delicate, silky mouthfeel. The gently drying finish consolidates to notes of pecan and baker’s chocolate with hints of gardenia.",
        "notes": "This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.",
        "bottom_line": "An accessible, sweetly nut- and spice-toned Brazil cup.",
        "roaster location": "Chino, California",
        "coffee origin": "Santa Luzia, Brazil",
        "roast level": "Medium-Light",
        "agtron": "55/76",
        "est. price": "$15.00/12 ounces",
        "review date": "May 2017",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/static-santa-luzia-brazil/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Olympia Coffee Roasting",
        "title": "Holiday Blend",
        "blind_assessment": "Delicate, sweetly savory. Red currant, honeysuckle, roasted cacao nib, agave syrup, eucalyptus in aroma and cup. Lively acidity lifts the sweet-savory structure; full, syrupy mouthfeel. The richly drying finish consolidates to notes of red currant, eucalyptus and cacao nib.",
        "notes": "This coffee tied for the fourth-highest rating in a tasting of holiday coffees for Coffee Review‘s December 2018 tasting report. A blend comprised of two Ethiopia coffees from independent farmers (as opposed to members of cooperatives) in the celebrated Yirgacheffe region: Adisu Kidane's natural-processed coffee, and Desta Gola's washed-process coffee. Olympia Coffee Roasting is a small-batch wholesale and retail roasting company with a youthful, no-nonsense style and a commitment to high-quality organic coffees. Visit www.olympiacoffee.com or call 360-753-0066 for more information.",
        "bottom_line": "A richly aromatic blend of two Ethiopia coffees, one washed- and one natural-processed, that deliver a complex package of bright and savory: flowers, pungent fruit, herb.",
        "roaster location": "Olympia, Washington",
        "coffee origin": "Yirgacheffe growing region, Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "56/80",
        "est. price": "$19.50/12 ounces",
        "review date": "December 2018",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/holiday-blend-25/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Black Coffee In Black Jar",
        "title": "Kenya FSC AB",
        "blind_assessment": "Richly sweet, deeply chocolaty. Chocolate fudge, red currant, wisteria, cedar, agave syrup in aroma and cup. Crisp, sweetly tart structure with vibrant, juicy acidity; plush, viscous mouthfeel. Quiet finish centered around notes of chocolate, wisteria and cedar.",
        "notes": "Produced from trees of the SL28, SL34, Ruiru 11 and Batian varieties of Arabica. Processed by a particularly meticulous Kenya variation on the traditional wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Black Coffee in Black Jar, a Taiwan-based nano-roaster and café, is named for both the Taiwanese slang phrase “black soy sauce in black jar,” indicating something is difficult to see through, and the literal black jar in which this company stores coffee to protect it from UV light. For more information, visit https://m.facebook.com/BlackCoffeeInBlackJar/.",
        "bottom_line": "A big, chocolaty Kenya cup with deep floral notes throughout and a particularly engaging, syrupy-smooth body.",
        "roaster location": "Taichung, Taiwan",
        "coffee origin": "Kirinyaga District, south-central Kenya",
        "roast level": "Medium",
        "agtron": "50/67",
        "est. price": "NT $1,000/100 grams",
        "review date": "December 2019",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-fsc-ab/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Social Coffee & Tea Company",
        "title": "Western Liberation House Blend II",
        "blind_assessment": "Deep, fruit-toned aroma with complications of nut and butter. In the cup balanced, intense: light citrus, hazelnut and chocolate; hints of concentrated cherry and dried berry. The chocolate turns bracingly bittersweet in the finish with a faint astringent hint.",
        "notes": "One of two signature house blends offered by Social Coffee & Tea Company. Based in the greater Toronto area, Social Coffee is dedicated to providing high quality, fresh-roasted, \"Glorious Coffee for the People.\" Visit www.socialcoffeecompany.com or call 866-515-5033 for more information.",
        "bottom_line": null,
        "roaster location": "Richmond Hill, Ontario, Canada",
        "coffee origin": "Ethiopia; El Salvador; Sumatra",
        "roast level": "Medium",
        "agtron": "48/59",
        "est. price": "CAD $13.00/12 oz.",
        "review date": "May 2010",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/western-liberation-house-blend-ii/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "95",
        "roaster": "Kuma Coffee",
        "title": "Panama Elida Estate",
        "blind_assessment": "Richly bright with a deeply expressed acidity: tart berry, black currant, dusk-blooming flowers. Pungently sweet acidity: silky mouthfeel. Very long, deep, resonant finish.",
        "notes": "A classic washed or wet-processed coffee from Panama’s celebrated Elida Estate. Kuma Coffee is a small Seattle, Washington based roaster that believes that coffee fosters relationships. Visit www.kumacoffee.com or call 206-384-6092 for more information.",
        "bottom_line": null,
        "roaster location": "Seattle, Washington",
        "coffee origin": "Alto Quiel, Boquete, Panama.",
        "roast level": "Medium-Light",
        "agtron": "54/80",
        "est. price": "$14.00/12 ounces",
        "review date": "November 2011",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/panama-elida-estate-3/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Counter Culture Coffee",
        "title": "Kenya Single Lot Gaturiri 4815",
        "blind_assessment": "A bright, citrusy profile. Very sweet-toned aroma with tight-knit complexity: flowers, pipe tobacco, and a soft, orangy citrus. In the cup pronounced acidity, medium body, richly distinct floral notes with continued citrus notes that turn toward a sweet but tart grapefruit under the influence of the acidity.",
        "notes": "Despite national coffee leadership marked by confusion and recent social disorder, Kenya cooperatives continue to produce some of the world's most elegant and distinctive coffees. Counter Culture is a small-batch wholesale specialty roaster with an informative and lively website, a commitment to fine coffee and youthful, enthusiastic leadership. Visit www.counterculturecoffee.com or call 888-238-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Durham, North Carolina",
        "coffee origin": "South-central Kenya.",
        "roast level": "Medium",
        "agtron": "51/65",
        "est. price": null,
        "review date": "August 2008",
        "aroma": "9",
        "acidity": "8",
        "body": "7",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-single-lot-gaturiri-4815/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Vivid Coffee",
        "title": "Kenya Gichithaini AA",
        "blind_assessment": "Deeply sweet-savory. Black tea, dark chocolate, golden raisin, sandalwood, tiger lily in aroma and cup. Roundly sweet with crisp acidity; silky, buoyant mouthfeel. Sandalwood and black tea lead in the finish.",
        "notes": "Produced by smallholding members of the Gikanda Farmers Cooperative Society from trees of the SL28, SL34 and Ruiru 11 varieties of Arabica, and processed by the traditional washed method (fruit skin and flesh are removed from the beans before they are dried) at the Gichithaini mill. Vivid Coffee Roasters is a wholesale and retail roaster and café based in Burlington, Vermont. Visit www.vividcoffee.com for more information.",
        "bottom_line": "A pleasing cup for those who prefer a deeper, savory-leaning Kenya profile to the brighter style. Particularly lively, lilting mouthfeel.",
        "roaster location": "Burlington, Vermont",
        "coffee origin": "Mathira West District, Nyeri County, Kenya",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "$15.00/8 ounces",
        "review date": "October 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "8",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-gichithaini-aa/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Klatch Coffee",
        "title": "Ethiopia Yirgacheffe GR1 Bedhatu Jibicho Washed",
        "blind_assessment": "Deeply sweet, crisply herb-toned. Lemon verbena, plum, baking chocolate, hazelnut, honeysuckle in aroma and cup. Sweetly tart structure with brisk acidity; full, syrupy mouthfeel. Resonant finish with lemon verbena and baking chocolate front and center.",
        "notes": "Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian varieties of Arabica long grown in their respective regions. Processed by the wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Klatch Coffee is an award-winning small-batch roasting company in the Los Angeles area whose resident barista and trainer, Heather Perry, won both the 2003 and 2007 United States Barista Championships brewing a Klatch Coffee espresso blend. Visit www.klatchroasting.com or call 877-455-2824 for more information.",
        "bottom_line": "A balanced, crisply herb-toned washed Yirgacheffe cup deepened by sweet stonefruit notes.",
        "roaster location": "Los Angeles, California",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "56/74",
        "est. price": "$17.95/12 ounces",
        "review date": "November 2019",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-gr1-bedhatu-jibicho-washed/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "91",
        "roaster": "Magic Hat Cafe",
        "title": "Papua New Guinea",
        "blind_assessment": "Delicately sweet, citrusy. Dried persimmon, caramel, pecan, orange zest, cane sugar in aroma and cup. Sweetly tart with gentle acidity; full, satiny-smooth mouthfeel. The gently crisp finish leads with caramel and notes of bittersweet orange zest.",
        "notes": "Produced by the Leahy family of Korgua Estate, entirely of the Typica Blue Mountain variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Magic Hat Café is a nano-roaster based in the small city of Yun-Lin, Taiwan that offers retail and wholesale coffee. For more information, visit https://www.facebook.com/magichatcafe.",
        "bottom_line": "A citrusy, crisply nut-toned cup with a caramel-like sweetness and persimmon undertones.",
        "roaster location": "Yun-Lin, Taiwan",
        "coffee origin": "Western Highlands, Papua New Guinea",
        "roast level": "Medium",
        "agtron": "52/66",
        "est. price": "NT $380/230 grams",
        "review date": "September 2023",
        "aroma": "8",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/papua-new-guinea-11/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "81",
        "roaster": "Astro Cafe",
        "title": "Astro Cafe",
        "blind_assessment": "Both Ken and co-taster Willem Boot found the aroma impressive: \"elegant, sweet nut\" for Willem, \"elegant, sweet and fruity\" for Ken. Once to the cup, however, neither found much to praise. Willem found the flavor \"pungent but sweet and sour,\" Ken \"bittersweet but sharp and shallow.\" Willem faintly praised this coffee's presence in milk as \"mellow,\" whereas Ken found it \"thin, a bit sharp.\" Willem 79, Ken 82.",
        "notes": "A blend of beans from two respected Brazilian farms, Lambari Estate in the Sul de Minas growing region and Rancho Grande Estate in the Mogiana region. Roasted and packaged on the Rancho Grande farm in Brazil. Perhaps problems with packaging or roasting accounted for the relatively low rating of this coffee, which comes with outstanding credentials as a green coffee. Visit www.astrocafe.com.br or call 703-444-6912 for more info.",
        "bottom_line": null,
        "roaster location": "Sterling, Virginia",
        "coffee origin": "Southern Minas Gerais State and northern Sao Paulo State, Brazil",
        "roast level": "Medium-Dark",
        "agtron": "41/55",
        "est. price": null,
        "review date": "August 2003",
        "aroma": "8",
        "acidity": null,
        "body": "6",
        "flavor": "6",
        "aftertaste": null,
        "url": "https://www.coffeereview.com/review/astro-cafe/",
        "acidity/structure": null,
        "with milk": "6"
    },
    {
        "rating": "91",
        "roaster": "Stumptown Coffee Roasters",
        "title": "Nicaragua Los Vasques",
        "blind_assessment": "Huge body, luscious Belgian chocolate flavor with plenty of supporting acidity. Vanilla bean along with the chocolate in the finish. Roast is perfectly matched to the coffee.",
        "notes": "A prize winner in the 2006 Nicaragua Cup of Excellence competition, where as a green (unroasted) coffee it placed eighth out of hundreds of entries, attracting a score of 87.48 from an international jury. Produced from trees of the Caturra variety at an elevation of approximately 4,000 feet on the Luis Alberto Vasquez farm. Stumptown Coffee is a small-batch premium roasting company that wholesales its coffees as well as serves them custom brewed by the cup in its Portland cafes. Under the youthful and enthusiastic leadership of Duane Sorenson, Stumptown has become a leading buyer and supporter of competition-winning coffees. Visit www.stumptowncoffee.com or call 503-230-7797 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Madriz growing region, Nicaragua",
        "roast level": "Medium-Light",
        "agtron": "56/69",
        "est. price": "NA",
        "review date": "December 2006",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/nicaragua-los-vasques/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "95",
        "roaster": "Paradise Roasters",
        "title": "Ethiopia Cup of Excellence Guji Natural",
        "blind_assessment": "Complex, bright, citrusy. Meyer lemon zest, cocoa nib, dried hibiscus flowers, marjoram, red plum in aroma and cup. Sweetly tart with crisp but juicy acidity; lightly viscous, satiny mouthfeel. Layered finish with citrus and cocoa at the center.",
        "notes": "Produced by Ato Yidnekachew Seleshi from trees of the admired indigenous 74110 selection of Arabica and processed by the natural method (dried in the whole fruit). Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "A delicate, high-toned Ethiopia cup with sweet herb undertones, ethereal in its perfumy complexity.",
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "West Guji Zone, Hambela Wamena Woreda, Ethiopia",
        "roast level": "Light",
        "agtron": "68/90",
        "est. price": "$19.95/4 ounces",
        "review date": "December 2020",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/ethiopia-cup-of-excellence-guji-natural/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Notch Coffee",
        "title": "Sumatra Boru Batak",
        "blind_assessment": "Sweetly pungent, complexly layered. Baker's chocolate, pink grapefruit zest, dried mango, freesia, perique (fermented) tobacco in aroma and cup. Juicy, bright, balanced acidity; full, syrupy mouthfeel. The resonant, richly drying finish has a throughline of baker’s chocolate and dried mango, accented by tobacco and spicy floral notes.",
        "notes": "Coffees from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet-hulling.” This is a particularly refined example of the type, produced in the Lintong region south of Lake Toba, one of the oldest and arguably the most admired of Sumatra growing regions. Notch roasts in small batches to maintain quality and also offers a signature line of cold-brew, ready-to-drink coffees and concentrates. Visit www.notchcoffeee.com for more information; to order, email [email protected].",
        "bottom_line": "A flavor-saturated Sumatra with lively citrus, elegant fruit and lush tobacco notes.",
        "roaster location": "Vancouver, British Columbia, Canada",
        "coffee origin": "Lintong growing region, North Sumatra Province, Sumatra, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "54/80",
        "est. price": "$14.99/12 ounces",
        "review date": "May 2017",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/sumatra-boru-batak/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "JBC Coffee Roasters",
        "title": "ASOPCAFA Colombia",
        "blind_assessment": "Sweetly brisk and perfumy. Honey, tea rose, dark chocolate, candied walnut in aroma and cup. Crisp, sweetly tart acidity; light but velvety mouthfeel. Rich, long, deeply flavor-saturated finish.",
        "notes": "This coffee was produced by the ASOPCAFA Cooperative, which was founded in 2013 and has 84 members. It is a wet-processed, or washed, coffee, meaning that the skin and fruit pulp were removed or “washed” from the beans before they were dried. JBC Coffee Roasters was founded in 1994 as Johnson Brothers Coffee Roasters and is a family-owned specialty coffee roastery located in Madison, Wisconsin. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Huila Department, southern Colombia",
        "roast level": "Medium-Light",
        "agtron": "60/77",
        "est. price": "$14.85/12 ounces",
        "review date": "December 2015",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/asopcafa-colombia/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Ghost Town Coffee Roasters",
        "title": "Brazil Grota Funda",
        "blind_assessment": "Resonant, gently pungent. Raisin, peach, honey, sweet chocolate, a hint of fresh-cut fir in aroma and cup. Quiet, lively acidity; light though plush mouthfeel. Flavor consolidates in a round, richly drying finish.",
        "notes": "From trees of the Catuai and Yellow Bourbon varieties of Arabica processed by the pulped natural method, in which the skin is removed from the coffee fruit immediately after picking, but the seeds or beans are dried with the sweet pulp, or fruit flesh, still adhering to them. Ghost Town is a small-batch roaster, wholesaler, equipment supplier and training resource located in Bozeman, Montana that takes great care in responsibly sourcing top-quality specialty coffees. Visit www.ghosttowncoffee.com call 406-586-0777 for more information.",
        "bottom_line": null,
        "roaster location": "Bozeman, Montana",
        "coffee origin": "Carmo de Minas growing region, Minas Gerais State, Brazil",
        "roast level": "Medium",
        "agtron": "51/62",
        "est. price": "$13.50/12 ounces",
        "review date": "March 2014",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/brazil-grota-funda/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Lexington Coffee Roasters",
        "title": "Kenya Gachatha",
        "blind_assessment": "Spicy and crisply pungent. Fresh-cut fir, black currant, caralm, spicy wild rose, a hint of black peppercorn in arom and cup. Tartly sweet acidity; velvety, drying mouthfeel. Spicy and drying in the short finish, sweetening in the long.",
        "notes": "Despite grower discontent, unclear government coffee policy and urban encroachment on prime coffee lands, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. A wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Founded in 1990, Lexington Coffee is an award-winning artisan roasting company based in Virginia. Lexington’s focus on fresh, flavorful and sustainable coffee is reflected in its motto, “Fresh, Flavorful & Fair.” Visit www.lexingtoncoffee.com or call 800-322-6505 for more information.",
        "bottom_line": null,
        "roaster location": "Lexington, Virginia",
        "coffee origin": "South-central Kenya",
        "roast level": "Medium-Light",
        "agtron": "58/80",
        "est. price": "$19.95/12 ounces",
        "review date": "November 2015",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-gachatha/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Bird Rock Coffee Roasters",
        "title": "Ecuador Rosa Abad",
        "blind_assessment": "Intense aroma combining notes of peach, flowers and nut. The sweet peach and floral tones soften in the cup, complicated by suggestions of tart lemon and bittersweet chocolate. Citrusy acidity; lightly syrupy mouthfeel. Flavors simplify in a walnut-edged finish.",
        "notes": "Certified organically grown by farmer Rosa Abad and a prize winner at Ecuador’s Taza Dorada (Golden Cup) competition, where as a green (unroasted) coffee it placed second out of hundreds of entries. Based in the San Diego area, Bird Rock Coffee Roasters is a retailer and wholesaler that focuses on organic and socially responsible coffees. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.",
        "bottom_line": null,
        "roaster location": "La Jolla, California",
        "coffee origin": "Loja Province, Ecuador",
        "roast level": "Medium-Light",
        "agtron": "52/71",
        "est. price": "$13.75/12 ounces",
        "review date": "March 2011",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/ecuador-rosa-abad/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "El Gran Café",
        "title": "La Esperanza Villa Sarchi",
        "blind_assessment": "Crisply sweet, high-toned, straightforward. Cocoa powder, lime zest, fresh-cut fir, freesia-like flowers, walnut in aroma and cup. Quietly tart structure with round, gently brisk acidity; lightly satiny mouthfeel. The rich-toned finish consolidates to notes of cocoa powder and walnut with hints of flowers.",
        "notes": "Produced at Beneficio La Esperanza exclusively from trees of the Villa Sarchi variety of Arabica and processed by the washed method. Certified USDA Organic. El Gran Cafe is a coffee shop located in the heart of Antigua, Guatemala whose mission is to roast and serve organic-certified coffees produced at its own Finca La Esperanza and Finca El Pintado just outside of town. Featured in El Gran Cafe’s lineup are also coffees from friends and neighbors in the region, along with award-winning and exceptional coffees from other regions of Guatemala. Visit https://elgran.cafe/ for more information.",
        "bottom_line": "A friendly, accessible cocoa-framed Guatemala cup with suggestions of citrus and spicy florals throughout.",
        "roaster location": "Antigua, Guatemala",
        "coffee origin": "Antigua growing region, Guatemala",
        "roast level": "Medium",
        "agtron": "52/68",
        "est. price": "$16.50/12 ounces",
        "review date": "October 2020",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/la-esperanza-villa-sarchi/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "91",
        "roaster": "The Supreme Bean",
        "title": "Ethiopia Yirgacheffe",
        "blind_assessment": "The roast takes equal place with the coffee in the success of this darker roasted Yirgacheffe, proving, in co-cupper Christy Thorns' (91) words, \"the amazing roasting range that a fine Ethiopian coffee can withstand.\" Christy finds \"stone fruit, licorice, black pepper, citrus, rose petal and lavender\" in the aroma and cup. Ken (90) also admired the rich floral and sweet citrus character.",
        "notes": "Its tendency to high-toned, floral and citrus sweetness has made Yirgacheffe, from a lushly beautiful range of hills in southern Ethiopia, one of the world's most admired coffees. The Supreme Bean is a Los Angeles-area small-batch wholesale roaster specializing in roasted-to-order single origin coffees and premium espresso blends. Visit www.thesupremebean.com or call 888-288-5282 for more information.",
        "bottom_line": null,
        "roaster location": "North Hollywood, California",
        "coffee origin": "Yirgacheffe growing region, Sidamo Province, southern Ethiopia",
        "roast level": "Medium-Dark",
        "agtron": "36/48",
        "est. price": null,
        "review date": "October 2004",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": null,
        "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-8/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Peach Coffee Roasters",
        "title": "Colombia Bandida Lactic Natural",
        "blind_assessment": "Bright, juicy, high-toned. Bing cherry, chocolate fudge, toffee, hop flowers, cedar in aroma and cup. Sweetly savory with vibrant, citrusy acidity; very smooth, satiny mouthfeel. The tart-leaning finish is rounded by sweet chocolate notes.",
        "notes": "Produced by Andres Guaca of Finca La Bandida entirely of the rare Pink Bourbon variety of Arabica, and processed by fermenting whole cherries for 65 hours with the addition of lactobacilli, then drying them in the sun. Peach Coffee Roasters is an Atlanta, Georgia-based specialty roaster. Visit peachcoffeeroasters.com for more information.",
        "bottom_line": "A richly bittersweet Colombia cup processed with the addition of lactobacilli to the whole-cherry fermentation, resulting in a fundamentally sweet cup with savory undertones.",
        "roaster location": "Johns Creek, Georgia",
        "coffee origin": "Huila Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "52/72",
        "est. price": "$28.99/12 ounces",
        "review date": "June 2021",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/colombia-bandida-lactic-natural/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Amor",
        "title": "Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Simple but round, resonantly pungent, balanced. Dark chocolate, cedar, plum, blood orange zest, a hint of anise in aroma and small cup. Smooth, velvety mouthfeel. Flavor consolidates around chocolate and cedar in a sweet though drying finish. Crisp and chocolaty in three parts milk, nuanced by hints of orange zest and anise.",
        "notes": "Amor is a food and beverage company based in Bangkok, Thailand. Visit http://amorbangkok.com/Product.html for more information. Email [email protected] to order coffee.",
        "bottom_line": "A darker-roasted espresso in the robust traditional style, pungent with aromatic wood notes rounded and sweetened by dark chocolate suggestions.",
        "roaster location": "Bangkok, Thailand",
        "coffee origin": "Not disclosed",
        "roast level": "Medium-Dark",
        "agtron": "43/54",
        "est. price": "THB $320/250 grams",
        "review date": "April 2018",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/amor/",
        "acidity/structure": null,
        "with milk": "8"
    },
    {
        "rating": "92",
        "roaster": "PT's Coffee Roasting Co.",
        "title": "Limu Gomma Ethiopia",
        "blind_assessment": "Very sweet-toned aroma: honey, cherryish coffee fruit, flowering grass. In the cup quietly vibrant acidity, lightly syrupy mouthfeel, balanced structure, with cocoa and honey notes that carry into a long, resonantly flavor-saturated finish.",
        "notes": "Certified organically grown. PT's Coffee is a passionately quality oriented small-batch roasting company operating under the motto is \"without the love, it's just coffee.\" Visit www.ptscoffee.com or call 888-678-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Topeka, Kansas",
        "coffee origin": "Limu growing region, southern Ethiopia.",
        "roast level": "Medium-Light",
        "agtron": "59/82",
        "est. price": null,
        "review date": "June 2008",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/limu-gomma-ethiopia/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "89",
        "roaster": "PT's Coffee Roasting Co.",
        "title": "Kansas Sunrise Blend",
        "blind_assessment": "Complex aromatics: flowers, pear, hints of brandy and cherry in the aroma. In the cup delicately acidy, roundly supple in mouthfeel, with a continued complex fruit that co-cupper Danny O'Neill (87) read as sweet raisin and Ken (more elaborately at 91) as dried cherry, fresh pear, brandy and flowers. Rich though surprisingly short-lived finish.",
        "notes": "PT's is a quality-oriented wholesale/retail specialty roaster with a wide and refined selection of coffee blends and origins. The PT's motto is \"without the love, it's just coffee.\" Visit www.ptscoffee.com or call 888-678-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Topeka, Kansas",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium",
        "agtron": "51/65",
        "est. price": null,
        "review date": "July 2006",
        "aroma": "8",
        "acidity": "8",
        "body": "7",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/kansas-sunrise-blend/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Ka'u Specialty Coffee",
        "title": "Estate Medium Roast",
        "blind_assessment": "Deeply sweet, delicately zesty, complexly fruit- and floral-toned. Peach, grapefruit zest, alyssum-like flowers, dark chocolate, cinnamon in aroma and cup. Sweetly tart in structure, with a deepening savory-bitter edge. Light, satiny mouthfeel; flavor saturates a deep, richly floral and chocolate-toned finish.",
        "notes": "Ka’u is an emerging Hawaii coffee-growing district centered approximately 30 miles southeast of the famous Kona region. This Ka’u is produced by the Palehua Ohana Cooperative of small-holding Ka’u farmers, an organization dedicated to impeccable socio-economic and environmental practices. It was processed using the wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Visit www.kauspecialtycoffee.com for more information.",
        "bottom_line": "A coffee both classic in its crisp clarity and subtly original in its high-toned fruit and floral aromatics.",
        "roaster location": "Pahala, Hawaii",
        "coffee origin": "Ka'u growing region, Big Island of Hawaii",
        "roast level": "Medium-Light",
        "agtron": "61/77",
        "est. price": "$29.48/8 ounces",
        "review date": "January 2018",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/estate-medium-roast/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Buon Caffe",
        "title": "Spring Blend",
        "blind_assessment": "Sweetly nut-toned, delicately bright. Pistachio, cocoa powder, red grape, cedar, hint of tarragon in aroma and cup. Brislky sweet acidity; full, satiny mouthfeel. Cocoa-toned finish supported by notes of pistachio and red grape.",
        "notes": "A blend of coffees from two origins: a washed Guatemala and a natural-processed Ethiopia. Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.",
        "bottom_line": "A quietly confident blend of washed Guatemala and natural-processed Ethiopia, the former contributing complex nut tones, and the latter, structured fruit.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Guatemala; Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "59/77",
        "est. price": "NT $349/8 ounces",
        "review date": "May 2024",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/spring-blend-2/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Caribou Coffee",
        "title": "El Guapo Guatemala",
        "blind_assessment": "Savory-sweet, complex, original. Aroma and flavor notes are shifting, often surprising: Roasted cacao nib, cedar, a hint of brandy, rich, pungent fruit suggesting grilled pineapple perhaps. Round, deeply expressed acidity; lightly syrup mouthfeel. The finish is chocolaty and sweet, though drying.",
        "notes": "This is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. It is a 100% Rainforest Alliance certified coffee, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. Caribou Coffee is a retail roasting chain based in the upper Middle West whose rather irreverent motto \"Life is short. Stay awake for it\" belies a serious approach to coffee. Visit www.cariboucoffee.com or call 888-227-4268 for more information.",
        "bottom_line": null,
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "New Oriente growing region, Guatemala.",
        "roast level": "Medium-Light",
        "agtron": "55/72",
        "est. price": "$16.99/16 ounces",
        "review date": "September 2013",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/el-guapo-guatemala/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "91",
        "roaster": "Gavina Gourmet Coffee",
        "title": "Colombia Supremo",
        "blind_assessment": "Rich, pronounced but sweet-toned acidity dominates aroma and cup. Milk chocolate, fresh-cut aromatic wood and a hint of fruit in the aroma. In the cup heavy body, continued aromatic wood and chocolate with a dry, pungent fruit that suggests black currant or dried apricot. Flavor outlasts astringency in the long, resonant finish.",
        "notes": "Supremo is the highest grade of Colombia coffee based on fewest physical imperfections and largest bean size. This coffee is available to consumers via Don Francisco Gourmet Coffee, the specialty line of F. Gavina & Sons, the large family-owned-and-operated roasting company in the Los Angeles area. Visit www.don-francisco.com or call 800-697-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Vernon, California",
        "coffee origin": "Colombia.",
        "roast level": "Medium",
        "agtron": "54/65",
        "est. price": null,
        "review date": "December 2009",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/colombia-supremo-3/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "96",
        "roaster": "Hula Daddy Kona Coffee",
        "title": "Laura’s Reserve SL34",
        "blind_assessment": "Bright, balanced, juicy-sweet. Red plum, cocoa nib, blood orange, star jasmine, lemon verbena in aroma and cup. Richly sweet structure with vibrant acidity; very full, syrupy mouthfeel. The finish is long, lingering and flavor-saturated.",
        "notes": "This exceptional coffee was selected as the No. 21 coffee on Coffee Review’s list of the Top 30 Coffees of 2023. SL28 and SL34 are varieties famous for producing the great classic coffees of Kenya. Hula Daddy is a boutique coffee producer with farms at the 1,400- and 2,500-foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This SL34 coffee was produced at the higher elevation Hula Daddy farm and processed anaerobically using commercial yeast. Visit www.huladaddy.com or call 808-327-9744 for more information.",
        "bottom_line": "A Kona-Kenya mashup: This is an SL 34 variety grown in Kona that’s deep-toned and intricately balanced, with notes of stone fruit, cocoa nib and complex florals.",
        "roaster location": "Holualoa, Hawai’i",
        "coffee origin": "Holualoa, North Kona growing district, “Big Island” of Hawai’i",
        "roast level": "Medium-Light",
        "agtron": "60/80",
        "est. price": "$69.95/8 ounces",
        "review date": "January 2023",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "10",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/lauras-reserve-sl34-3/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Lee Dong Coffee",
        "title": "Gesha Village Estate Yilu Forest Dimma",
        "blind_assessment": "Crisply sweet-tart. Candied apple, praline, clove, magnolia, fresh-cut fir in aroma and cup. Sweet-toned structure with brisk acidity; very full, syrupy mouthfeel. Wood-framed, floral finish.",
        "notes": "The celebrated Geisha (also spelled Gesha) variety of Arabica first came to the coffee world’s attention growing in Panama. This particular version, however, is the outcome of successful efforts to commercialize Geisha in the region from which it originally came, western Ethiopia, from seed selected from wild trees of the Geisha variety in the nearby Gori Gesha forest. Processed by the honey method, in which some of the fruit flesh is left on the beans during the drying process. Lee Dong Coffee is a specialty coffee roaster and cafe in Taichung, Taiwan. Visit www.facebook.com/LiDongcoffee/ for more information.",
        "bottom_line": "A crisp, balanced honey-processed Ethiopia with candy-like sweetness and rich aromatic wood notes throughout.",
        "roaster location": "Taichung, Taiwan",
        "coffee origin": "Gori Gesha Forest, Bench Maji Zone, SNNPR Region, Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "60/76",
        "est. price": "NT $520/8 ounces",
        "review date": "October 2023",
        "aroma": "8",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/gesha-village-estate-yilu-forest-dimma/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "89",
        "roaster": "Moka Joe Coffee",
        "title": "Bolivia Caranavi",
        "blind_assessment": "Deep, gently charred tones in the aroma are complicated by semi-sweet chocolate, low-key fruit and distinct floral top notes. In the cup medium-bodied but pleasingly bananaish in mouthfeel, with a continued gently charred, deeply roasty character. The floral notes dissipate but the fundamental chocolate-banana-toned fruit persists into the slightly tight finish.",
        "notes": "This Bolivia coffee is produced by small-holding farmers and is certified organically grown and apparently Fair Trade certified, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Certainly the bag copy pulls out all the stops: \"100% Organic, Fair-Trade, Shade Grown, Bird-Friendly.\" Nine certification and membership seals appear on the side of the package, including the seal for TransFair USA, the American certifier representing the Fairtrade Labeling Organizations International (FLO). Visit www.mokajoe.com or call 360-714-1953 for more information.",
        "bottom_line": null,
        "roaster location": "Bellingham, Washington",
        "coffee origin": "Bolivia.",
        "roast level": "Dark",
        "agtron": "36/44",
        "est. price": null,
        "review date": "September 2007",
        "aroma": "8",
        "acidity": null,
        "body": "8",
        "flavor": "7",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/bolivia-caranavi/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Paradise Roasters",
        "title": "S.O. Espresso Brazil Fazenda Cachoeira Yellow Bourbon",
        "blind_assessment": "Sweetly nut-toned, chocolaty. Hazelnut butter, baking chocolate, pink peppercorn, fresh-cut fir, graham cracker in aroma and cup. Sweet structure with gentle acidity; satiny-smooth mouthfeel. The nut-toned finish is supported by aromatic wood and peppercorn.",
        "notes": "Produced at Fazenda Cachoeira de Grama entirely of the Yellow Bourbon variety of Arabica and processed by the natural method. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "Designed as a single-origin espresso but cupped here for brewed applications, this natural-processed Brazil coffee offers a gentle, sweetly nut-toned cup.",
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Vale de Grama, Mogiana, Brazil",
        "roast level": "Medium",
        "agtron": "50/68",
        "est. price": "$14.95/12 ounces",
        "review date": "April 2020",
        "aroma": "8",
        "acidity": null,
        "body": "8",
        "flavor": "8",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/s-o-espresso-brazil-fazenda-cachoeira-yellow-bourbon/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Simon Hsieh's Aroma Roast Coffees",
        "title": "Forbidden Cave of Maya Guatemalan Blend",
        "blind_assessment": "Evaluated as espresso. Rich, deep, complex. In the small cup aromatic wood, apricot-like fruit, dark chocolate, night-blooming flowers and a hint of lemony citrus in aroma and flavor. Big, velvety mouthfeel. Flavor persists deep in a richly drying finish. Presents a crisply dry, forceful dark chocolate in two parts milk.",
        "notes": "In addition to his retail roasting operation Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purposed-built commercial espresso blends and high quality single-origin coffees. Visit www.facebook.com/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.",
        "bottom_line": null,
        "roaster location": "Taoyuan City, Taiwan",
        "coffee origin": "Guatemala",
        "roast level": "Medium",
        "agtron": "48/57",
        "est. price": "NTD $1,200/16 ounces",
        "review date": "December 2012",
        "aroma": "8",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/forbidden-cave-of-maya-guatemalan-blend/",
        "acidity/structure": null,
        "with milk": "8"
    },
    {
        "rating": "93",
        "roaster": "Tipico Coffee",
        "title": "Ethiopia Karamo Natural",
        "blind_assessment": "Gently sweet-tart, citrus-toned. Cocoa nib, tangerine, lilac, mango, cedar in aroma and cup. Richly sweet structure with brisk acidity; full, syrupy mouthfeel. The quietly tart finish consolidates to cocoa-toned mango and cedar.",
        "notes": "Produced by Nigusse Gemeda Mude from trees of local heirloom varieties of Arabica, and processed by the natural method (dried in the whole fruit). Tipico Coffee is a café and specialty coffee roaster based in Buffalo, New York. Visit www.tipicocoffee.com for more information.",
        "bottom_line": "A tropical-leaning natural-processed Ethiopia cup driven by high-toned fruit and deep floral tones, with a cocoa nib throughline.",
        "roaster location": "Buffalo, New York",
        "coffee origin": "Sidamo (also Sidama) growing region, south-central Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "58/76",
        "est. price": "$17.75/12 ounces",
        "review date": "March 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-karamo-natural/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "96",
        "roaster": "Temple Coffee and Tea",
        "title": "Panama Don Pepe Estate Geisha Single-Origin Espresso",
        "blind_assessment": "Evaluated as espresso. Delicately yet vastly intricate; crisp yet lush. Buttery chocolate, deeply sweet, lilac-like flowers, pungent sandalwood in aroma and small cup. Light, silky mouthfeel; flavor consolidates but rings on in a richly drying finish. Complex and complete in three parts milk: buttery, fruit-toned chocolate, a continuing shimmer of flowers.",
        "notes": "This exceptional coffee was selected as the No. 6 coffee on Coffee Review’s list of the Top 30 Coffees of 2015. From trees of the Geisha (also spelled Gesha) variety planted on the slopes of Volcan Baru in the Boquete growing region at elevations between 5,000 and 5,700 feet, where trees of this celebrated variety are said to have first been established in Panama, brought from Costa Rica in 1898 by Don Enrique Vasquez. With its generally elongated beans and distinctive floral and crisp, often chocolaty, cup, the Geisha variety continues to distinguish itself as one of the world’s unique coffees. Temple Coffee is a quality-focused retail and wholesale specialty roaster active in Sacramento, California since 2005. Committed to sourcing, roasting and brewing the finest coffees, Temple features coffee from distinguished single estates and cooperatives around the world. Visit www.templecoffee.com or call 916-454-1282 for more information.",
        "bottom_line": null,
        "roaster location": "Sacramento, California",
        "coffee origin": "Boquete growing region, western Panama",
        "roast level": "Medium",
        "agtron": "48/59",
        "est. price": "$19.50/12 ounces",
        "review date": "October 2015",
        "aroma": "10",
        "acidity": null,
        "body": "8",
        "flavor": "10",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/panama-don-pepe-estate-geisha-single-origin-espresso/",
        "acidity/structure": null,
        "with milk": "10"
    },
    {
        "rating": "91",
        "roaster": "Blue Bottle Coffee",
        "title": "Three Africans",
        "blind_assessment": "Mellow, balanced, sweet. Molasses, cinnamon, chocolate fudge, orange zest in aroma and cup. Balanced, sweet-toned acidity; lively, syrupy mouthfeel. The finish is sweet and resonant, saturated by chocolate notes.",
        "notes": "Certified organic. According to the Blue Bottle website, this blend combines a wet-processed or “washed” Ethiopia, a dry-processed or “natural” Ethiopia, and either a wet-processed Uganda or Congo. Blue Bottle Coffee started as the quintessential boutique coffee business: a micro-roasting operation in Oakland housed inside a space about as large as a suburban walk-in closet and a single retail location in San Francisco. In the years since its founding Blue Bottle has attracted a strong following in the San Francisco Bay Area and beyond, and now operates four roasting locations in Oakland, California; Brooklyn, New York; Los Angeles, California; and Tokyo, Japan. Visit www.bluebottlecoffee.com or call 510-653-3394 for more information.",
        "bottom_line": "An engaging blend of Africa coffees, equally lively and mellow, with chocolate suggestions from nose to finish.",
        "roaster location": "Oakland, California",
        "coffee origin": "Uganda or Congo; Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "51/71",
        "est. price": "$15.75/12 ounces",
        "review date": "April 2016",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/three-africans-2/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Rufous Coffee",
        "title": "Hummingbird Espresso",
        "blind_assessment": "Reviewed as espresso. Balanced, quietly complex, complete. Apricot, chocolate, vanilla, narcissus-like flowers, fresh-cut cedar in aroma and cup. Silky mouthfeel. Crisp, cedar-toned finish. Flowers and chocolate persist with pleasing clarity in three parts milk.",
        "notes": "Rufous Coffee is an aficionado cafe and in-store roasting company in Taipei, Taiwan, specializing in this espresso blends as well as a selection of single-origin coffees, custom-brewed at customer request. Visit www.rufouscoffee.blogspot.com for more information.",
        "bottom_line": null,
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Not disclosed.",
        "roast level": "Medium",
        "agtron": "51/62",
        "est. price": "NTD $500/220 grams",
        "review date": "June 2015",
        "aroma": "8",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/hummingbird-espresso/",
        "acidity/structure": null,
        "with milk": "9"
    },
    {
        "rating": "95",
        "roaster": "Cozy House Coffee",
        "title": "British Style Espresso Blend",
        "blind_assessment": "Evaluated as espresso. Juicy, richly sweet-tart. Pomegranate, dark chocolate, amber, almond butter, pomelo in aroma and small cup. Very syrupy mouthfeel; long, lingering, flavor-saturated finish. The tart-leaning structure stands up in cappuccino-scaled milk without sacrificing rich dark chocolate notes.",
        "notes": "A blend of coffees from Panama, Honduras and Ethiopia roasted for espresso applications. Cozy House Coffee is a Taiwan-based specialty coffee roaster and an SCA Authorized Trainer (AST). For more information, visit https://shop.cozyhousecoffee.com.",
        "bottom_line": "Juicy, tart and chocolaty in both the straight shot and in milk — balanced, vibrant, compellingly harmonious.",
        "roaster location": "Taipei City, Taiwan",
        "coffee origin": "Panama; Honduras; Ethiopia",
        "roast level": "Medium",
        "agtron": "50/64",
        "est. price": "NT $500/227 grams",
        "review date": "April 2022",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/british-style-espresso-blend/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Yo el Rey Roasting",
        "title": "FTO Ethiopia Worka 3 Special Reserve",
        "blind_assessment": "Rich, sweet, intense. Brandy, mint, cherry, dark chocolate in aroma and cup. Round, balanced acidity; full, syrupy mouthfeel. Chocolate in particular persists in a sweet-toned finish.",
        "notes": "This coffee is certified organically grown and Fair Trade certified, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. It is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Worka is one of twenty-three primary cooperatives located in the Gedeo Zone of Southern Ethiopia that are organized as the Yirgacheffe Farmers Union. Yo el Rey Roasting is a retail coffee shop with an in-house roaster located in California's Napa Valley. Yo el Rey (\"I the King\"?) roasts only organic and Fair Trade certified coffees. Visit www.yoelrey.com or call 707-942-1180 for more information.",
        "bottom_line": null,
        "roaster location": "Calistoga, California",
        "coffee origin": "Gedeo Zone, Yirgacheffe growing region, southern Ethiopia.",
        "roast level": "Medium",
        "agtron": "53/68",
        "est. price": "$21.50/16 ounces",
        "review date": "November 2013",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/fto-ethiopia-worka-3-special-reserve/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Dante Coffee",
        "title": "D31 The New Life",
        "blind_assessment": "Evaluated as espresso. Assertively sweet, fruity, spicy. Ripe banana, baking chocolate, allspice, lemon drop, dried lavender and narcissus in aroma and small cup. The mouthfeel is syrupy though drying, the finish rich-toned though rather drying and heavyish in the long. In three-parts milk the coffee balances nicely, with high-toned sweetness and florals showing with pleasing clarity.",
        "notes": "This is a blend of wet-processed Ethiopia Sidamo and washed and wet-hulled Sumatra Mandheling. Founded in 1993, Dante Coffee now has 120 coffee shops shops in Taiwan, 20 in Indonesia, five in Kuwait, and one in Saudi Arabia. The company aims to provide customers with the highest-quality coffee and meals at affordable prices. Visit http://www.dante.com.tw for more information.",
        "bottom_line": "An undeniably powerful espresso, and an interesting and engaging interpretation of the ancient Mocha-Java blend concept, combining fruit and flowers from an Ethiopia/Yemen coffee with rich spice and sweet depth from an Indonesia.",
        "roaster location": "Taipei City, Taiwan",
        "coffee origin": "Ethiopia; Sumatra",
        "roast level": "Medium-Light",
        "agtron": "54/69",
        "est. price": "NTD $300/200 grams",
        "review date": "September 2019",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/d31-the-new-life/",
        "acidity/structure": null,
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "Paradise Roasters",
        "title": "Ethiopia Awassa",
        "blind_assessment": "Deeply rich, sweet-toned. Jasmine, dried mango, sandalwood, orange zest, chocolate fudge in aroma and cup. Gentle, crisp acidity; full, satiny mouthfeel. The finish consolidates to dried mango and cocoa-toned sandalwood notes.",
        "notes": "Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Paradise Roasters specializes in micro-lot coffees and espressos from Hawaii and other premier coffee growing regions. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "A pretty washed-process Ethiopia coffee characterized by dried fruit and chocolate notes throughout.",
        "roaster location": "Ramsey, Minnesota",
        "coffee origin": "Yirgacheffe, Ethiopia; Sidamo (also Sidama), Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "56/76",
        "est. price": "$17.95/12 ounces",
        "review date": "October 2016",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-awassa-2/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Theory Coffee Roasters",
        "title": "Panama Geisha Finca Debra Echo",
        "blind_assessment": "High-toned, richly bittersweet. Pomelo, raspberry, cocoa nib, limoncello, a hint of sage in aroma and cup. Bittersweet structure with juicy acidity; crisp, syrupy mouthfeel. The resonant finish leads with notes of pomelo and sage, rounding to cocoa nib in the long.",
        "notes": "Produced by Jamison Savage of Finca Debra entirely of the Geisha variety of Arabica, and processed by an experimental method described as “cascara-infused washed carbonic maceration,” in which the coffee fruit is first pulped, leaving some flesh on the seed, then fermented in CO2-infused tanks along with cascara (the skin and pulp of the coffee fruit). Theory Coffee Roasters is a specialty roaster and coffee shop based in Redding, California. Visit www.theorycoffee.com for more information.",
        "bottom_line": "A complex, multi-layered experimentally processed Geisha cup with focused fruit supported by crisp cocoa notes.",
        "roaster location": "Redding, California",
        "coffee origin": "Volcan growing region, western Panama",
        "roast level": "Light",
        "agtron": "64/80",
        "est. price": "$40.00/200 grams",
        "review date": "November 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/panama-geisha-finca-debra-echo/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Panorama Coffee",
        "title": "Indonesia Sumatra “Blue Bianca” Dolok Sanggul",
        "blind_assessment": "Sweetly tart, elegantly earthy. Dark chocolate, fresh humus, ripe passionfruit, moist pipe tobacco, hazelnut in aroma and cup. Brisk, sweet acidity; full, syrupy mouthfeel. The tartly sweet finish calls up earthy chocolate and nut-toned fruit in the short, rounding to a chocolaty tobacco in the long.",
        "notes": "Produced by smallholding farmers from the Onang Ganjang cultivar, a cross between the Hibrido de Timor and Ateng varieties of Arabica. Coffees from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet-hulling.” This is a refined example of the type. This coffee tied for the second-highest rating in a cupping of Sumatra coffees for Coffee Review‘s July 2016 tasting report. Panorama Coffee is a specialty roaster based in Sydney, Australia. The company is built around the simple principle of finding and roasting distinct coffees of character to share and enjoy with its café customers. As a business, Panorama believes passionately in building and maintaining close relationships with customers, suppliers and community. For more information, email [email protected].",
        "bottom_line": "Inviting earthy, wet fallen-leaf notes combined with tropical fruit and deep chocolate suggestions generate a classic wet-hulled Sumatra cup.",
        "roaster location": "Sydney, Australia",
        "coffee origin": "Dolok Sanggul, Lintong growing region, northern Sumatra, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "54/73",
        "est. price": "AUD $15.00/250 grams",
        "review date": "July 2016",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/indonesia-sumatra-blue-bianca-dolok-sanggul/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Kakalove Cafe",
        "title": "Peru Natural Jose Herrera Lot 21",
        "blind_assessment": "Richly fruit-toned, chocolaty. Dried raspberry, dark chocolate, sandalwood, almond, freesia-like flowers in aroma and cup. Sweetly tart in structure with round, gentle acidity; full, syrupy mouthfeel. Fruit- and chocolate-centered in the finish as well, with pretty freesia notes.",
        "notes": "Produced by Graciano Cruz of the Typica and Caturra varieties of Arabica and processed by the dry or natural method. Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.",
        "bottom_line": "A heady coffee with clean, confident fruit notes throughout, supported by deep chocolate and spice-toned florals.",
        "roaster location": "Chia-Yi, Taiwan",
        "coffee origin": "Cajamarca, Peru",
        "roast level": "Medium-Light",
        "agtron": "54/78",
        "est. price": "NT $260/8 ounces",
        "review date": "June 2019",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/peru-natural-jose-herrera-lot-21/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "85",
        "roaster": "World Cup Roasters",
        "title": "Jungle Java",
        "blind_assessment": "Cleanly smoky and rather richly roasty, complicated by shimmers of sweetly tart, high-toned fruit - pineapple perhaps.",
        "notes": "World Cup Roasters is a premium small-batch roaster, retailer and office service supplier founded in 1993. Visit www.worldcupcoffee.com or call 503-228-5503 for more information.",
        "bottom_line": null,
        "roaster location": "Portland, Oregon",
        "coffee origin": "Not disclosed",
        "roast level": "Very Dark",
        "agtron": "30/36",
        "est. price": null,
        "review date": "February 2004",
        "aroma": "7",
        "acidity": "6",
        "body": "7",
        "flavor": "7",
        "aftertaste": null,
        "url": "https://www.coffeereview.com/review/jungle-java/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "89",
        "roaster": "ChacolaTAY",
        "title": "Kenya Kangocho",
        "blind_assessment": "Very sweet but quite tart, on the edge of sour, with an underlying savory hint. Aroma and flavor notes suggest green apple, molasses, plum, cocoa, agave syrup. Full, smooth mouthfeel. The sweet tendency prevails in an agreeable finish.",
        "notes": "ChacolaTAY is a Taiwanese small-batch roaster aiming to maximize cup character of elite green coffees through flexible, precise artisan roasting. Visit http://chacolatay.com or call 886-04-22038685 for more information.",
        "bottom_line": null,
        "roaster location": "Taichung City, Taiwan",
        "coffee origin": "Nyeri County, Kenya",
        "roast level": "Medium-Light",
        "agtron": "56/73",
        "est. price": "Not Available",
        "review date": "April 2012",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-kangocho/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Big Shoulders Coffee",
        "title": "Burundi Buhorwa",
        "blind_assessment": "Elegant, bright, very sweetly pungent. Starfruit, frankincense, lime zest, roasted cacao nib, narcissus in aroma and cup. Richly sweet in structure with balanced, vivacious acidity. Delicate, silky mouthfeel. The floral-toned finish starts and ends with notes of narcissus, punctuated by starfruit, cacao nib and bittersweet citrus suggesting lime zest, all enveloped in perfumy aromatic wood redolent of frankincense.",
        "notes": "This exceptional coffee was selected as the No. 23 coffee on Coffee Review’s list of the Top 30 Coffees of 2018. Burundi is a small, landlocked country in Central Africa. Most coffee is grown in the mountains of the north, bordering Rwanda. Benefiting from ideal growing conditions and large plantings of Bourbon and related heirloom varieties of Arabica, Burundi coffee has an excellent reputation and a growing following among North American specialty roasters. Big Shoulders Coffee is a Chicago artisan roaster that emphasizes a fresh-roasted, no-nonsense approach to fine coffee. Visit www.bigshoulderscoffee.com or call 312-846-1439 for more information.",
        "bottom_line": "A deeply pleasing coffee from Burundi: rich, profoundly sweet throughout, and complexly layered with fruit, floral and aromatic wood notes.",
        "roaster location": "Chicago, Illinois",
        "coffee origin": "Northern Burundi",
        "roast level": "Medium-Light",
        "agtron": "54/78",
        "est. price": "$15.00/12 ounces",
        "review date": "March 2018",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/burundi-buhorwa-2/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "89",
        "roaster": "Cup to Cup Coffee Roasters",
        "title": "Guatemala Huehuetenango",
        "blind_assessment": "Aromas of cocoa, aromatic wood and butter complicated by hints of nut and baking spices. In the cup gentle yet sustained acidity, round balance and cherry-like fruit and chocolate notes, with the cherry becoming particularly explicit as the cup cools. In the finish the chocolate turns bittersweet under the influence of a mild astringency.",
        "notes": "This coffee is Certified Fair Trade, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Produced by CODECH (Coordinadora de Organizaciones de Desarrollo de Concepcion Huista) an organization composed of four coffee producing groups in the admired Huehuetenango growing region. With the motto, \"Where one cup leads to another,\" Cup to Cup Coffee Roasters is a small coffee roasting company dedicated to providing fresh roasted coffee beans to the people of the Savannah area. Visit www.cuptocupcoffee.com or call 912-856-5866 for more information.",
        "bottom_line": null,
        "roaster location": "Savannah, Georgia",
        "coffee origin": "Huehuetenango growing region, Guatemala.",
        "roast level": "Medium-Dark",
        "agtron": "38/49",
        "est. price": "$6.00/8 oz.",
        "review date": "June 2010",
        "aroma": "8",
        "acidity": "8",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/guatemala-huehuetenango-7/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Boca Java Gourmet Coffee & Tea",
        "title": "Cool Breeze Colombian",
        "blind_assessment": "Delicately complex, high-toned aromatics are the glory here. Giddily fruity aroma, with distinct vanilla notes and suggestions of white wine, custardy caramel, flowers, chocolate. In the cup delicate and very sweet, with continuing floral, wine (Riesling) and semi-sweet chocolate notes. The floral delicacy carries into the slightly astringent finish. Too delicate for this world: loses some of its refreshing complexity as the cup cools.",
        "notes": "A Supremo grade Colombia, the highest grade by bean size. Boca Java is a small-batch, custom retail/wholesale roaster that roast-dates its coffees and emphasizes freshness and quality. Visit www.bocajava.com or call 888-262-2528 for more information.",
        "bottom_line": null,
        "roaster location": "Jacksonville, Florida",
        "coffee origin": "Colombia",
        "roast level": "Medium",
        "agtron": "50/66",
        "est. price": null,
        "review date": "February 2006",
        "aroma": "9",
        "acidity": "7",
        "body": "7",
        "flavor": "8",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/cool-breeze-colombian/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "Monarch Coffee",
        "title": "Monarch Estate Pacamara",
        "blind_assessment": "Richly sweet-savory, complex, layered. Dark chocolate, lilac, candycap mushroom, cedar, black cherry in aroma and cup. Sweetly tart structure with bright, juicy acidity; very full, creamy mouthfeel. The resonant finish consolidates to notes of cocoa-toned lilac and black cherry.",
        "notes": "Produced by the Stille family entirely of the big-beaned Pacamara variety of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Monarch Coffee is an award-winning coffee farm and specialty roaster of 100% estate-grown Kona coffee on the Big Island of Hawai’i. Visit www.monarchcoffee.com for more information.",
        "bottom_line": "A nuanced Kona Pacamara cup with deep-toned stone fruit, dark chocolate and sweet floral notes and an umami undercurrent suggesting candycap mushroom.",
        "roaster location": "Holualoa, Hawai’i",
        "coffee origin": "Holualoa, North Kona growing district, “Big Island” of Hawai’i",
        "roast level": "Medium-Light",
        "agtron": "60/80",
        "est. price": "$40.95/4 ounces",
        "review date": "February 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/monarch-estate-pacamara/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "JBC Coffee Roasters",
        "title": "Rwanda Bufcafe",
        "blind_assessment": "Intense, bright, floral. Flowers, pear, apricot, hints of honey and cocoa in aroma and cup. Rich, forceful but balanced acidity; lightly syrupy mouthfeel. Fruit notes in particular carry into a long, resonant finish.",
        "notes": "Rwanda's impressive potential as fine coffee producer has come to fruition over the last several years owing to the industry of its growers, generous support from international aid agencies and the commitment of North American specialty coffee roasters. JBC Coffee Roasters (formerly Johnson Brothers Coffee Roasters) is a distinguished small-batch roasting company. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": null,
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Rwanda",
        "roast level": "Medium-Light",
        "agtron": "56/69",
        "est. price": "$12.99/12 ounces",
        "review date": "May 2012",
        "aroma": "8",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/rwanda-bufcafe-4/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Bargain Cafe",
        "title": "Costa Rica Flor Lichi Meet Patch",
        "blind_assessment": "Fruit-toned, sweetly tart. Dried, persimmon, baking chocolate, nutmeg, tangerine, lemon balm in aroma and cup. Juicy, bright acidity; crisp, satiny mouthfeel. The finish leads with notes of baking chocolate and tangerine.",
        "notes": "Produced at Finca La Loma, entirely of the Caturra variety of Arabica, and processed by the anaerobic natural method (fermented in an oxygen-free environment, then dried in the whole fruit). Bargain Cafe is a specialty coffee roaster in Taitung, Taiwan. Visit shopee.tw/iamjiter for more information.",
        "bottom_line": "A fruity, balanced Costa Rica natural with crisp chocolate notes throughout and especially lively acidity.",
        "roaster location": "Taitung, Taiwan",
        "coffee origin": "Tarrazu, Costa Rica",
        "roast level": "Light",
        "agtron": "62/80",
        "est. price": "NT$ 499/200 grams",
        "review date": "December 2023",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/costa-rica-flor-lichi-meet-patch/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Willoughby's Coffee & Tea",
        "title": "Ethiopia Gelgelu Natural Organic",
        "blind_assessment": "High-toned, floral. Dried apricot, magnolia, almond butter, maple syrup, cherry brandy in aroma and cup. Crisp, sweetly-tart in structure; plush, syrupy mouthfeel. Notes of magnolia and dried apricot dominate in the flavor-laden short finish, with hints of almond butter and fruit brandy in the long.",
        "notes": "This coffee tied for the second-highest rating in a tasting of 71 organic-certified coffees from Africa for Coffee Review’s November 2017 tasting report. Southern Ethiopia coffees like this one are produced from traditional Ethiopian varieties of Arabica long grown in the region. This is a dry-processed or “natural” Yirgacheffe, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Certified USDA organic. Willoughby’s Coffee & Tea is a pioneer specialty coffee roaster established in the early 1980s that has gracefully and successfully moved with the times and now offers a menu of extremely refined small-lot, single-origin coffees. Visit www.willoughbyscoffee.com or call 800-388-8400 for more information.",
        "bottom_line": "A deeply sweet natural-processed Ethiopia cup, with stone fruit and brandy notes as parallel throughlines.",
        "roaster location": "Branford, Connecticut",
        "coffee origin": "Yirgacheffe growing region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "54/75",
        "est. price": "$17.99/16 ounces",
        "review date": "November 2017",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-gelgelu-natural-organic/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Lina Premium Coffee",
        "title": "Estate Finca La Lina",
        "blind_assessment": "Sweetly nut-toned. Roasted almond, date, baking chocolate, lily, fir in aroma and cup. Sweet structure with brisk acidity; velvety-smooth mouthfeel. Pleasing nut tones supported by notes of aromatic wood animate the gently drying finish.",
        "notes": "Produced at El Retiro Farm and processed by the washed method. Lina Premium Coffee is a Bogota-based specialty coffee roaster that works with and supports Colombian farms and farmers. Visit www.linapremiumcoffee.com for more information.",
        "bottom_line": "A friendly, easy-drinking Colombia cup with crisp chocolate and sweet nut  throughout.",
        "roaster location": "Bogota, Colombia",
        "coffee origin": "Risaralda Department, Colombia",
        "roast level": "Medium-Light",
        "agtron": "52/70",
        "est. price": "$15.75/12 ounces",
        "review date": "March 2021",
        "aroma": "8",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/estate-finca-la-lina/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Paradise Roasters",
        "title": "Congo Natural",
        "blind_assessment": "Sweetly spice-toned. Grapefruit zest, almond paste, baked pear, cardamom, faint azalea-like flowers in aroma and cup. Fruit-toned, bittersweet acidity; full, creamy mouthfeel. The finish consolidates to nut-toned cardamom with hints of flowers.",
        "notes": "Produced entirely from trees of the Bourbon variety of Arabica. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Certified organically grown. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "A crisp, spice-framed Congo natural with suggestions of rich almond notes throughout the profile.",
        "roaster location": "Ramsey, Minnesota",
        "coffee origin": "Kalehe, South Kivu Province, Democratic Republic of the Congo",
        "roast level": "Medium-Light",
        "agtron": "60/78",
        "est. price": "$16.95/12 ounces",
        "review date": "August 2017",
        "aroma": "8",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/congo-natural/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "95",
        "roaster": "Wishingvine",
        "title": "Colombia Honey Sweet Rose",
        "blind_assessment": "Delicate, very nuanced. Lilac, bergamot, cocoa nib, cedar, wild honey in aroma and cup. Richly sweet structure with bright, balanced acidity; plush, silky mouthfeel. Long, rich, floral-toned finish.",
        "notes": "Produced at Finca La Zulia, entirely of the Castillo variety of Arabica, and processed by the honey method, in which some of the fruit flesh is left on the beans during the drying process. Wishingvine is a Taichung, Taiwan specialty coffee roaster. Visit wishingvinecoffee.com for more information.",
        "bottom_line": "Elegant and complex, this floral-toned natural-processed Ethiopia is richly sweet, deeply floral and citrusy.",
        "roaster location": "Taichung, Taiwan",
        "coffee origin": "Huila Department, Colombia",
        "roast level": "Light",
        "agtron": "62/80",
        "est. price": "NT$ 520/8 ounces",
        "review date": "November 2023",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/colombia-honey-sweet-rose/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Conscious Cup Coffee Roasters",
        "title": "Ethiopia Guji Goro Bedessa",
        "blind_assessment": "Rich-toned, crisply sweet. Apricot, honeysuckle, cocoa nib, fresh-cut oak, maple syrup in aroma and cup. Sweet-tart structure with bright, juicy acidity; lightly satiny mouthfeel. Cocoa-driven finish with undertones of maple syrup.",
        "notes": "Guji is a coffee-growing region nestled next to Ethiopia's Yirgacheffe and Sidamo regions. This lot is processed by the wet or washed method (fruit skin and pulp are removed before drying). Conscious Cup Coffee Roasters is an independent and family-owned and -operated cafe and coffee roaster specializing in socially and environmentally sustainable coffees. Visit www.consciouscup.com or call 815-356-0115 for more information.",
        "bottom_line": "A comfortingly familiar washed Ethiopia cup: juicy-bright with leading notes of stone fruit and cocoa nib.",
        "roaster location": "Crystal Lake, Illinois",
        "coffee origin": "Guji Zone, Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "60/77",
        "est. price": "$24.00/12 ounces",
        "review date": "January 2022",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-guji-goro-bedessa/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Barrington Coffee Roasting Co.",
        "title": "Kenya AA Ruiru Mills Estate",
        "blind_assessment": "Rich, complex, savory sweet. Caramel, lemon, molasses, hints of apricot and rose-like flowers in aroma and cup. Crisply tart acidity; silky mouthfeel. Flavor carries into a rich though drying finish.",
        "notes": "Despite grower discontent and loss of prime growing terrain to urban development, Kenya continues to produce some of the world's most elegant and distinctive coffees. AA is the highest grade of Kenya coffee based mainly on bean size. Barrington Coffee is an artisan roaster dedicated to elite coffees, fresh delivery and roasting that foregrounds the coffee and not the roast. Visit www.barringtoncoffee.com or call 800-528-0998 for more information.",
        "bottom_line": null,
        "roaster location": "Lee, Massachusetts",
        "coffee origin": "Ruiru growing region, central Kenya.",
        "roast level": "Medium-Light",
        "agtron": "54/68",
        "est. price": "$19.95/16 ounces",
        "review date": "April 2012",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-aa-ruiru-mills-estate/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "95",
        "roaster": "Green Stone Coffee",
        "title": "Sweet Kenya J36 Espresso",
        "blind_assessment": "Evaluated as espresso. Complex, vibrant, richly nuanced. Toffee, pomegranate, dark chocolate, star jasmine, marjoram in aroma and small cup. Very viscous, syrupy-smooth mouthfeel; resonant, long, flavor-saturated finish. Integrated and harmonious in three parts milk, with pomegranate and dark chocolate framing deep suggestions of star jasmine.",
        "notes": "Despite grower discontent, unclear government coffee policy and urban encroachment on prime coffee lands, the famed Kenya cooperatives continue to produce some of the world's most elegant and distinctive coffees. Green Stone Coffee is a woman-owned artisan roastery in Taipei, Taiwan founded in 2016 and specializing in sourcing distinctive coffees that express their individual terroirs. Visit www.greenstone-coffee.com.tw for more information.",
        "bottom_line": "A single-origin Kenya espresso that has a trifecta of balanced fruit, chocolate, and spice-toned floral notes. Equally complex in the straight shot and in three parts milk.",
        "roaster location": "Taipei, Taiwan",
        "coffee origin": "Nyeri growing region, south-central Kenya",
        "roast level": "Medium-Light",
        "agtron": "52/76",
        "est. price": "NT $400/120 grams",
        "review date": "November 2021",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/sweet-kenya-j36-espresso/",
        "acidity/structure": null,
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "Caribou Coffee",
        "title": "Kathakwa Kenya",
        "blind_assessment": "Deep, boldly pungent. Crisp black currant, lush night-blooming flowers, oak, a buttery hint of dark chocolate in aroma and cup. Rich acidity; lightly syrupy, lively mouthfeel. Dark chocolate and black currant in particular carry into a roundly resonant finish.",
        "notes": "Despite grower discontent, unclear government coffee policy and urban encroachment on prime coffee lands, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. This Kenya is Rainforest Alliance certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. It is an offering in Caribou Coffee’s Roastmaster Reserve series of exceptional, seasonally available coffees. Caribou Coffee is a retail roasting chain based in the upper Middle West whose rather irreverent motto \"Life is short. Stay awake for it\" belies a serious approach to coffee. Visit www.cariboucoffee.com or call 888-227-4268 for more information.",
        "bottom_line": null,
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Central Kenya.",
        "roast level": "Medium",
        "agtron": "52/66",
        "est. price": "$16.99/16 ounces",
        "review date": "August 2014",
        "aroma": "9",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kathakwa-kenya/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "63",
        "roaster": "Nescafe",
        "title": "Taster’s Choice House Blend (Instant Coffee)",
        "blind_assessment": "Evaluated at proportions of 5 grams of instant coffee powder mixed with 8.5 ounces (250 ml) of hot water. Flat, salty, expressionless. Salted graham cracker, a faint vegetal note in aroma and cup. Sweet-salty-acrid in structure. Flat, lifeless mouthfeel. Rounds and sweetens just a bit in the finish.",
        "notes": "This coffee was reviewed in the “supermarket” category in a tasting of soluble or “instant” coffees for Coffee Review’s September 2018 tasting report. Contains coffee of the robusta species. Taster’s Choice is a brand of the Nestlé company. Visit www.nescafeusa.com for more information.",
        "bottom_line": "Not a pleasant experience.",
        "roaster location": "Glendale, California",
        "coffee origin": "Not disclosed",
        "roast level": "Light",
        "agtron": "NA/NA",
        "est. price": "$9.99/7 ounces (198 grams)",
        "review date": "September 2018",
        "aroma": "2",
        "acidity": null,
        "body": "5",
        "flavor": "2",
        "aftertaste": "3",
        "url": "https://www.coffeereview.com/review/tasters-choice-house-blend-instant-coffee/",
        "acidity/structure": "1",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "JBC Coffee Roasters",
        "title": "Gaitania Espresso",
        "blind_assessment": "Evaluated as espresso. Roundly and sweetly tart/pungent. Baker’s chocolate, almond, cedar, tangerine zest, wisteria-like flowers in aroma and small cup. Syrupy, full mouthfeel. Flavor consolidates in a rather dry though pleasingly chocolate- and cedar-toned finish. Crisp in three-parts milk: dry chocolate and rich floral hints.",
        "notes": "Certified organically grown and produced by members of the the ASCI’SP cooperative from mixed varieties of Arabica. Processed by the conventional wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A tactful medium roast nicely develops crisp chocolate and subtle floral character in this intense, big-bodied single-origin espresso.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Gaitania, Tolima Department, west-central Colombia",
        "roast level": "Medium-Light",
        "agtron": "56/78",
        "est. price": "$15.75/12 ounces",
        "review date": "April 2018",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/gaitania-espresso/",
        "acidity/structure": null,
        "with milk": "8"
    },
    {
        "rating": "94",
        "roaster": "Namusairo Coffee",
        "title": "Juliette Red Ninety Plus Gesha Estate Panama",
        "blind_assessment": "Juicy, extravagant, deep. Strawberry, port wine, crisp cedar, flowers, vanilla-toned orange in aroma and cup. Sweetly tart, lively acidity; full, syrupy mouthfeel. Flavor consolidates but persists in a sweet, citrusy finish.",
        "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also spelled Geisha). With its elegantly elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world's most unique coffees. This is a dry-processed or \"natural\" version of the Gesha, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. This particular Gesha is produced on the Ninety Plus Gesha Estates. Namusairo is a boutique café and artisan roaster founded in Seoul, South Korea in 2002. Visit www.namusairo.com for more information.",
        "bottom_line": null,
        "roaster location": "Seoul, South Korea",
        "coffee origin": "Silla Del Pando, Volcan, Panama.",
        "roast level": "Medium-Light",
        "agtron": "53/72",
        "est. price": "KRW 35,000/100 grams",
        "review date": "October 2013",
        "aroma": "9",
        "acidity": "9",
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/juliette-red-ninety-plus-gesha-estate-panama/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Victrola Coffee Roasters",
        "title": "Ethiopia Yirgacheffe Kochere Grade 1 Espresso",
        "blind_assessment": "Evaluated as espresso. Ken (91) liked this bright, zesty espresso; his co-taster (92) liked it even better. Both admired the citrus and floral vivacity of the aroma and flavor. Ken and his co-taster both accepted the smooth though rather light mouthfeel as an appropriate complement to the lively aromatics; both enjoyed the emergence of a lower-toned fruit (fig, roasted cacao nib) in the finish. Ken found the sweet-citrus impact in three parts milk a bit more pleasing than his co-taster did, though the co-taster offered an apt descriptor for it: “key lime pie.”",
        "notes": "The Kochere District adjoins the Yirgacheffe coffee growing region in southern Ethiopia, famous for its distinctively floral- and fruit-toned coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe-style coffees like this one processed by the wet or washed method (fruit skin and pulp is removed before drying) typically express great aromatic complexity and intensity with a particular emphasis on citrus and floral notes. Victrola is a small-batch, hands-on roaster with a passionate commitment to quality and distinctiveness. Visit www.victrolacoffee.com or call 206-624-1725 for more information.",
        "bottom_line": null,
        "roaster location": "Seattle, Washington",
        "coffee origin": "Kochere District, southern Ethiopia.",
        "roast level": "Medium",
        "agtron": "53/68",
        "est. price": "$11.00/8 ounces",
        "review date": "May 2013",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-kochere-grade-1-espresso/",
        "acidity/structure": null,
        "with milk": "9"
    },
    {
        "rating": "93",
        "roaster": "Flight Coffee Co.",
        "title": "Sumatra Lintong Dolok Sanggul",
        "blind_assessment": "Molasses, fresh-cut fir, papaya, orange and baking spice, particularly thyme, in aroma and sweet-toned, very slightly savory-edged cup. Roundly bright, juicy acidity; lightly syrupy mouthfeel. Flavor consolidates but persists richly in a clean, deep finish.",
        "notes": "Coffees from the northern part of the Indonesian island of Sumatra are admired for their complex earth (spice in this case), fruit and aromatic wood notes that result largely from unorthodox fruit removal and drying practices collectively called wet hulling. This is a particularly refined version of the style. Flight Coffee Co. (formerly CQ Coffee Roasters) is a coffee-loving, quality-focused roasting company based in Bedford, New Hampshire.Visit www.flightcoffeeco.com or call 603-836-6228 for more information.",
        "bottom_line": null,
        "roaster location": "Bedford, New Hampshire",
        "coffee origin": "Dolok Sanggul, Lintong growing area, northern Sumatra, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "55/69",
        "est. price": "$14.50/12 ounces",
        "review date": "December 2013",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/sumatra-lintong-dolok-sanggul/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Mostra Coffee",
        "title": "Philippine Heritage Microlot",
        "blind_assessment": "Spice-toned, deeply chocolaty. Dark chocolate, baking spices, cashew butter, lily, molasses in aroma and cup. Crisply sweet with gentle, round acidity; plush, creamy mouthfeel. Quiet, nutty finish supported by notes of baking spices.",
        "notes": "This exceptional coffee was selected as the No. 24 coffee on Coffee Review’s list of the Top 30 Coffees of 2022. Produced by a small community of coffee growers at Sitio Naguey and processed by the washed method at Kalsada Mill. Mostra Coffee is a women-, minority-, veteran-, and immigrant-owned micro-roaster based in north county San Diego. For more information, visit www.mostracoffee.com.",
        "bottom_line": "A balanced, rich-toned, darker roasted coffee from smallholding farmers in The Philippines — chocolaty, floral, and driven by notes of baking spices.",
        "roaster location": "San Diego, California",
        "coffee origin": "Atok, Benguet, The Philippines",
        "roast level": "Medium",
        "agtron": "48/62",
        "est. price": "$27.50/12 ounces",
        "review date": "June 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/philippine-farmer-milled-lot/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "88",
        "roaster": "Intelligentsia Coffee",
        "title": "Honduras El Puente",
        "blind_assessment": "Smoky, cedar- and cherry-toned fruit in the aroma. In the cup round, rich, bittersweet, with a tart, cherryish chocolate - think pie cherries rolled in unsweetened chocolate - and a sweet, floral-toned acidity. The finish strikes me as slightly too astringent.",
        "notes": "A prize winner in the 2005 Honduras Cup of Excellence competition, where as a green (unroasted) coffee it placed second out of hundreds of entries, attracting a score of 92-plus from an international jury. Intelligentsia, under the leadership of coffee buyer Geoff Watts and president Doug Zell, has become a leading supporter and buyer of Cup of Excellence coffees. Visit www.intelligentsiacoffee.com or call 888-945-9786 for more information.",
        "bottom_line": null,
        "roaster location": "Chicago, Illinois",
        "coffee origin": "La Paz Department, Honduras",
        "roast level": "Medium",
        "agtron": "50/64",
        "est. price": null,
        "review date": "October 2005",
        "aroma": "8",
        "acidity": "7",
        "body": "8",
        "flavor": "7",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/honduras-el-puente-2/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Big Island Coffee Roasters",
        "title": "Hawaiian Harmony",
        "blind_assessment": "Evaluated as espresso. Richly chocolaty, gently spice-toned. Dark chocolate, clove, almond butter, pink grapefruit zest, date in aroma and small cup. Creamy-smooth mouthfeel; crisply chocolaty finish with undertones of pink grapefruit zest and clove. In cappuccino format, the perfect drink for baked goods with loads of butter and baking spices.",
        "notes": "A blend of Hawaiian coffees from the regions of Kona and Kaʻū, both on the Big Island. Big Island Coffee Roasters is an award-winning coffee roaster operated with hands-on passion by Kelleigh Stewart and Brandon von Damitz. Visit www.bigislandcoffeeroasters.com for more information.",
        "bottom_line": "In the straight shot, this all-Hawaiian espresso blend is richly chocolaty and bright, and in cappuccino format, it’s rich-toned and deeply sweet and smooth.",
        "roaster location": "Mountain View, Hawai’i",
        "coffee origin": "Kona and Kaʻū, Big Island of Hawai’i",
        "roast level": "Medium-Light",
        "agtron": "52/74",
        "est. price": "$19.00/4 ounces",
        "review date": "April 2024",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "8",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/hawaiian-harmony/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Cafe Grumpy",
        "title": "DR Congo Muungano",
        "blind_assessment": "Richly sweet-tart, earth-toned. Blood orange, pipe tobacco, roasted almond, rhododendron, baking chocolate in aroma and cup. Tart-leaning structure with crisp, green-apple-like (malic) acidity; deep, velvety mouthfeel. The richly drying finish consolidates to blood orange and pipe tobacco.",
        "notes": "This coffee tied for the fourth-highest rating in a cupping of “desert-island coffees” submitted by roasters for Coffee Review’s May 2020 tasting report. Muungano, the name of this cooperative, means “togetherness” in Swahili. One-third of the coop’s members are women, many of whom were widowed by war. Produced entirely from trees of strains of the Bourbon variety of Arabica and processed by the washed method (fruit skin and pulp are removed before drying). Certified organic. An integral part of New York’s coffee renaissance, Brooklyn-based Café Grumpy opened its first café in 2005 and has since expanded to 10 locations in New York, including a roasting facility, and one in Miami. Visit www.cafegrumpy.com or call 718-383-0748 for more information.",
        "bottom_line": "A complexly structured DR Congo cup with high-pitched acidity at one end and deep-dive tobacco notes at the other, nuanced by a throughline of vanilla-like florals.",
        "roaster location": "Brooklyn, New York",
        "coffee origin": "South Kivu, Democratic Republic of the Congo",
        "roast level": "Medium-Light",
        "agtron": "56/72",
        "est. price": "$20.00/12 ounces",
        "review date": "May 2020",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/dr-congo-muungano/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Temple Coffee and Tea",
        "title": "Kenya Rugeto Peaberry",
        "blind_assessment": "Richly sweet, spice-toned. Roasted cacao nib, tamarind, tangerine zest, freesia-like flowers, almond in aroma and cup. Sweet-tart structure with juicy acidity; crisp, satiny mouthfeel. Resonant finish centers on notes of cocoa-toned tamarind and freesia.",
        "notes": "Produced by the Rungeto Farmer's Co-operative Society from trees of the admired SL28 and SL34 varieties of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya and its dedicated cooperatives continue to produce some of the world’s most elegant and distinctive coffees. Temple Coffee is a quality-focused retail and wholesale specialty roaster active in Sacramento, California since 2005. Committed to sourcing, roasting and brewing the finest coffees, Temple features coffee from distinguished single estates and cooperatives around the world. Visit www.templecoffee.com or call 916-454-1282 for more information.",
        "bottom_line": "A balanced and engaging Kenya: high-toned with spicy floral and delicate cocoa notes.",
        "roaster location": "Sacramento, California",
        "coffee origin": "Kirinyaga District, south-central Kenya",
        "roast level": "Medium",
        "agtron": "47/64",
        "est. price": "$20.00/12 ounces",
        "review date": "December 2018",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/kenya-rugeto-peaberry/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "91",
        "roaster": "Drink Coffee Do Stuff",
        "title": "Ethiopia Sidama Bensa Bekele",
        "blind_assessment": "Crisply sweet, citrusy. Orange zest, cocoa powder, hazelnut, oak, maple syrup in aroma and cup. Sweet-toned structure with brisk acidity; delicate, silky mouthfeel. The gently drying finish centers on notes of cocoa-toned orange and hazelnut.",
        "notes": "Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian landrace varieties of Arabica long grown in their respective regions. This is a dry-processed or “natural” version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Drink Coffee Do Stuff operates a roastery in Truckee, California and a coffee shop in nearby Incline Village, Nevada. Visit www.drinkcoffeedostuff.com for more information.",
        "bottom_line": "A friendly, accessible natural Ethiopia cup, cleanly fruit- and cocoa-toned.",
        "roaster location": "Truckee, California",
        "coffee origin": "Sidamo (also Sidama) growing region, south-central Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "57/77",
        "est. price": "$21.00/12 ounces",
        "review date": "December 2020",
        "aroma": "8",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-sidama-bensa-bekele/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Reunion Coffee Roasters",
        "title": "Flagship Blend",
        "blind_assessment": "Crisply chocolaty, sweetly tart. Tangerine, baking chocolate, fir, cashew, agave syrup in aroma and cup. Briskly sweet acidity; velvety-smooth mouthfeel. Finish consolidates to notes of baking chocolate and fresh-cut fir.",
        "notes": "An undisclosed bend of Arabica coffees. Reunion Coffee Roasters is a B-Corp-certified specialty coffee roastery with a cafe in downtown Toronto. Visit www.reunioncoffeeroasters.com. for more information.",
        "bottom_line": "A blend balanced between chocolate and nut impulses, supported by rich aromatic wood notes.",
        "roaster location": "Oakville, Ontario, Canada",
        "coffee origin": "Not disclosed",
        "roast level": "Medium-Light",
        "agtron": "53/69",
        "est. price": "$18.00/12 ounces",
        "review date": "February 2024",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/flagship-blend/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "94",
        "roaster": "JBC Coffee Roasters",
        "title": "Tano Batak Sumatra",
        "blind_assessment": "Rich-toned, deeply and sweetly earthy. Chocolate fudge, white sage, blackberry, perique pipe tobacco, plumeria-like flowers in aroma and cup. Balanced, sweet-savory structure with vibrant, juicy acidity; delicate, satiny mouthfeel. The resonant, flavor-saturated finish displays notes of blackberry and tobacco in the short, plumeria and sage in the long, and deep chocolate throughout.",
        "notes": "This coffee was grown by indigenous Batak people, who have been involved in coffee production since the practice was brought to Sumatra by the Dutch in the late 19th century. Coffees from the northern part of the Indonesian island of Sumatra are admired for their complex aromatic wood and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet hulling.” This is a particularly refined example of the type. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.",
        "bottom_line": "A multi-layered Sumatra cup with berry and tropical flowers as primary notes, balanced with fine pipe tobacco, sweet herbs and rich chocolate.",
        "roaster location": "Madison, Wisconsin",
        "coffee origin": "Lintong growing region, North Sumatra Province, Indonesia",
        "roast level": "Medium-Light",
        "agtron": "58/75",
        "est. price": "$18.50/12 ounces",
        "review date": "July 2018",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/tano-batak-sumatra-5/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Social Coffee & Tea Company",
        "title": "Brazil Chapadao de Ferro Espresso",
        "blind_assessment": "Reviewed as espresso. Overall sweet-toned, deep, almost flawlessly balanced. Apricot, flowers, dark chocolate in the aroma. In the small cup medium-bodied, very smooth in mouthfeel, delicate but complex: flowers, orange, chocolate, a hint of tart coffee fruit. Very smooth finish. In two parts hot milk the orange-toned chocolate blooms richly.",
        "notes": "Processed by the traditional Brazilian natural or dry method, meaning the beans were dried with both skin and fruit still adhering to the bean. Chapadao de Ferro or \"Plateau of Iron\" no doubt received its name because of the local soil's rich mineral content. Based in the greater Toronto area, Social Coffee & Tea Company is dedicated to providing high-quality, fresh-roasted \"Glorious Coffees for the People.\" Visit www.socialcoffeecompany.com or call 866-515-5033 for more information.",
        "bottom_line": null,
        "roaster location": "Richmond Hill, Ontario, Canada",
        "coffee origin": "Near Patrocino, Cerrado growing region, Brazil",
        "roast level": "Medium",
        "agtron": "49/54",
        "est. price": "CAD $16 /12 oz.",
        "review date": "June 2010",
        "aroma": "8",
        "acidity": "8",
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/brazil-chapadao-de-ferro-espresso/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Souvenir Coffee",
        "title": "Ethiopia Guji Gerbicho Natural",
        "blind_assessment": "Crisply sweet, cleanly fruit-toned. Dried strawberry, cocoa nib, honeysuckle, agave syrup, cedar in aroma and cup. Sweetly tart structure with crisp, apple-like acidity; satiny-smooth mouthfeel. The quiet finish evokes dried strawberry and wood-framed honeysuckle.",
        "notes": "This coffee tied for the third-highest rating in a cupping of coffees submitted by North American roasters in business for two or fewer years for Coffee Review’s October 2019 tasting report. Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian varieties of Arabica long grown in the region. This is a dry-processed or “natural” version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Souvenir Coffee, based in Berkeley, California goes by the motto, “People first, then coffee.” Visit www.souvenir-coffee.com for more information.",
        "bottom_line": "A fruit-forward natural processed Ethiopia cup with ballast from rich cocoa and floral suggestions throughout the profile.",
        "roaster location": "Berkeley, California",
        "coffee origin": "Guji Zone, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "54/76",
        "est. price": "$16.00/12 ounces",
        "review date": "October 2019",
        "aroma": "9",
        "acidity": null,
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-guji-gerbicho-natural/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "87",
        "roaster": "Green Mountain Coffee",
        "title": "Sumatran Reserve Fair Trade Organic (K-Cup)",
        "blind_assessment": "(As brewed in a Keurig B60 single-serve brewing device using a \"K-Cup\" capsule at a cup volume of 5.25 ounces): Smoke and earth notes in the aroma are brightened by a hint of floral-toned vanilla. In the cup, low-toned acidity, substantial body, and continued smoke, earth and floral notes rounded by a quiet caramel sweetness.",
        "notes": "This coffee is certified organically grown and Fair Trade, meaning it was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Keurig brewing devices were among the first single-serve coffee brewers on the market. Keurig now offers three home models (www.keurig.com) with a wide range of coffees available in compatible \"K-Cup\" format. Green Mountain offers this particular coffee in an \"Extra Bold\" K-Cup, which means it contains more coffee than a normal K-Cup and brews a somewhat richer, heavier-bodied cup. Keurig/Green Mountain, formerly Green Mountain Coffee Roasters, pioneered single-serve capsule brewing in the United States with its Keurig brewing system, and remains one of the country’s leading large specialty roasters, offering a particularly wide-ranging variety of origins and roast styles. Visit www.GreenMountainCoffee.com or call 888-879-4627 for more information.",
        "bottom_line": null,
        "roaster location": "Waterbury, Vermont",
        "coffee origin": "Northern Sumatra",
        "roast level": "Very Dark",
        "agtron": "0/44",
        "est. price": null,
        "review date": "September 2006",
        "aroma": "7",
        "acidity": "7",
        "body": "8",
        "flavor": "8",
        "aftertaste": "7",
        "url": "https://www.coffeereview.com/review/sumatran-reserve-fair-trade-organic-k-cup/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "95",
        "roaster": "Paradise Roasters",
        "title": "Hawaii Ka‘ū Bourbon Anaerobic Natural",
        "blind_assessment": "Richly sweet-tart, floral and fruit-driven. Mango, cocoa nib, ginger blossom, lime zest, cedar in aroma and cup. Balanced, tart-leaning structure with vibrant, juicy acidity; lightly viscous, silky mouthfeel. Long, flavor-saturated finish centered around fruit and florals.",
        "notes": "100% Red Bourbon grown by Leo Norberte of JN Coffee Farm and processed by Miguel Meza employing a proprietary anaerobic natural process that involves inoculation with wine yeast strains. Paradise prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.",
        "bottom_line": "An anaerobic natural from the Big Island of Hawai’i that evokes the tropics with its rich fruit and floral tendencies — the bright, juicy acidity is a bonus.",
        "roaster location": "Minneapolis, Minnesota",
        "coffee origin": "Ka‘ū growing region, Big Island of Hawai’i",
        "roast level": "Medium-Light",
        "agtron": "57/74",
        "est. price": "$30.00/4 ounces",
        "review date": "July 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "9",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/hawaii-kau-bourbon-anaerobic-natural/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "93",
        "roaster": "Barrington Coffee Roasting Co.",
        "title": "Nekisse Ethiopia Sidama",
        "blind_assessment": "Delicate, complex, lively. Distinct honey and crisply sweet cacao-nib with lavender-like flowers and an herby hint, cilantro perhaps, in aroma and cup. Lively, floral-toned acidity; very light but silky mouthfeel. Lavender in particular carries into a quietly rich finish.",
        "notes": "Ninety Plus is a distinguished boutique exporter and importer of innovative small-lot coffees from Ethiopia and Panama. Grown near Neji in the Sidama/Sidamo growing region, this Ethiopian coffee is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Barrington Coffee is an artisan roaster dedicated to elite coffees, fresh delivery and roasting that foregrounds the coffee and not the roast. Visit www.barringtoncoffee.com or call 800-528-0998 for more information.",
        "bottom_line": null,
        "roaster location": "Lee, Massachusetts",
        "coffee origin": "Sidamo (also Sidama) growing region, southern Ethiopia.",
        "roast level": "Light",
        "agtron": "67/95",
        "est. price": "$28.95/12 ounces",
        "review date": "November 2013",
        "aroma": "9",
        "acidity": "9",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/nekisse-ethiopia-sidama/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "92",
        "roaster": "Ragamuffin Coffee Roasters",
        "title": "Ethiopia Kayon Mountain",
        "blind_assessment": "Sweetly pungent, fruit-forward. Dried raspberry, baker’s chocolate, fruit brandy, candied violet, fragrant sandalwood in aroma and cup. Round, fruit-toned acidity; crisp, satiny mouthfeel. The finish consolidates around rich-toned cocoa and sweet violet notes.",
        "notes": "Produced by Ato Esmael and his family at their estate farm in the Guji Zone, one of several areas in southern Ethiopia that produce distinctive coffees from traditional varieties of Arabica long grown there. This is a “natural” or dry-processed coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. This coffee tied for the third-highest rating in a cupping of coffees from roasting companies five-years-old or younger for Coffee Review‘s February 2017 tasting report. Ragamuffin Coffee Roasters, co-founded by roaster Shawn Pritchett in 2014 in a home garage, is now a brick-and-mortar roastery in Newbury Park, California. Visit www.ragamuffinroasters.com for more information.",
        "bottom_line": "A cocoa-and fruit-toned natural-processed Ethiopia with a pleasantly brandy-toned hint of sweet ferment.",
        "roaster location": "Newbury Park, California",
        "coffee origin": "Guji Zone, Oromia Region, southern Ethiopia",
        "roast level": "Medium-Light",
        "agtron": "54/74",
        "est. price": "$19.00/12 ounces",
        "review date": "February 2017",
        "aroma": "9",
        "acidity": "8",
        "body": "8",
        "flavor": "9",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/ethiopia-kayon-mountain/",
        "acidity/structure": null,
        "with milk": null
    },
    {
        "rating": "96",
        "roaster": "GK Coffee",
        "title": "Ecuador COE 1st place Arashi Typica Mejorado Washed",
        "blind_assessment": "Exceptionally balanced, high-toned. Pineapple, bergamot, cocoa nib, hazelnut, ginger flower in aroma and cup. Sweetly tart structure with cleanly fruity, vibrant acidity; very full, richly satiny mouthfeel. Crystalline finish that carries over all the aroma and flavor notes from the cup.",
        "notes": "This exceptional coffee was selected as the No. 8 coffee on Coffee Review’s list of the Top 30 Coffees of 2022. Produced by Abel Salinas Pacheco of Arashi Farm, entirely of the Typica Mejorado variety of Arabica, and processed by the traditional washed method (fruit skin and flesh are removed from the beans before they are dried). GK Coffee is a nano-roastery in Yilan, Taiwan that offers both retail and wholesale coffee. For more information, visit www.gkcoffee.com.tw or email [email protected].",
        "bottom_line": "Complex and harmonious, intriguing and enigmatic as it unfolds, this washed Ecuador cup — which took first place in the Cup of Excellence this harvest year — is worth seeking out for its bright, confident aromatics that are born out in the rich, multi-layered cup.",
        "roaster location": "Yilan, Taiwan",
        "coffee origin": "Saraguro, Loja, Ecuador",
        "roast level": "Light",
        "agtron": "62/80",
        "est. price": "NT $800/20 grams",
        "review date": "October 2022",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "10",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/ecuador-coe-1st-place-arashi-typica-mejorado-washed/",
        "acidity/structure": "9",
        "with milk": null
    },
    {
        "rating": "90",
        "roaster": "Lone Coffee",
        "title": "Peru Aproselva",
        "blind_assessment": "Richly sweet, chocolaty. Chocolate fudge, scorched cedar, Brazil nut, raisin, lily in aroma and cup. Sweet-toned structure with gentle, round acidity; full satiny mouthfeel. Finish centers around deep chocolate and smoky aromatic wood notes.",
        "notes": "Comprised of the Typica, Catimor, Bourbon, Caturra and Catuai varieties of Arabica and processed by the wet, or washed, method. Certified organic and Fair Trade. Lone Coffee is an Escondido, California-based specialty micro-roaster with an adjacent coffee shop, Kettle Coffee & Tea. Visit www.lonecoffee.com for more information.",
        "bottom_line": "A roast-toned, sweetly chocolaty Peru cup with dried fruit and floral notes throughout.",
        "roaster location": "Escondido, California",
        "coffee origin": "Junin, Peru",
        "roast level": "Medium",
        "agtron": "47/67",
        "est. price": "$15.00/12 ounces",
        "review date": "February 2020",
        "aroma": "8",
        "acidity": null,
        "body": "8",
        "flavor": "8",
        "aftertaste": "8",
        "url": "https://www.coffeereview.com/review/peru-aproselva/",
        "acidity/structure": "8",
        "with milk": null
    },
    {
        "rating": "96",
        "roaster": "Hula Daddy Kona Coffee",
        "title": "Laura’s Reserve SL34",
        "blind_assessment": "Harmoniously balanced, deep-toned, bright. Nectarine, cocoa nib, pink grapefruit zest, star jasmine, marjoram in aroma and cup. Richly sweet-savory structure with malic, apple-toned acidity; plush, syrupy-smooth mouthfeel. The satisfying finish carries over all the flavor notes from the cup.",
        "notes": "This exceptional coffee was selected as the No. 20 coffee on Coffee Review’s list of the Top 30 Coffees of 2021. SL28 and SL34 are varieties famous for producing the great classic coffees of Kenya. The trees that produce this particular coffee were formerly thought to consist of the SL28 variety, but have now been determined through genetic analysis to be SL34. It is a limited-edition coffee only available for sale through the allocation list on the Hula Daddy website. Hula Daddy is a boutique coffee producer with farms at the 1,400- and 2,500-foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm and processed with the fermentation step conducted “dry” (no water added to the tank) using commercial yeast. Visit www.huladaddy.com or call 808-327-9744 for more information.",
        "bottom_line": "A juicy, bright, inviting Kenya-esque Kona cup: balanced, intricate, complete.",
        "roaster location": "Holualoa, Hawai’i",
        "coffee origin": "Holualoa, North Kona growing district, “Big Island” of Hawai’i",
        "roast level": "Medium-Light",
        "agtron": "60/78",
        "est. price": "$62.95/8 ounces",
        "review date": "November 2021",
        "aroma": "9",
        "acidity": null,
        "body": "9",
        "flavor": "10",
        "aftertaste": "9",
        "url": "https://www.coffeereview.com/review/lauras-reserve-sl34-2/",
        "acidity/structure": "9",
        "with milk": null
    }
]