[{"rating":"91","roaster":"Roast House","title":"Guatemalan Batzchocola","blind_assessment":"Lushly pungent, plummy. Dark chocolate, plum, cedar, night-blooming flowers in aroma and cup. Round, resonant acidity; smooth, silky mouthfeel. Richly sweet though drying finish.","notes":"Batzchocola is one of four coffee-producing communities of mainly indigenous farmers that make up the Ixil A’achimbal association. The Batzchocola coffee is fermented without water for around twenty hours in wooden boxes covered with banana leaves, washed, and sun-dried on tables and tarps, a local variation on orthodox wet-processing, and one that seems to have a complex and positive impact on cup character. Roast House is a small-batch roaster based in Spokane Washington that considers relationships to be the most important aspect of great coffee, extending from farmers to the neighborhood barista. Visit www.organicroasthouse.com or call 509-996-6500 for more information.","bottom_line":null,"roaster location":"Spokane, Washington","coffee origin":"El Quiche Department, south central Guatemala","roast level":"Medium-Light","agtron":"52\/70","est. price":"$14.00\/16 ounces","review date":"September 2013","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/guatemalan-batzchocola\/","with milk":null,"acidity\/structure":null},{"rating":"87","roaster":"Apres Coffee","title":"Melange Francais","blind_assessment":"Crisply roasty in the aroma: gently scorched cedar, cardamom, with a softening hint of semi-sweet chocolate. In the cup lean but silky mouthfeel and a simple but properly robust impression of scorched cedar, spicy nut and a suggestion of dark chocolate. Finishes on the impressively rich side of astringent with good flavor persistence.","notes":"Melange Francais translates as French blend, apparently referencing the extreme dark-roasted coffees of northern France. Apres is a seller of gourmet teas, coffee and chocolate presented in impressively distinctive packaging at reasonable prices. Visit www.aprescafe.com or call 877-777-3451 for more information. Visit www.aprescafe.com or call 877-777-3451 for more information.","bottom_line":null,"roaster location":"Lancaster, Pennsylvania","coffee origin":"Not disclosed.","roast level":"Very Dark","agtron":"18\/24","est. price":null,"review date":"November 2007","aroma":"7","acidity":null,"body":"7","flavor":"7","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/melange-francais\/","with milk":null,"acidity\/structure":null},{"rating":"90","roaster":"Barefoot Coffee Roasters","title":"Sweetness! Espresso (Fair Trade\/Organic)","blind_assessment":"In the aroma distinct semi-sweet chocolate notes and cherryish or raisiny fruit with a lush twist of ferment. Crisp cedar and toast notes complicate the cherry-toned chocolate in the small cup. The fruity chocolate persists in the splendid short finish, though a shadow astringency barely implied in the cup eventually dominates in the long. In milk a slightly lean body is more than made up for by crisp toasted rice notes and a voluptuous, milk-softened version of the fruity-fermented chocolate.","notes":"The components of this blend are organically grown and certified Fair Trade, meaning they were purchased from small-holding farmers at a \"fair\" or economically sustainable price. Barefoot Coffee Roasters is an award-winning and widely recognized small-batch roasting company who describes itself as \"a happy little cafe and roastery in the heart of Silicon Valley.\" Visit www.barefootcoffeeroasters.com for more information.","bottom_line":null,"roaster location":"Santa Clara, California","coffee origin":"Ethiopia, Mexico","roast level":"Medium","agtron":"52\/66","est. price":null,"review date":"May 2006","aroma":"9","acidity":null,"body":"7","flavor":"8","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/sweetness-espresso-fair-tradeorganic\/","with milk":"9","acidity\/structure":null},{"rating":"92","roaster":"Lexington Coffee Roasters","title":"Kenya Gachombe","blind_assessment":"Richly pungent. Black currant, fresh-cut cedar, plum, dark chocolate and a hint of night-blooming flowers in aroma and cup. Crisp, dry acidity; lightly syrupy mouthfeel. Cedar and black currant in particular carry into a sweet though drying finish.","notes":"Gachombe is a cooperative of coffee farmers in the Nakura and Baringo region of Kenya’s rift valley. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world's most elegant and distinctive coffees. Founded in 1990, Lexington Coffee is an award-winning artisan roasting company based in Virginia. Lexington’s focus on fresh, flavorful and sustainable coffee is reflected in its motto, “Fresh, Flavorful & Fair.” Visit www.lexingtoncoffee.com or call 800-322-6505 for more information.","bottom_line":null,"roaster location":"Lexington, Virginia","coffee origin":"Baringo and Nakura Counties, central Kenya.","roast level":"Medium","agtron":"48\/62","est. price":"$18.95\/12 ounces","review date":"October 2013","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kenya-gachombe\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Kona Love Coffee Co.","title":"Kona Medium Roast","blind_assessment":"Richly sweet, deep-toned. Baking chocolate, hazelnut, date, magnolia, cedar in aroma and cup. Sweet in structure with brisk acidity; satiny mouthfeel. Chocolate-toned finish with undertones of hazelnut and cedar.","notes":"Kona Coffee Love Co. offers roasted coffees grown at Boranian Farms. Though not certified organic, Boranian actively cultivates its crops with regenerative agriculture methods like cover-cropping, growing nitrogen-fixing trees to coppice and mulch, making and implementing Korean natural farming solutions, using permaculture energy solutions, cooking compost, etc. Visit www.konalovecoffee.com for more information.","bottom_line":"A rich, chocolaty Kona cup with floral and nut tones, roasted to a darkish medium.","roaster location":"Holualoa, Hawaii","coffee origin":"Holualoa, North Kona, Big Island of Hawai’i","roast level":"Medium-Light","agtron":"52\/70","est. price":"$35.00\/12 ounces","review date":"October 2021","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kona-medium-roast\/","with milk":null,"acidity\/structure":"8"},{"rating":"92","roaster":"Temple Coffee Roasters","title":"Dharma Espresso Blend","blind_assessment":"Evaluated as espresso. Dark chocolate, magnolia, cedar, black cherry, lemon zest in aroma and small cup. Delicate, satiny mouthfeel; chocolaty, floral finish supported by aromatic wood notes. The milk shot is chocolate- and flower-driven.","notes":"A blend comprised of a wet-processed coffee from Brazil Terra Matas de Minas, a dried-in-the-fruit or “natural”-processed Ethiopia Sidamo and a honey-processed Costa Rica Sonora Estate Red Catuai. Temple Coffee is a quality-focused retail and wholesale specialty roaster active in Sacramento, California since 2005. Committed to sourcing, roasting and brewing the finest coffees, Temple features coffee from distinguished single estates and cooperatives around the world. Visit www.templecoffee.com or call 916-454-1282 for more information.","bottom_line":"A rich, deep espresso blend with a dark chocolate throughline; floral notes sing in three parts milk.","roaster location":"Sacramento, California","coffee origin":"Brazil; Ethiopia; Costa Rica","roast level":"Medium","agtron":"44\/70","est. price":"$16.50\/12 ounces","review date":"December 2020","aroma":"8","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/dharma-espresso-blend\/","with milk":"9","acidity\/structure":null},{"rating":"84","roaster":"Cafe Sunrise","title":"Finca Buenos Aires Medium Roast","blind_assessment":"In the aroma flat, rather woody, with low-toned fruit notes suggesting a sort of spicy banana. These odd but pleasant fruit notes persist in the rich though rather monotoned cup, which grows flatter and woodier as it cools. Medium body, clean, rich, rather pleasant finish.","notes":"Health angle: According to the bag copy, a patented \"Healthy Roast\" process retains \"100% of the antioxidants naturally occurring in the bean.\" A patent search discloses that the \"Healthy Roast\" process involves soaking the green beans in a liquid which preserves antioxidant polyphenols that may be lost during roasting. This antioxidant-charged liquid is then used to cool or quench the same beans after roasting, presumably restoring the antioxidants in the liquid to the roasted coffee. A single-estate coffee grown, roasted and packaged in Honduras. Visit www.cafesunrise.com for more information.","bottom_line":null,"roaster location":"Villanueva, Honduras","coffee origin":"Honduras","roast level":"Medium-Dark","agtron":"42\/53","est. price":null,"review date":"May 2005","aroma":"6","acidity":"6","body":"7","flavor":"7","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/finca-buenos-aires-medium-roast\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Paradise Roasters","title":"Costa Rica Coffea Diversa Washed Geisha","blind_assessment":"Delicately floral, spice-toned. Honeysuckle, apricot, bergamot, spearmint, cocoa nib in aroma and cup. Sweet structure with vibrant, elegant acidity; billowy, silky-smooth mouthfeel. Finish consolidates to cocoa-toned honeysuckle and bergamot.","notes":"Produced by Gonzalo Hernandez entirely of the celebrated Geisha variety of Arabica and processed by the washed method. Available as part of a Geisha sampler. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.","bottom_line":"A lovely Geisha grown in Costa Rica deftly roasted to highlight  bright fruit and sweet floral tones.","roaster location":"Minneapolis, Minnesota","coffee origin":"Biollet, Costa Rica","roast level":"Medium-Light","agtron":"54\/72","est. price":"$19.98\/4 ounces","review date":"August 2020","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/costa-rica-coffea-diversa-washed-geisha\/","with milk":null,"acidity\/structure":"9"},{"rating":"93","roaster":"Caribou Coffee","title":"Kathakwa Kenya","blind_assessment":"Deep, boldly pungent. Crisp black currant, lush night-blooming flowers, oak, a buttery hint of dark chocolate in aroma and cup. Rich acidity; lightly syrupy, lively mouthfeel. Dark chocolate and black currant in particular carry into a roundly resonant finish.","notes":"Despite grower discontent, unclear government coffee policy and urban encroachment on prime coffee lands, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. This Kenya is Rainforest Alliance certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. It is an offering in Caribou Coffee’s Roastmaster Reserve series of exceptional, seasonally available coffees. Caribou Coffee is a retail roasting chain based in the upper Middle West whose rather irreverent motto \"Life is short. Stay awake for it\" belies a serious approach to coffee. Visit www.cariboucoffee.com or call 888-227-4268 for more information.","bottom_line":null,"roaster location":"Minneapolis, Minnesota","coffee origin":"Central Kenya.","roast level":"Medium","agtron":"52\/66","est. price":"$16.99\/16 ounces","review date":"August 2014","aroma":"9","acidity":"8","body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kathakwa-kenya\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Victrola Coffee Roasters","title":"Kenya Thika Chania Estate Natural Process","blind_assessment":"Rich, brandy-like fruit dominates the profile: cherry, blueberry, cocoaish dark chocolate in aroma and cup. Round, fruit-influenced acidity; syrupy mouthfeel. Flavor carries richly into the finish, where a very slight over-ripe note emerges as the cup cools.","notes":"\"Natural\" process means the beans were dried inside the fruit rather than after removal of the fruit. This coffee consists entirely of the heirloom “French Missionary” Bourbon variety trees grown by the Harries family on the Chania Estate. Victrola is a small-batch, hands-on roaster with a passionate commitment to quality and distinctiveness. Visit www.victrolacoffee.com or call 206-624-1725 for more information.","bottom_line":null,"roaster location":"Seattle, Washington","coffee origin":"Thika growing region, central Kenya.","roast level":"Medium","agtron":"46\/63","est. price":"$15.50\/8 ounces","review date":"September 2011","aroma":"9","acidity":"8","body":"9","flavor":"9","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/kenya-thika-chania-estate-natural-process\/","with milk":null,"acidity\/structure":null},{"rating":"88","roaster":"Wood-Fire Roasted Coffee","title":"Sumatra Mandheling","blind_assessment":"Intense aroma in a narrow range: pungent rosemary-like herb notes, an orangy citrus, and some slightly charred wood notes. In the cup lean-bodied but forceful, dominated by a grapefruity pungency with a slight charred edge that with imagination reads as a semi-sweet chocolate. The chocolate is explicit, however, in the impressively sweet, long finish.","notes":"Mandheling is the traditional market name for an admired coffee type grown in the region around Lake Toba in north-central Sumatra. These coffees are marked by low acidity and idiosyncratic flavor notes that appear to result from serendipitous taints - mild ferment and mildew - acquired during unconventional drying procedures. The Wood-Fire Roasted Coffee Company roasts, of course, on a machine that uses oak wood as a heat source, which means its coffees are slow roasted, an approach that tends to reduce the sharper kinds of acidity. Visit www.woodfireroasted.com or call 775-865-2033 for more information.","bottom_line":null,"roaster location":"Reno, Nevada","coffee origin":"Mandheling growing region, northern Sumatra, Indonesia.","roast level":"Medium-Dark","agtron":"36\/46","est. price":null,"review date":"May 2007","aroma":"7","acidity":null,"body":"7","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/sumatra-mandheling-18\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Chocolate Fish Coffee Roasters","title":"Guatemala El Retiro del Quisaya","blind_assessment":"Delicately sweet and balanced with a subtle hint of fermented fruit. Peach, sweet chocolate, sandalwood, honeysuckle, almond in aroma and cup. Gently and sweetly bright in structure; light yet satiny in mouthfeel. Quiet but resonantly long finish: peach, chocolate, almond.","notes":"Produced by Juan Luis Barrios Ortega from trees of the Bourbon-derived Pache variety of Arabica. Processed by the dry or “natural” method, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Chocolate Fish is a distinguished New-Zealand-inspired micro-roaster based in Sacramento California, focused on the best in both quality and integrity.Visit www.chocolatefishcoffee.com or call 916-451-5181 for more information.","bottom_line":"Delicate and graceful, yet authoritative in character; seductively sweet.","roaster location":"Sacramento, California","coffee origin":"San Martin Jilotepeque, Chimaltenango Department, Guatemala","roast level":"Light","agtron":"71\/99","est. price":"$19.00\/12 ounces","review date":"November 2017","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/guatemala-el-retiro-del-quisaya\/","with milk":null,"acidity\/structure":"8"},{"rating":"84","roaster":"Café Mystique Coffee","title":"Mexican Mid\/Light Roast","blind_assessment":"Light, dryly fruity, complicated by pleasant cocoa tones. Simple, ingenuous, agreeable. Not sweet, but stays on the gentle side of bitter.","notes":"Light, dryly fruity, complicated by pleasant cocoa tones. Simple, ingenuous, agreeable. Not sweet, but stays on the gentle side of bitter. From one of the earliest cooperatives to market an organic coffee in North America. Now Fair-Trade Certified as well. As the French label copy has it, this coffee is \"Biologique, Polycultive Ecologique.\" Café Mystique is a small-batch roaster specializing","bottom_line":null,"roaster location":"Montreal, Quebec, Canada","coffee origin":null,"roast level":"NA","agtron":"\/","est. price":null,"review date":"September 2000","aroma":"7","acidity":"6","body":"6","flavor":"7","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/mexican-midlight-roast\/","with milk":null,"acidity\/structure":null},{"rating":"95","roaster":"Cafe Grumpy","title":"Kenya Gethembwini","blind_assessment":"Deeply sweet and deeply pungent with round, complexly rich Kenya fruit: grapefruit, black currant, strawberry, supported by an undercurrent of fresh-cut fir. Ringing, resonant acidity, syrupy mouthfeel, flavor-saturated finish.","notes":"Despite grower discontent and sporadic social disorder, Kenya continues to produce some of the world's most elegant and distinctive coffees. This lot was produced exclusively from trees of Kenya’s two premier varieties of Arabica, the Bourbon-related SL28 and SL34. An integral part of New York’s coffee renaissance, Brooklyn based Café Grumpy opened its first café in 2005 and has since expanded to four locations, including their own roasting facility. Visit www.cafegrumpy.com or call 718-349-7623 for more information.","bottom_line":null,"roaster location":"Brooklyn, New York","coffee origin":"South-central Kenya.","roast level":"Medium-Light","agtron":"57\/73","est. price":"$21.00\/12 ounces","review date":"June 2011","aroma":"8","acidity":"9","body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/kenya-gethembwini\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Fidalgo Bay Coffee","title":"Decaf Roastmaster’s Choice Espresso","blind_assessment":"A fine fruity-fermented style espresso in decaffeinated format. The sweet fermented fruit notes (I would guess from a dried-in-the-fruit East African green coffee component) read as blueberry with chocolate and ripe banana tones in both aroma and small cup. Excellent body, rich chocolate in the finish. A slight salty sensation that often accompanies fruity ferment hardly matters in the small cup, but seems to dampen sweetness in milk, where this exciting espresso doesn?t quite live up to its full chocolate-blueberry promise.","notes":"Fidalgo Bay is a wholesale and online retail specialty coffee roaster with a thoughtfully designed menu of coffees and a concise but effective personal roast profiling tool on its website. Visit www.fidalgobaycoffee.com or call 800-310-5540 for more information.","bottom_line":null,"roaster location":"Burlington, Washington","coffee origin":"Central America and Africa","roast level":"Medium","agtron":"45\/69","est. price":null,"review date":"March 2007","aroma":"9","acidity":null,"body":"8","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/decaf-roastmasters-choice-espresso\/","with milk":"7","acidity\/structure":null},{"rating":"94","roaster":"Big Island Coffee Roasters","title":"Kona Noir","blind_assessment":"Elegantly fruit-toned, gently spice-driven. Date, clove, blood orange, baking chocolate, cedar in aroma and cup. Complex bittersweet structure with winey acidity; plush, syrupy mouthfeel. The resonant finish is centered around notes of date, blood orange and clove.","notes":"Produced by Kraig Lee and Franck Carisey entirely of the SL34 variety of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried) with the addition of wine yeasts during fermentation. Big Island Coffee is an award-winning coffee roaster operated with hands-on passion by Kelleigh Stewart and Brandon von Damitz. Visit www.bigislandcoffeeroasters.com for more information.","bottom_line":"A distinctive Kona cup from the rare Kenya-derived SL34 variety of Arabica, worth seeking out for its confident fruit and nuanced spice notes.","roaster location":"Mountain View, Hawaii","coffee origin":"Holualoa, Kona, Big Island of Hawai’i","roast level":"Light","agtron":"62\/80","est. price":"$29.00\/4 ounces","review date":"September 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kona-noir\/","with milk":null,"acidity\/structure":"9"},{"rating":"92","roaster":"Bonlife Coffee","title":"Ethiopia Tswana","blind_assessment":"Bright, gently and lyrically complex. Honey, jasmine-like flowers, kiwi-like fruit, a crisp hint of roasted cacao nib. Delicately bright acidity; buoyant, lightly syrupy mouthfeel. Brisk, lightly flavor-saturated finish.","notes":"Produced from a mix of native Ethiopian heirloom varieties and brought into the U.S. by boutique exporter\/importer Ninety Plus Coffee. Bonlife Coffee is a quality-oriented small-batch coffee roaster located in Cleveland, Tennessee dedicated to the motto “Drink a Better Story.” Bonlife donates 1% of its sales to a variety of environmental programs through its membership in the “1% for the Planet” movement, as well as contributing to other coffee-associated organizations including Water Missions International and Coffee Kids. Visit www.bonlifecoffee.com or call 423-464-6160 for more information.","bottom_line":null,"roaster location":"Cleveland, Tennessee","coffee origin":"Southern Ethiopia.","roast level":"Medium-Light","agtron":"58\/79","est. price":"$14.95\/8 ounces","review date":"October 2013","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-tswana\/","with milk":null,"acidity\/structure":null},{"rating":"95","roaster":"Novo Coffee","title":"Aricha Selection Seven Ethiopia Yirgacheffe","blind_assessment":"No hints here: The aromatics are direct, inescapable, lavish. Lushly intense blueberry, chocolate, and floral-toned honey in the aroma. In the cup the incendiary aromatics are influenced by a wine-like acidity that turns the berry and chocolate notes crisp and richly dry. The fundamental berry and floral notes linger with surprising clarity in the finish, although they are outlasted by a slight but forgivable astringency.","notes":"Most southern Ethiopia coffee is prepared by removing the fruit from the beans or seeds before they are dried (wet-processing), which produces a cleanly high-toned, often intensely floral- and citrus-toned cup. This southern Ethiopia is a \"natural\" or dry-processed version, however, meaning the beans\/seeds were dried inside the fruit, producing a flavor profile that is lower-toned with a deep, wine-and berry-like fruit. Such high-quality dry-processed coffees from southern Ethiopia are a new development on the specialty coffee scene, substantially aided by younger enthusiasts like Novo Coffee's Joseph Brodsky, whose new small company NINE+Y PLUS specializes in collaborating with growers to develop and import exceptional small lots of such coffees. Novo Coffee itself is a quality-oriented boutique roasting company with fine coffees, an elegant package, and the slogan \"Get Closer\" - to coffee, as it turns out. Visit www.novocoffee.com or call 303-295-7678 for more information.","bottom_line":null,"roaster location":"Denver, Colorado","coffee origin":"Yirgacheffe growing district, southern Ethiopia.","roast level":"Light","agtron":"63\/86","est. price":null,"review date":"July 2007","aroma":"10","acidity":"8","body":"7","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/aricha-selection-seven-ethiopia-yirgacheffe\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Jackrabbit Java","title":"Uganda Organic Sipi Falls Honey","blind_assessment":"Deep-toned, richly sweet. Dark chocolate, hazelnut butter, golden raisin, carnation, cedar in aroma and cup. Balanced structure with gentle acidity; very full, syrupy mouthfeel. Sweetly nut-toned finish with gently spicy aromatic wood suggestions.","notes":"Certified USDA Organic. Produced in the Bugisu Region of Uganda near Mt. Elgon and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis, Wyoming’s mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.","bottom_line":"A chocolaty, nutty, deeply sweet Uganda cup with a particularly full, plush mouthfeel.","roaster location":"Thermopolis, Wyoming","coffee origin":"Sipi Falls, Bugisu Region, Uganda","roast level":"Medium-Light","agtron":"56\/74","est. price":"$18.00\/12 ounces","review date":"January 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/uganda-organic-sipi-falls-honey\/","with milk":null,"acidity\/structure":"8"},{"rating":"94","roaster":"Simon Hsieh's Aroma Roast Coffees","title":"Ecuador “Mama Kilya” Espresso","blind_assessment":"Evaluated as espresso. Profoundly floral-toned, delicately bright. Complex flowers (lilac, lily, honeysuckle), tangerine-like citrus, cedar, nut-toned chocolate in aroma and small cup. Lightish but velvety mouthfeel; chocolate and cedar in particular carry into a clean finish. In three parts milk delicate but authoritative: very sweet citrus, chocolate, flowers.","notes":"In addition to his retail roasting operation, Aroma Roast Coffees, Simon Hsieh also operates Soaring Phoenix Trading, a business focused on purposed-built commercial espresso blends and high quality single-origin coffees. Visit www.facebook.com\/4ArtsZeroDefectCoffees or call 886-0983-749876 for more information.","bottom_line":null,"roaster location":"Taoyuan City, Taiwan","coffee origin":"Ecuador.","roast level":"Medium-Dark","agtron":"44\/50","est. price":"NT $2,000\/16 ounces","review date":"September 2015","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ecuador-mama-kilya-espresso\/","with milk":"9","acidity\/structure":null},{"rating":"90","roaster":"BeanFruit Coffee Co.","title":"Costa Rica Finca El Llano","blind_assessment":"Sweet-toned, straightforward, some layered complexity. Raisiny dark chocolate, plum, orange zest, fresh-cut cedar, a hint of lily-like flowers in aroma and cup. Rich, rounded acidity; syrupy mouthfeel. Chocolate and orange in particular carry into a balanced finish.","notes":"Finca El Llano (short for Llano Bonito de Leon Cortes) is one of ten estates that make up the Don Mayo Beneficio. The Bean Fruit motto is a Biblical quotation from Galatians 5:22-23: “But the fruit of the Spirit is love, joy, peace, long suffering, gentleness, goodness, faith, meekness, temperance: against such there is no law.” Visit www.beanfruit.com or call 601-624-2605 for more information.","bottom_line":null,"roaster location":"Jackson, MIssissippi","coffee origin":"San Marcos, Tarrazu growing region, central Costa Rica.","roast level":"Medium-Light","agtron":"55\/80","est. price":"$14.00\/12 ounces","review date":"November 2014","aroma":"8","acidity":"8","body":"8","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/costa-rica-finca-el-llano\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Mr. Chao Coffee","title":"Kenya 168","blind_assessment":"Crisply sweet-savory. Date, hop flowers, tamarind, oak, cane sugar in aroma and cup. Richly bittersweet structure with lively acidity; velvety-smooth mouthfeel. Sweetly tart finish leads with tamarind notes, supported by sweet aromatic wood.","notes":"Despite grower discontent, unclear government coffee policy and urban encroachment on prime coffee lands, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. Mr. Chao Coffee is a subsidiary of Intekeco Co., Ltd, based in New Taipei City, Taiwan, which provides both green and roasted coffee to wholesale and retail clients. Visit https:\/\/chao-coffee.webnode.tw\/zh-tw\/ for more information.","bottom_line":"A savory-leaning Kenya cup — bittersweet with appealing floral tartness rounded by notes of rich cane sugar.","roaster location":"New Taipei City, Taiwan","coffee origin":"Nyeri growing region, south-central Kenya","roast level":"Medium-Light","agtron":"58\/78","est. price":"NT $260\/200 grams","review date":"September 2021","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kenya-168\/","with milk":null,"acidity\/structure":"9"},{"rating":"91","roaster":"PT's Coffee Roasting Co.","title":"Guatemala Finca Socorro y Annexos Cup of Excellence #4","blind_assessment":"Elegant floral aroma, with fruity hints of mixed berries and stone fruit, bright acidity, lightly syrupy mouthfeel and medium body. The floral tones carry into the cup with tart notes of Meyer lemon and strawberry rounding and sweetening to cherryish chocolate and nut. A mild sweet cocoa note lingers in the long finish softening a touch of astringency.","notes":"A prize winner in the 2008 Guatemala Cup of Excellence competition, where as a green (unroasted) coffee it placed fourth out of hundreds of entries, attracting a score of 89.60 from an international jury. This coffee is comprised of the Maracaturra variety of Arabica, a cross between the giant-beaned Maragogipe and Caturra, a dwarf selection of Bourbon. Roasted at PT's Coffee, where the motto is \"without the love, it's just coffee.\" Visit www.ptscoffee.com or call 888-678-5282 for more information.","bottom_line":null,"roaster location":"Topeka, Kansas","coffee origin":"Palencia, Guatemala Department, Guatemala.","roast level":"Light","agtron":"66\/91","est. price":null,"review date":"July 2009","aroma":"8","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/guatemala-finca-socorro-y-annexos-cup-of-excellence-4\/","with milk":null,"acidity\/structure":null},{"rating":"89","roaster":"Lao Mountain Coffee","title":"Peaberry Espresso","blind_assessment":"Evaluated as espresso. Crisply floral and fruit-toned. Orange zest, baker’s chocolate, oak, a hint of honeysuckle-like flowers in aroma and small cup. Syrupy in texture though drying in mouthfeel; flavor consolidates but persists in a round, sweet, though quietly dry finish. Tart, fruity chocolate dominates in three parts milk.","notes":"Lao Mountain Coffee is an artisanal coffee-roasting company based in Vientiane, the capital of Laos. It roasts and sells specialty-grade coffee grown exclusively for Lao Mountain Coffee Farmers Producer Group on the Bolaven Plateau, a group of producers certified as fulfilling criteria for “compliance with Fair Trade Laos Corporate Social Responsibility.” For more information, visit laomountain.com or call +65 6812 5738.","bottom_line":null,"roaster location":"Vientiane, Laos","coffee origin":"Champasak Province, southern Laos","roast level":"Medium-Light","agtron":"56\/77","est. price":"$13.71\/200 grams","review date":"November 2015","aroma":"8","acidity":null,"body":"8","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/peaberry-espresso\/","with milk":"7","acidity\/structure":null},{"rating":"93","roaster":"Buon Caffe","title":"Panama Hacienda La Esmeralda Diamond Mountain Catuai Washed","blind_assessment":"Crisply sweet-tart, citrusy. Lime zest, cocoa nib, jasmine, plum, cedar in aroma and cup. Balanced, vibrant acidity; satiny-smooth mouthfeel. Cocoa-toned citrus notes lead in the long finish.","notes":"Produced at Hacienda La Esmeralda, entirely of the Catuai variety of Arabica, and processed by the traditional washed method (fruit skin and flesh are removed before beans are dried). Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.","bottom_line":"A Catuai from famed Panama Geisha producer Hacienda La Esmeralda — complex, cocoa and citrus driven.","roaster location":"Taipei, Taiwan","coffee origin":"Boquete growing region, western Panama","roast level":"Medium-Light","agtron":"60\/77","est. price":"NT $325\/8 ounces","review date":"July 2023","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/panama-hacienda-la-esmeralda-diamond-mountain-catuai-washed\/","with milk":null,"acidity\/structure":"9"},{"rating":"92","roaster":"Temple Coffee and Tea","title":"Ethiopia Tchembe","blind_assessment":"Unusual profile: intense night flowers and a banana-like fruit dominate, with complicating hints of brandy and cedar. Round, functional acidity; buttery mouthfeel. Flowers in particular carry into a long, deep, slightly drying finish.","notes":"This is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with the orthodox wet-processed or \"washed\" coffees more typical of southern Ethiopia. With two coffee houses located in California's state capitol Sacramento, Temple Coffee recently transitioned from serving coffee roasted by others to roasting its own. Visit www.templecoffee.com or call 916-601-5363 for more information.","bottom_line":null,"roaster location":"Sacramento, California","coffee origin":"Southern Ethiopia","roast level":"Medium-Light","agtron":"52\/70","est. price":"$22.00\/12 ounces","review date":"December 2011","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-tchembe\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Old Soul Co.","title":"Ethiopia Washed Shatawene Gr. 1","blind_assessment":"Delicate, sweetly tart. Lemon zest, nougat, cedar, mango, narcissus-like flowers in aroma and cup. Crisp, gentle acidity; lean, silky mouthfeel. The richly drying finish consolidates around aromatic wood tones, with intimations of sweet-tart mango.","notes":"Southern Ethiopia coffees like this one are produced from traditional Ethiopian varieties of Arabica long grown in the region. When processed by the wet or washed method (fruit skin and pulp are removed before drying) they typically express great aromatic complexity and intensity with a particular emphasis on floral notes. Like virtually all southern Ethiopia coffees, this one is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Old Soul is a roastery, bakery and crafter of artisan goods dedicated to quality in every form. Visit www.oldsoulco.com or call 916-443-7685 for more information.","bottom_line":"An invitingly accessible, crisply sweet Sidamo cup.","roaster location":"Sacramento, California","coffee origin":"Sidamo growing region, south-central Ethiopia","roast level":"Medium-Light","agtron":"56\/78","est. price":"$19.50\/12 ounces","review date":"November 2016","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-washed-shatawene-gr-1\/","with milk":null,"acidity\/structure":null},{"rating":"91","roaster":"Kunshan Kokei co., LTD","title":"H Coffee Blend F03","blind_assessment":"Sweet, deeply nut-toned. Hazelnut, baking chocolate, red apple, fresh-cut fir, brown sugar in aroma and cup. Sweet-toned structure with brisk acidity; crispy, satiny mouthfeel. Finish consolidates to hazelnut and baking chocolate with undertones of fresh-cut fir.","notes":"A blend of coffees from Guatemala, Colombia and Brazil. Roasted by Shunda Food, a Shanghai-based food and beverage manufacturer with a commitment to specialty coffee. Visit http:\/\/www.shundafood.com\/index_en.html for more information.","bottom_line":"An accessible blend: sweet and nutty with pleasant cocoa tones throughout.","roaster location":"Shanghai, China","coffee origin":"Guatemala; Colombia; Brazil","roast level":"Medium-Light","agtron":"55\/71","est. price":"$16.88\/227 grams","review date":"February 2020","aroma":"8","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/h-coffee-blend-f03\/","with milk":null,"acidity\/structure":"8"},{"rating":"94","roaster":"JBC Coffee Roasters","title":"Banco Gotete Ethiopia","blind_assessment":"Delicate, richly floral, sweetly spice-toned. Almond nougat, white peach, pink peppercorn, wisteria-like flowers, fragrant sandalwood in aroma and cup. Richly bittersweet structure with vibrant, juicy acidity; plush, syrupy mouthfeel. Resonant, flavor-saturated finish centers around peach, wisteria and sandalwood.","notes":"Southern Ethiopia coffees like this one are produced largely from traditional indigenous Ethiopian varieties of Arabica long grown in the region. This lot was processed by the wet or washed method (fruit skin and pulp are removed before drying). Ethiopia coffees processed with this method typically express great aromatic complexity and intensity, with a particular emphasis on floral notes. JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.","bottom_line":"A nuanced, multi-layered washed Ethiopia cup with a deep floral profile and energetic lift from an elegant spice throughline.","roaster location":"Madison, Wisconsin","coffee origin":"Yirgacheffe growing region, southern Ethiopia","roast level":"Medium-Light","agtron":"53\/75","est. price":"$18.50\/12 ounces","review date":"February 2019","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/banco-gotete-ethiopia\/","with milk":null,"acidity\/structure":"9"},{"rating":"92","roaster":"Quartet Kaffe","title":"Kenya Wanjengi AA","blind_assessment":"Richly sweet-savory, deep-toned. Date, hop flowers, maple syrup, cedar, cocoa nib in aroma and cup. Bittersweet structure with brisk acidity; full, lightly syrupy mouthfeel. Finish consolidates to cocoa-toned date in the short and cedar-like aromatic wood notes in the long.","notes":"Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Quartet Kaffe is an artisan roastery in Taiwan founded in 2018, dedicated to pursuing coffee performance art and offering unique specialty coffee. Visit www.facebook.com\/QuartetKaffe for more information.","bottom_line":"A developed medium roast emphasizes this Kenya’s depth and amplifies its rich dried fruit and cocoa notes.","roaster location":"Taipei, Taiwan","coffee origin":"Murang'a County, central Kenya","roast level":"Medium","agtron":"50\/70","est. price":"NT $530\/200 grams","review date":"April 2020","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kenya-thageini-2\/","with milk":null,"acidity\/structure":"8"},{"rating":"93","roaster":"Flight Coffee Co.","title":"Ethiopia Zonegediyo Kochere Yirga Cheffe","blind_assessment":"Big, sweetly pungent, complex. Brown sugar, dark chocolate, walnut, narcissus-like flowers, savory hints of mango and musk in aroma and cup. Rich, resonant acidity; lightly syrupy mouthfeel. Deeply flavor-saturated finish, drying but long and sweet.","notes":"Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe coffees like this one processed by the wet or washed method (fruit skin and pulp are removed before drying) typically express great aromatic complexity and intensity with a particular emphasis on floral notes. Like virtually all Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Flight Coffee Co. (formerly CQ Coffee Roasters) is a coffee-loving, quality-focused roasting company based in Bedford, New Hampshire.Visit www.flightcoffeeco.com or call 603-836-6228 for more information.","bottom_line":null,"roaster location":"Bedford, New Hampshire","coffee origin":"Yirgacheffe growing region, southern Ethiopia.","roast level":"Medium-Light","agtron":"54\/70","est. price":"$14.50\/12 ounces","review date":"January 2014","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-zonegediyo-kochere-yirga-cheffe\/","with milk":null,"acidity\/structure":null},{"rating":"91","roaster":"Paradise Roasters","title":"Guatemala Huehuetenango Fair Trade Organic","blind_assessment":"Pungent cedar, delicate flowers, ripe grapefruit, dark chocolate in aroma and cup. Roundly tart, deeply expressed acidity; lightly syrupy mouthfeel. Flavor consolidates in a rich though simple finish.","notes":"Certified organically grown entirely from trees of the heirloom Bourbon variety of Arabica. Huehuetenango is one of the most respected of Guatemala coffee growing regions. Paradise Roasters specializes in micro-lot coffees and espressos from Hawaii and other premier coffee growing regions. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.","bottom_line":null,"roaster location":"Ramsey, Minnesota","coffee origin":"Huehuetenango growing region, Guatemala.","roast level":"Medium-Light","agtron":"58\/82","est. price":"$12.95\/12 ounces","review date":"August 2013","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/guatemala-huehuetenango-fair-trade-organic\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Bard Coffee","title":"Cerro Paldo Tarrazu Costa Rica","blind_assessment":"Crisply complex. Butter, cherry, pungent cedar, dark chocolate, a hint of sweet dusk-blooming flowers in aroma and cup. Round, floral-toned acidity; light but very silky mouthfeel. Deep, flavor-saturated, though distinctly dry finish.","notes":"Bard Coffee is a coffeehouse and roasting company based in Portland, Maine, focused on distinctive single-origin coffees. Bard Coffee is co-owned by Bob Garver, founder of Wicked Joe coffee and a frequent judge at barista competitions in the United States and internationally. Visit www.bardcoffee.com or call 207-899-4788 for more information.","bottom_line":null,"roaster location":"Portland, Maine","coffee origin":"Tarrazu growing region, central Costa Rica","roast level":"Medium","agtron":"55\/65","est. price":"$16.00\/12 ounces","review date":"July 2013","aroma":"9","acidity":"8","body":"9","flavor":"9","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/cerro-paldo-tarrazu-costa-rica\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"David's Nose","title":"Nicaragua La Huella Catuaí","blind_assessment":"Crisp, delicately sweet. Nectarine, jasmine, cocoa nib, almond, oak in aroma and cup. Sweet-toned structure with gentle acidity; full, viscous mouthfeel. The finish centers around notes of nectarine, cocoa nib, and oak.","notes":"Matagalpa is one of the classic growing regions of Nicaragua. This washed-process coffee is comprised entirely of the Catuaí variety of Arabica. David's Nose Coffee is a specialty coffee roaster based in Taipei, Taiwan whose founder studied agronomy and has a deep interest in crop quality. For more information, visit www.dnose.com.tw.","bottom_line":"A stone fruit- and floral-driven Nicaragua cup with an especially plush, vibrant mouthfeel.","roaster location":"Taipei, Taiwan","coffee origin":"Matagalpa, Nicaragua","roast level":"Light","agtron":"62\/80","est. price":"NT $500\/16 ounces","review date":"September 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/nicaragua-la-huella-catuai\/","with milk":null,"acidity\/structure":"8"},{"rating":"87","roaster":"Starbucks Coffee","title":"Rwanda Blue Bourbon Black Apron Exclusive","blind_assessment":"A paradoxical coffee, thin and subdued, but with considerable suggestions of richness and complexity. In the aroma muted suggestions of night flowers, butter, black cherries. In the cup lean but silky mouthfeel and delicate hints of spicy nut, cocoa, more flowers and cherry, perhaps of a rather dullish aromatic wood. The flavor persists nicely into an otherwise short, fast-fading finish.","notes":"The coffee cooperatives of Rwanda, benefiting from superb growing conditions, traditional varieties of Arabica and support from aid agencies and coffee idealists, are beginning to produce coffees that rank among the world's finest and most distinctive. Bourbon is a prestigious heirloom variety of Coffea Arabica. This is the April 2008 offering in the Starbucks Black Apron Exclusives line of distinctive seasonally available coffees. Visit www.starbucks.com for more information.","bottom_line":null,"roaster location":"Seattle, Washington","coffee origin":"Rwanda.","roast level":"Dark","agtron":"37\/40","est. price":null,"review date":"April 2008","aroma":"7","acidity":"7","body":"8","flavor":"8","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/rwanda-blue-bourbon-black-apron-exclusive\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"PT's Coffee Roasting Co.","title":"Reserva del Patron Colombia Narino","blind_assessment":"Distinctive aromatics: sweetly dry fruit notes that suggest black current, blackberry, tart cherry, cedary orange. Lightly syrupy mouthfeel, fine balance. Long, deep finish that stays on the rich side of astringent.","notes":"Reserva del Patron is a very high-grown and exceptionally rigorously selected green coffee from an admired growing region in the southernmost Colombia Department of Narino. PT's is a quality-oriented wholesale\/retail specialty roaster with a wide and refined selection of coffee blends and origins. The PT's motto is \"without the love, it's just coffee.\" Visit www.ptscoffee.com or call 888-678-5282 for more information.","bottom_line":null,"roaster location":"Topeka, Kansas","coffee origin":"Narino Department, southern Colombia","roast level":"Medium-Light","agtron":"60\/80","est. price":null,"review date":"February 2008","aroma":"8","acidity":"8","body":"8","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/reserva-del-patron-colombia-narino\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"JBC Coffee Roasters","title":"Masha #5 Burundi","blind_assessment":"Richly sweet, gently fruity. Bing cherry, toffee, narcissus, cedar, sassafras in aroma and cup. Brisk, sweet acidity; very full, creamy mouthfeel. Resonant finish centered around notes of toffee and narcissus.","notes":"Produced by smallholding farmers, entirely if the Bourbon variety of Arabica, and processed by the natural method (dried in the whole fruit) at the Masha Washing Station. JBC Coffee Roasters’ vision is simple: “Let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.","bottom_line":"A deeply sweet, subtly fruit-forward natural-processed Burundi characterized by notes of toffee, spice-toned florals and sassafras-like undercurrent.","roaster location":"Madison, Wisconsin","coffee origin":"Kayanza, Burundi","roast level":"Light","agtron":"66\/84","est. price":"$20.00\/12 ounces","review date":"May 2024","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/masha-5-burundi\/","with milk":null,"acidity\/structure":"8"},{"rating":"87","roaster":"El Gran Cafe","title":"Las Moritas Yellow Caturra","blind_assessment":"Gently fruit-toned, wood-framed. Prune, balsa wood, hazelnut, orange zest, a hint of freesia in aroma and cup. Sweet-savory structure with gently bittersweet acidity; velvety mouthfeel. Notes of balsa and hazelnut drive the finish.","notes":"Produced by Higinio Gómez entirely of the Yellow Caturra variety of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). El Gran Cafe is a coffee shop located in the heart of Antigua, Guatemala whose mission is to roast and serve organic-certified coffees produced at its own Finca La Esperanza and Finca El Pintado just outside of town. Featured in El Gran Cafe’s lineup are also coffees from friends and neighbors in the region, along with award-winning and exceptional coffees from other regions of Guatemala. Visit https:\/\/elgran.cafe\/ for more information.","bottom_line":"A richly nutty Guatemala cup with notes of dried fruit and a hint of spice-toned florals.","roaster location":"Antigua, Guatemala","coffee origin":"El Progresso Department, Guatemala","roast level":"Light","agtron":"58\/84","est. price":"$13.00\/12 ounces","review date":"December 2021","aroma":"8","acidity":null,"body":"7","flavor":"8","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/las-moritas-yellow-caturra\/","with milk":null,"acidity\/structure":"7"},{"rating":"93","roaster":"Equator Coffees","title":"Yemen Sana’a","blind_assessment":"Elegantly fruit-toned, richly sweet. Dried black cherry, pipe tobacco, almond, vanilla, honeysuckle in aroma and cup. Sweetly tart structure with gently brisk acidity; very syrupy-smooth mouthfeel. The finish consolidates  vanilla and cherry notes supported by pipe tobacco.","notes":"Produced by smallholding farmers from trees of local heirloom varieties of Arabica and processed by the natural method (dried in the whole fruit). Founded in 1995 by Brooke McDonnell and Helen Russell, Equator Coffees operates retail stores in the San Francisco Bay Area and provides coffee to hundreds of wholesale accounts. Visit www.equatorcoffees.com or call 800-809-7687 for more information.","bottom_line":"A nuanced, sweetly earthy and fruit-forward Yemen with honey-like florals and notes of ripe stone fruit.","roaster location":"San Rafael, California","coffee origin":"Sana’a Governorate, Yemen","roast level":"Light","agtron":"62\/84","est. price":"$32.00\/6 ounces","review date":"October 2021","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/yemen-sanaa\/","with milk":null,"acidity\/structure":"8"},{"rating":"95","roaster":"Mudhouse Coffee Roasters","title":"Mora Negra Geisha Hartmann Farm","blind_assessment":"Deeply rich, intricately composed. Raspberry jam, peppermint, lilac, fine musk, roasted cacao nib in aroma and cup. Gentle, sweet acidity; plush, satiny mouthfeel. The delicate but resonant finish is redolent of cocoa-toned peppermint, richly drying and invitingly sweet.","notes":"Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also Geisha) by the Hartmann family. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This is a dry-processed or “natural” Gesha, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Mudhouse Coffee Roasters, Roast Magazine's 2017 Micro-Roaster of the Year, is a small, quality-focused roaster in Charlottesville, Virginia that specializes in \"super-specialty\" coffees. This focus, along with their commitment to environmentally and socially sustainable coffee production, is what led them to planting a coffee farm in Boquete, Panama along with partners Willem Boot and Kelly Hartmann. Visit www.mudhouse.com for more information.","bottom_line":"An elegant natural-processed rendition of the classic Gesha cup, with notes of floral-toned musk and cocoa revealed in complex layers.","roaster location":"Charlottesville, Virginia","coffee origin":"Chiriqui Province, far western Panama","roast level":"Medium-Light","agtron":"56\/78","est. price":"$29.00\/8 ounces","review date":"December 2016","aroma":"9","acidity":"9","body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/mora-negra-geisha-hartmann-farm\/","with milk":null,"acidity\/structure":null},{"rating":"91","roaster":"Green Mountain Coffee","title":"Newman’s Own Organics Colombian Especial","blind_assessment":"Aromatically deep, with richly round caramel, toast and milk chocolate notes. In the cup penetrating acidity and flavor. Intense fruit-toned chocolate gives way to layers of fruit (peach, orange, black currant?) that soften and grow in complexity as the cup cools. Pungent dark chocolate dominates in the finish.","notes":"Sales of this coffee help support a variety of educational and charitable organizations through the Newman's Own Organics organization. It is certified organically grown and Fair Trade, the latter meaning the green beans were purchased from small-holding farmers at a \"fair\" or economically sustainable price. Green Mountain Coffee Roasters is one of the country's leading specialty roasters, offering a particularly wide-ranging variety of origins and roast styles, including an impressive selection of Fair-Trade and certified organic coffees under various labels, among them Newman's Own Organics. Visit www.greenmountaincoffee.com for more information.","bottom_line":null,"roaster location":"Waterbury, Vermont","coffee origin":"Colombia","roast level":"Medium","agtron":"45\/59","est. price":"$8.49\/10 oz.","review date":"May 2010","aroma":"8","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/newmans-own-organics-colombian-especial\/","with milk":null,"acidity\/structure":null},{"rating":"94","roaster":"Batdorf & Bronson","title":"Sumatra Lake Tawar","blind_assessment":"Intense aroma and flavor, dominated by one of the most distinctive notes in coffee, a kind of earthy, pungent citrus sensation that may suggest grapefruit to some, butterscotch to others, but essentially is a pleasure that belongs to this style of coffee alone. Complicated by flowering grass, nut, dark chocolate. Balanced, integrated acidity, silky mouthfeel, sweetly rich, resonantly flavor-saturated finish.","notes":"A clean yet intense version of the traditional Sumatra wet-hulled coffee type with its richly fruity and earthy tendencies. Batdorf & Bronson is a premium wholesale specialty roaster with operations in Olympia, Washington and Atlanta, Georgia and a long and honorable commitment to quality and sound relationships with growers. Visit www.batdorfcoffee.com or call 800-955-5282 for more information.","bottom_line":null,"roaster location":"Olympia, Washington","coffee origin":"Lake Tawar basin, Aceh Province, northern Sumatra, Indonesia","roast level":"Medium","agtron":"46\/60","est. price":"$14.50 \/ 16 oz.","review date":"April 2010","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/sumatra-lake-tawar-4\/","with milk":null,"acidity\/structure":null},{"rating":"95","roaster":"Kakalove Cafe","title":"Ethiopia Washed Shakisso Mormora 74112","blind_assessment":"Delicate, richly floral-toned. Lavender, blood orange, cocoa nib, almond butter, sandalwood in aroma and cup. Balanced structure with fine, floral-toned acidity; silky-smooth, vibrant mouthfeel. The long, sweet finish centers around notes of cocoa nib, lavender and blood orange.","notes":"Produced in the Guji growing region, an area nestled next to Ethiopia's better-known Yirgacheffe and Sidamo regions, from trees of the indigenous 74112 selection of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.","bottom_line":"A complex, nuanced washed Ethiopia cup alive with spice-toned florals, richly bittersweet citrus, and distinct cocoa.","roaster location":"Chia-Yi, Taiwan","coffee origin":"Guji Zone, Oromia Region, southern Ethiopia","roast level":"Medium-Light","agtron":"58\/78","est. price":"NT $325\/8 ounces","review date":"June 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-washed-shakisso-mormora-74112\/","with milk":null,"acidity\/structure":"9"},{"rating":"93","roaster":"Rusty's Hawaiian","title":"Classic Roast","blind_assessment":"Sweetly and intensely pungent. Honey, black currant, sweet plum, dark chocolate, night-blooming flowers in aroma and cup. Deeply nuanced, balanced acidity; syrupy mouthfeel. Flavor and sweetness overwhelm a slight drying sensation in the finish.","notes":"Ka’u is a newly emerged Hawaii coffee growing district centered thirty miles or so southeast of the famous Kona region. Lorie Obra’s Rusty’s Farm is one of Ka’u’s best-known and most celebrated farms. Lorie meticulously picks, processes and roasts her coffees using traditional methods and artisan attention. Visit www.rustyshawaiian.com or call 808-928-8916 for more information.","bottom_line":null,"roaster location":"Pahala, Hawaii","coffee origin":"Ka'u growing district, \"Big Island\" of Hawaii.","roast level":"Medium","agtron":"53\/67","est. price":"$19.00\/8 ounces","review date":"August 2014","aroma":"9","acidity":"8","body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/classic-roast-3\/","with milk":null,"acidity\/structure":null},{"rating":"89","roaster":"Caffe Bomrad","title":"100% Arabica 100% Italiano","blind_assessment":"Evaluated as espresso. Smoothly round aroma: toasted almond, cocoa-toned caramel and apricot-like stone fruit. Syrupy mouthfeel. Turns crisper in the small cup: the almond turns smoky and walnutty, the caramel deepens toward a cedary dark chocolate. Dominates richly in two parts milk.","notes":"Roasted in Northern Italy and distributed in North America. Marcelo Bomrad-Casanova launched Caffè Bomrad with a commitment to the most authentic tradition of Italian coffee roasting practices. Visit www.caffebomrad.com for more information.","bottom_line":null,"roaster location":"Torino, Italy","coffee origin":"Not disclosed.","roast level":"Medium","agtron":"48\/65","est. price":"$54.00\/1 Kilogram","review date":"November 2011","aroma":"8","acidity":null,"body":"8","flavor":"8","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/100-arabica-100-italiano\/","with milk":"8","acidity\/structure":null},{"rating":"93","roaster":"Oak & Bond Coffee Company","title":"Guatemala Vista Al Bosque","blind_assessment":"Chocolaty, floral-toned. Dark chocolate, rhododendron-like flowers, hazelnut butter, date, cedar in aroma and cup. Sweet in structure with gentle, round acidity; very full, syrupy mouthfeel. The finish centers around notes of dark chocolate and rhododendron with hints of cedar.","notes":"Produced by Wilmar Castillo at Vista Al Bosque farm from the Bourbon and Caturra varieties of Arabica and processed by the wet, or washed, method (fruit skin and pulp are removed before drying). Oak & Bond is a specialty retail and wholesale coffee roaster based in Charlotte, North Carolina. The company’s name combines “oak,” a reference to its first coffee, a barrel-aged release, and “bond,” referring to the founders’ happy marriage. For more information, visit www.oakandbondcoffee.com.","bottom_line":"A richly sweet Guatemala cup with a throughline of vanilla-like florals and deep, dark chocolate.","roaster location":"Charlotte, North Carolina","coffee origin":"Huehuetenango, Guatemala","roast level":"Medium","agtron":"52\/68","est. price":"$19.00\/12 ounces","review date":"June 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/guatemala-vista-al-bosque\/","with milk":null,"acidity\/structure":"8"},{"rating":"86","roaster":"Bom Dia Cafe","title":"Marques de Paiva Gourmet Fair Trade Espresso Roast","blind_assessment":"Fine, delicate aroma: sweet-toned with floral top notes and a hint of dark chocolate. In the small cup medium-bodied and sweet but rather simple: some continued dark chocolate notes and raisiny fruit. In milk remains sweetly delicate and restrained.","notes":"Certified Fair Trade, meaning the coffees in this blend were purchased from small-holding farmers at a \"fair\" or economically sustainable price. Marques de Paiva is a brand of Cafe Bom Dia, a family-owned company that grows, roasts and distributes coffee from the classic Brazilian coffee-growing region of Sul de Minas. Visit www.marquesdepaiva.com or call 305-470-8010 for more information.","bottom_line":null,"roaster location":"Miami, Florida","coffee origin":"South-Central Brazil","roast level":"Medium-Dark","agtron":"38\/48","est. price":null,"review date":"October 2006","aroma":"8","acidity":null,"body":"7","flavor":"7","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/marques-de-paiva-gourmet-fair-trade-espresso-roast\/","with milk":"7","acidity\/structure":null},{"rating":"93","roaster":"Green Stone Coffee","title":"Flower Queens of Africa Blend","blind_assessment":"Richly fruit- and floral-toned. Blueberry, gardenia, dark chocolate, orange zest, a hint of thyme in aroma and cup. Sweet-savory with gently fruity acidity; full, satiny-smooth mouthfeel.The finish consolidates to notes of blueberry and dark chocolate with undertones of thyme.","notes":"A blend of coffees from Ethiopia's Guji growing region, which is nestled next to the better-known Yirgacheffe and Sidamo and shares their devotion to the distinctive, largely indigenous varieties of Arabica long grown in these regions. This is a “natural” or dry-processed version (dried in the whole fruit). Green Stone Coffee is a woman-owned artisan roastery in Taipei, Taiwan founded in 2016 and specializing in sourcing distinctive coffees that express their individual terroirs. Visit www.greenstone-coffee.com.tw for more information.","bottom_line":"An easygoing, cleanly fruit-forward natural-processed cup with big floral notes and delicate citrus and herb suggestions.","roaster location":"Taipei, Taiwan","coffee origin":"Guji Zone, Oromia Region, southern Ethiopia","roast level":"Medium-Light","agtron":"60\/76","est. price":"NT $300\/100 grams","review date":"November 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/flower-queens-of-africa-blend\/","with milk":null,"acidity\/structure":"8"},{"rating":"94","roaster":"Magnolia Coffee","title":"Ethiopia Durato Bombe","blind_assessment":"Richly fruit-forward, deeply chocolaty. Dried mango, chocolate fudge, wisteria, cedar, pistachio in aroma and cup in aroma and cup. Sweetly tart structure with winy acidity; plush, syrupy mouthfeel. The rich-toned finish consolidates to notes of dried mango, chocolate fudge and cedar.","notes":"Coffees from the Sidama region like this one are produced from distinctive, largely indigenous Ethiopian landrace varieties of Arabica long grown in the region. Processed by the natural method (dried in the whole fruit). Magnolia Coffee is a Charlotte-based specialty roaster whose mission is to use sustainably sourced coffees to make a difference in the lives of coffee workers and to foster a socially conscious community with cause-supporting coffees. Visit www.magnoliacoffeeco.com for more information.","bottom_line":"An engagingly vibrant, deeply sweet, richly tart and chocolaty natural-processed Ethiopia.","roaster location":"Charlotte, North Carolina","coffee origin":"Bombe mountains, Sidama Region, southern Ethiopia","roast level":"Medium-Light","agtron":"58\/78","est. price":"$19.00\/12 ounces","review date":"March 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-durato-bombe\/","with milk":null,"acidity\/structure":"9"},{"rating":"93","roaster":"JBC Coffee Roasters","title":"Santuario Peru","blind_assessment":"Deep-toned, richly chocolaty. Dark chocolate, date, narcissus, almond, brown sugar in aroma and cup. Sweet, balanced acidity; very full, creamy mouthfeel. Sweet-toned finish with notes of dark chocolate and almond.","notes":"Produced by smallholding members of the Santuario Cooperative, from trees of the Caturra, Bourbon, Pache, Catimor and Typica varieties of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). JBC Coffee Roasters’ vision is simple: “let the coffee lead the way” through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.","bottom_line":"A rich, deeply chocolaty, floral- and nut-toned Peru with subtle hints of spicy florals.","roaster location":"Madison, Wisconsin","coffee origin":"Cajamarca, Peru","roast level":"Medium-Light","agtron":"54\/72","est. price":"$18.00\/12 ounces","review date":"December 2023","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/santuario-peru\/","with milk":null,"acidity\/structure":"8"},{"rating":"94","roaster":"Paradise Roasters","title":"Kona Pink Honey Black Rock Farm","blind_assessment":"Richly and elegantly fruit-toned. Strawberry-guava, cocoa nib, violet, wild honey, aloe wood in aroma and cup. Vivaciously sweet-tart structure with juicy, balanced acidity; full, creamy mouthfeel. Resonant fruit-forward finish with notes of strawberry-guava, cocoa nib and violet.","notes":"Produced at Black Rock Farm entirely from trees of the Typica variety of Arabica and processed by the pink honey method, in which coffee is fermented in cherries first, resulting in a vibrant pink tinge to the fruit upon removing the skin. The coffee is laid to dry on patios with the fruit still attached to the parchment, commonly called honey processing. In the fermentation, yeast strains have been utilized to enhance the floral and tropical fruit character of the coffee. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.","bottom_line":"A uniquely composed coffee processed by a twist on the traditional honey method that results in a sweet, tart, high-toned, lyrical cup.","roaster location":"Minneapolis, Minnesota","coffee origin":"Kona, Big Island of Hawai’i","roast level":"Medium-Light","agtron":"58\/78","est. price":"$24.95\/4 ounces","review date":"September 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kona-pink-honey-black-rock-farm\/","with milk":null,"acidity\/structure":"9"},{"rating":"90","roaster":"Serda's Coffee","title":"Coastal Clear Blend","blind_assessment":"In the aroma rich dark chocolate and toast with hints of wood smoke, cinnamon and fruit. In the cup smooth acidity, full body and gentle flavors that balance lemon with sweeter-toned fruit and cocoa. Flavor fades rather quickly in the finish.","notes":"This blend combines very dark-roasted Guatemala with lighter-roasted East African coffees. Proceeds from this blend are donated to Mobile Bay Keepers and the Alabama Coastal Foundation to help in efforts to clean up the recent Gulf oil spill. Serda's is a coffee roaster and lively cafe in Mobile, Alabama that evolved from an online coffee retailer and Internet cafe in Costa Rica. Visit www.serdascoffee.com or call 866-783-8925 for more information.","bottom_line":null,"roaster location":"Mobile, Alabama","coffee origin":"Ethiopia; Rwanda; Guatemala.","roast level":"Medium-Dark","agtron":"41\/43","est. price":"$12.95\/16 oz.","review date":"August 2010","aroma":"8","acidity":"8","body":"9","flavor":"8","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/coastal-clear-blend\/","with milk":null,"acidity\/structure":null},{"rating":"94","roaster":"Bucks County Coffee","title":"Fair Trade Organic Guatemala","blind_assessment":"High-toned, sweet, light-footed and delicate, yet rich and deeply dimensioned. Lemon and red-wine notes in the aroma, in the cup red wine, cherry and a shimmer of flowers. Long, complex finish.","notes":"Purchased at A&P, ground in sealed 12-ounce foil bag with one-way valve; $10.65 per pound. Produced by indigenous Maya members of the ASOBAGRI cooperative. Certified organically grown and fair-traded, meaning farmers have been paid an economically sustainable price for this coffee based on internationally established price guidelines. Bucks County Coffee has managed to stay close to its micro-roasting roots throughout its expansion from a small roasting machine in a carriage house to one of the country's largest regional specialty coffee chains. Visit www.buckscountycoffee.com or call 800-844-8790 for more info.","bottom_line":null,"roaster location":"Langhorne, Pennsylvania","coffee origin":"Huehuetenango growing region, north-central Guatemala","roast level":"Very Dark","agtron":"0\/66","est. price":null,"review date":"June 2003","aroma":"9","acidity":"8","body":"8","flavor":"10","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/fair-trade-organic-guatemala\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Big Shoulders Coffee","title":"Burundi Buhorwa","blind_assessment":"Balanced, richly sweet-tart. Lychee, orange zest, amber oil, cocoa nib, narcissus-like flowers in aroma and cup. Sweet-toned structure with poised acidity; syrupy-smooth mouthfeel. The floral-toned finish centers around amber and orange zest suggestions.","notes":"Produced by smallholding farmers entirely from the Bourbon variety of Arabica and processed at the Buhorwa Washing Station. Benefiting from ideal growing conditions and large plantings of Bourbon and related heirloom varieties of Arabica, Burundi coffee has developed a growing following among North American roasters and enthusiasts. Big Shoulders Coffee is a Chicago artisan roaster that emphasizes a fresh-roasted, no-nonsense approach to fine coffee. Visit www.bigshoulderscoffee.com or call 312-846-1439 for more information.","bottom_line":"A delicately perfumed, floral-toned Burundi with a throughline of resiny amber-like notes.","roaster location":"Chicago, Illinois","coffee origin":"Kayanza Province, Burundi","roast level":"Light","agtron":"63\/81","est. price":"$22.00\/12 ounces","review date":"December 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/burundi-buhorwa-3\/","with milk":null,"acidity\/structure":"8"},{"rating":"93","roaster":"Paradise Roasters","title":"Kona Pumpkin Spice Anaerobic","blind_assessment":"Sweetly spice-toned. Cinnamon, cocoa powder, plum, ginger blossom, narcissus in aroma and cup. Richly sweet structure with round acidity; full, satiny mouthfeel. The spice-toned finish centers on cinnamon and gingerbread suggestions.","notes":"Produced at Kona’s Black Rock Farms entirely of the Typica variety of Arabica and processed by the anaerobic method with the addition of spices to the tank during the fermentation step. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.","bottom_line":"A subtly nostalgic, playful holiday coffee appropriate for welcoming autumn with notes of warming spices and cocoa.","roaster location":"Minneapolis, Minnesota","coffee origin":"Kona, Big Island of Hawai’i","roast level":"Medium-Light","agtron":"58\/76","est. price":"$24.95\/4 ounces","review date":"September 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/kona-pumpkin-spice-anaerobic\/","with milk":null,"acidity\/structure":"8"},{"rating":"81","roaster":"Flavia","title":"Colombia","blind_assessment":"(As brewed in a Flavia Fusion Drink Station using a Flavia proprietary single-serve pouch at a cup volume of 7 ounces): Subdued, delicate, vanilla-toned aroma. In the cup excellent body and mouthfeel, good sweetness, but very flat and monotoned in flavor, with a hint of fruit and cardboardy stale notes. No flavor whatsoever persists in the simple, slightly astringent finish.","notes":"The Flavia Fusion Drink Station is a sleekly redesigned, consumer version of the well-established office hot beverage machines Flavia S350 and SB100. It prepares coffees in proprietary Flavia pouches, which currently cannot be purchased from third-party roasting companies and cannot be used in other single-serve brewing devices. Flavia is a brand of Mars Incorporated, a large privately owned company that started with its now classic candies before adding pet food (Whiskas), people food (Uncle Ben's) vending systems, and now the Flavia Drink Station and its beverages. Visit www.myflavia.com or call 888-693-5284 for more information.","bottom_line":null,"roaster location":"West Chester, Pennsylvania","coffee origin":"Colombia","roast level":"NA","agtron":"0\/0","est. price":null,"review date":"December 2005","aroma":"6","acidity":"7","body":"7","flavor":"6","aftertaste":"6","url":"https:\/\/www.coffeereview.com\/review\/colombia\/","with milk":null,"acidity\/structure":null},{"rating":"94","roaster":"Genesis Coffee Lab","title":"Ethiopia Honey Process Tamiru Tadesse","blind_assessment":"Delicately fruit-toned, tisane-like. Dried strawberry, baking chocolate, lemon verbena, maple syrup, cashew butter in aroma and cup. Sweetly tart structure with gently bright acidity; silky mouthfeel. Pleasing, quietly berry-toned finish.","notes":"Produced by Tamiru Tadesse of Alo Coffee. Southern Ethiopia coffees like this one are largely produced from selections of distinctive indigenous Ethiopian landrace varieties of Arabica long grown in the region. Processed by the honey method, in which the fruit skins are removed, but some of the fruit flesh is left to dry on the beans. Genesis Coffee Lab specializes in developing relationships with and importing coffees from specialty coffee producers in Ethiopia. Visit www.genesiscoffeelab.com for more information.","bottom_line":"A delicate, elegant, honey-processed Sidamo cup with leading notes of dried berry and herby citrus notes.","roaster location":"Big Lake, Alaska","coffee origin":"Sidamo growing region, south-central Ethiopia","roast level":"Light","agtron":"64\/83","est. price":"$35.00\/10 ounces","review date":"November 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-honey-process-tamiru-tadesse\/","with milk":null,"acidity\/structure":"9"},{"rating":"68","roaster":"Café Godiva","title":"Special Roast","blind_assessment":"This coffee arrived pre-ground (not available whole bean), perhaps accounting for its flatness in nose and cup, although some herbal or prune notes survive in the thin, carbon-toned acidity.","notes":"Arrived pre-ground, perhaps accounting for flatness in nose and cup. Thin, carbon-toned acidity.","bottom_line":null,"roaster location":"Clinton, Connecticut","coffee origin":null,"roast level":"Medium-Dark","agtron":"\/44","est. price":null,"review date":"February 1997","aroma":"5","acidity":"4","body":"4","flavor":"5","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/special-roast\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Honta Coffee","title":"Fruit Candy Blend","blind_assessment":"Chocolaty, sweetly tart. Blueberry, molasses, lemon, cocoa powder, allspice in aroma and cup. Sweet structure with brisk acidity; crisply smooth, velvety mouthfeel. Allspice and baking chocolate lead in the crisp finish.","notes":"A blend of coffees from Brazil, Guatemala, Tanzania and Ethiopia. Honta Coffee is a Taiwan-based specialty roaster. Visit www.honta.tw\/phone\/index.html for more information.","bottom_line":"A berry- and chocolate-toned blend — clean, delicately fruit-forward, richly sweet.","roaster location":"Taoyuan, Taiwan","coffee origin":"Brazil; Guatemala; Tanzania; Ethiopia","roast level":"Medium-Light","agtron":"58\/75","est. price":"NT $450\/454 grams","review date":"December 2022","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/fruit-candy-blend\/","with milk":null,"acidity\/structure":"8"},{"rating":"92","roaster":"Temple Coffee","title":"Festivity Blend","blind_assessment":"Richly sweet, nut-toned. Almond nougat, tangerine, cocoa powder, freesia-like flowers, oak in aroma and cup. Sweet-toned structure with brisk acidity; plush, satiny mouthfeel. Crisply nut-toned finish with undertones of cocoa-powder.","notes":"A blend of three coffees: a Guatemala and a Colombia, both washed-process, and a natural-processed Ethiopia. Temple Coffee is a quality-focused retail and wholesale specialty roaster active in Sacramento, California since 2005. Committed to sourcing, roasting and brewing the finest coffees, Temple features coffee from distinguished single estates and cooperatives around the world. Visit www.templecoffee.com or call 916-454-1282 for more information.","bottom_line":"A sweetly nut-toned holiday blend with pleasing citrus and cocoa impulses.","roaster location":"Sacramento, California","coffee origin":"Guatemala; Ethiopia; Colombia","roast level":"Medium-Light","agtron":"58\/74","est. price":"$22.50\/12 ounces","review date":"November 2022","aroma":"8","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/festivity-blend-2\/","with milk":null,"acidity\/structure":"8"},{"rating":"93","roaster":"Paradise Roasters","title":"Coffea Diversa Liberica Carbonic Maceration","blind_assessment":"Very sweet; floral and yogurt-like. Pineapple kefir, dark chocolate, cashew, tiger lily, kumquat in aroma and cup. Completely original structure: quite sweet, with a delicately tart character associated with lactic acid fermentation. Lively, crisply round mouthfeel. Richly intricate, layered, flavored-saturated finish.","notes":"Produced by Gonzalo Hernandez at his Coffea Diversa “coffee garden” in Costa Rica entirely of the Deweverei variety of coffea Liberica. Liberica is a species of coffee native to central Africa and long cultivated in parts of Southeast Asia. Processed by the carbonic maceration natural method, which involves fermenting whole fruit inside a sealed container that has been flushed with CO2. Paradise Roasters specializes in micro-lot Arabica and Robusta coffees from Asia and other emerging origins. The company prides itself on quality and freshness, craft-roasting coffees in small batches only after orders are placed. Visit www.paradiseroasters.com or call 763-433-0626 for more information.","bottom_line":"An exceedingly rare coffee in all respects: A genuinely fine coffee produced from trees of the overlooked and poorly regarded Liberica species, processed by the still unusual carbonic maceration method. The result is a cup that is wildly original and engagingly complex.","roaster location":"Minneapolis, Minnesota","coffee origin":"Biollet, Costa Rica","roast level":"Light","agtron":"62\/80","est. price":"$19.95\/12 ounces","review date":"June 2020","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/coffea-diversa-liberica-carbonic-maceration\/","with milk":null,"acidity\/structure":"8"},{"rating":"91","roaster":"Chromatic Coffee","title":"Gamut Espresso (reviewed for drip applications)","blind_assessment":"Sweet, round, complexly and delicately chocolaty. Milk chocolate, honey, floral-toned vanilla, almond in aroma and cup. Soft, backgrounded acidity; very lightly syrupy mouthfeel. Flavor consolidates but persists in a long, resonant finish.","notes":"Gamut is Chromatic Coffee’s flagship espresso. It is reviewed here for brewed or non-espresso applications, however. Chromatic prides itself in doing everything in-house and meticulously, from printing its attractive bags to modifying equipment to sourcing and roasting its fine coffees. Visit www.chromaticcoffee.com for more information.","bottom_line":null,"roaster location":"San Jose, California","coffee origin":"Brazil; Ethiopia; El Salvador.","roast level":"Medium","agtron":"52\/66","est. price":"$16.00\/12 ounces","review date":"February 2014","aroma":"8","acidity":"7","body":"8","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/gamut-espresso-reviewed-for-drip-applications\/","with milk":null,"acidity\/structure":null},{"rating":"94","roaster":"Barrington Coffee Roasting Co.","title":"Tchembe Single Origin Espresso","blind_assessment":"Evaluated as espresso. Complex flowers and citrus, high-toned but smooth. Flowers, butter, grapefruity citrus, roasted cocoa nib in aroma and small cup. Smooth, lightly syrupy mouthfeel; rich, long, chocolate-saturated finish. Superb in two parts milk, sweetly and richly chocolate-toned with a gently tart fruit that resonates with particular distinction in a long finish.","notes":"This coffee is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Yirgacheffe is a coffee region in southern Ethiopia that produces distinctively floral- and fruit-toned coffees from traditional varieties of Arabica long grown in the region. Barrington Coffee is an artisan roaster dedicated to elite coffees, fresh delivery and roasting that foregrounds the coffee and not the roast. Visit www.barringtoncoffee.com or call 800-528-0998 for more information.","bottom_line":null,"roaster location":"Lee, Massachusetts","coffee origin":"Gedeo Zone, southern Ethiopia.","roast level":"Medium","agtron":"53\/66","est. price":"$24.95\/16 ounces","review date":"April 2013","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/tchembe-single-origin-espresso\/","with milk":"9","acidity\/structure":null},{"rating":"91","roaster":"Paradise Roasters","title":"Ethiopia Yirgacheffe Natural Idido Misty Valley","blind_assessment":"An exotic, almost violent cup. The aroma is lush with intense, shifting ripe to overripe fruit and floral notes, blueberry most distinctly, with pungent, sweet spice undertones. In the cup the fruit notes turn markedly winy, or perhaps cidery. A fermented version of blueberry remains dominant, but the rich, complexly suggestive fruit notes hint at chocolate as well. A slight, pungent saltiness shadows the cup, but smoothes out reassuringly in a convincingly smooth, long finish.","notes":"A region of lush, rolling hills in south-central Ethiopia, Yirgacheffe is the most celebrated growing region for wet-processed Ethiopia coffee, meaning coffee that has been prepared by removing the fruit before the beans or seeds have been dried, resulting in a cleanly high-toned, intensely floral- and citrus-toned cup. The Yirgacheffe reviewed here, however, is a \"natural\" or dry-processed version of the great Yirgacheffe profile, meaning the beans\/seeds were dried inside the fruit, producing a flavor profile that is lower toned and richer with a giddy, wild, slightly fermented fruit. Like virtually all Ethiopia coffees, this striking and unusual coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Paradise Roasters prides itself on roasting and shipping coffee only after orders are placed. Its metaphoric mission is to bring some paradisiacal warmth from the coffee-growing south to the cool environs of Minnesota. Visit www.paradiseroasters.com or call 763-433-0626 for more information.","bottom_line":null,"roaster location":"Ramsey, Minnesota","coffee origin":"Yirgacheffe growing region, south-central Ethiopia","roast level":"Medium-Light","agtron":"55\/75","est. price":null,"review date":"October 2005","aroma":"9","acidity":"7","body":"7","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-yirgacheffe-natural-idido-misty-valley\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Fratello Coffee Roasters","title":"Panama Mama Cata Natural Process Geisha","blind_assessment":"Deep, minty dark chocolate and sweet but slightly savory port wine notes in aroma and cup. Rich acidity; full, syrupy mouthfeel. The finish is sweet with dark chocolate notes when the cup is hot; as it cools a salty\/savory complication emerges.","notes":"Produced from trees of the rare Ethiopia-derived botanical variety \"Gesha\" or \"Geisha” grown on the Mama Cata Estate, named after a beloved and apparently matriarchal maid of an earlier owner of the estate. With its elongated beans and distinctive floral and chocolate cup, the Gesha variety continues to distinguish itself as one of the world's most unique coffees. \"Natural\" process means the beans were dried inside the fruit rather than after removal of the fruit. Calgary-based Fratello is a second-generation boutique coffee roaster owned by three brothers who focus on responsible trade relationships with coffee growers. Visit www.fratellocoffee.com or call 800-944-2545 for more information.","bottom_line":null,"roaster location":"Calgary, Alberta, Canada","coffee origin":"Boquete growing region, western Panama","roast level":"Medium","agtron":"50\/70","est. price":"CAD $52.50\/12 ounces","review date":"August 2011","aroma":"9","acidity":"8","body":"9","flavor":"10","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/panama-mama-cata-natural-process-geisha\/","with milk":null,"acidity\/structure":null},{"rating":"86","roaster":"CoffeeAM","title":"Yemen Arabian Mocca","blind_assessment":"Medium-bodied, sweet, with the typical wild, slightly fermented Yemen fruit tones, in this case suggesting overripe cherry, apricot, and melon. In the finish the fruit ferment reads as a sort of brandied, bittersweet chocolate. A slight astringency in the finish suggests that during storage this coffee faded a bit, as Yemens quickly do.","notes":"Yemen is the world's oldest commercial coffee, still grown and processed as it was in the 16th century. The small-holding farmers prepare their coffee in the simplest of fashion: pick it and put it out, fruit and all, to dry on the roofs of their stone houses. Yemens can be among the finest coffees in the world, but the finest are difficult to find and quick to fade. CoffeeAM.com claims that \"We're Changing the Way America Buys Coffee.\" Visit www.CoffeeAM.com or call 800-803-7774 for more info.","bottom_line":null,"roaster location":"Woodstock, Georgia","coffee origin":"Central Yemen","roast level":"Medium-Dark","agtron":"38\/46","est. price":null,"review date":"May 2003","aroma":"8","acidity":"7","body":"7","flavor":"8","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/yemen-arabian-mocca\/","with milk":null,"acidity\/structure":null},{"rating":"95","roaster":"GK Coffee","title":"Ethiopia Tamiru Tadesse Tesema Anaerobic Natural","blind_assessment":"Intensely aromatic, richly sweet-savory, deeply floral. Concord grape, lilac, dark chocolate, shiitake mushroom, fresh-cut cedar in aroma and cup. Sweet-savory structure with juicy-bright acidity; plush, syrupy mouthfeel. Resonant, long, flavor-laden finish.","notes":"Produced by Tamiru Tadesse entirely of the 74165 variety of Arabica, and processed by the anaerobic natural method, in which fermentation of the whole fruit occurs in a hermetically sealed vessel. GK Coffee is a nano-roastery in Yilan, Taiwan that offers both retail and wholesale coffee. For more information, visit www.gkcoffee.com.tw or email [email protected].","bottom_line":"A complex, rich-toned, deeply aromatic, sweetly savory Ethiopia processed by the anaerobic natural method.","roaster location":"Yilan, Taiwan","coffee origin":"Sidama growing region, southern Ethiopia","roast level":"Medium-Light","agtron":"62\/78","est. price":"NA (available in store only)","review date":"January 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-tamiru-tadesse-tesema-anaerobic-natural\/","with milk":null,"acidity\/structure":"9"},{"rating":"92","roaster":"CafeTaster","title":"Peru","blind_assessment":"Rich-toned, chocolaty. Baking chocolate, cashew butter, date, magnolia, orange zest in aroma and cup. Sweet-toned with gentle, round acidity; very full, creamy mouthfeel. Finish consolidates to notes of crisp baking chocolate and cashew.","notes":"CafeTaster is a Taiwan-based specialty roaster and certified SCA training facility. For more information, visit www.facebook.com\/cafetaster or email roaster Jerry Huang at [email protected].","bottom_line":"An invitingly sweet, very chocolaty Peru cup with a pleasing crispness and especially plush mouthfeel.","roaster location":"Taipei City, Taiwan","coffee origin":"Cusco Province, Peru","roast level":"Medium-Light","agtron":"58\/77","est. price":"NT $500\/227 grams","review date":"August 2022","aroma":"8","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/peru\/","with milk":null,"acidity\/structure":"8"},{"rating":"91","roaster":"Drink Coffee Do Stuff","title":"Ethiopia Dur Feres","blind_assessment":"Gently fruit-toned, richly wood-framed. Pie cherry, balsa wood, maple syrup, lemon balm, grapefruit zest in aroma and cup. Sweet structure with gentle, round acidity; crisp, silky mouthfeel. Wood-framed finish with tart cherry and grapefruit suggestions.","notes":"Dur Feres, which means \"wild horse\" in Amharic, is a blend of green coffees from several southern Ethiopian wet mills or washing stations, including Bombe, Qonqona, Shantawene, and Damo, all processed by the natural method (coffee is dried in the whole fruit). Drink Coffee Do Stuff operates a roastery in Truckee, California and a coffee shop in nearby Incline Village, Nevada. Visit www.drinkcoffeedostuff.com for more information.","bottom_line":"An invigoratingly tart-leaning natural Ethiopia with integrated and harmonious aromatic wood suggestions throughout.","roaster location":"Truckee, California","coffee origin":"Guji Zone, Oromia Region, southern Ethiopia","roast level":"Light","agtron":"65\/84","est. price":"$22.00\/12 ounces","review date":"February 2023","aroma":"8","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-dur-feres\/","with milk":null,"acidity\/structure":"8"},{"rating":"77","roaster":"Starbucks","title":"Colombia VIA Instant Coffee","blind_assessment":"In the aroma faint but complex suggestions of butter, nut, fruit and dark chocolate peer out from under a burned or steamed wood sensation. Acidity is bitterish with some hints of tart sweetness. The body is full in weight, slightly leanish in mouthfeel. The burned or steam-scorched wood sensation dominates in the cup, sitting on continued, potentially pleasing hints of fruit and dark chocolate. Clean short finish: sweet, rich, simple, but a mildly astringent version of the scorched wood note reasserts itself in the long.","notes":"An instant coffee evaluated as mixed in proportions of 2.5 grams to 150 ml or 5 ounces of hot water. Assuming a larger cup size and a more generous 3 grams (one packet) per serving, this product costs approximately one dollar per serving. Consists mainly of spray-dried instant coffee with the addition of very finely, “micro” ground roast coffee. We cupped a Starbucks whole bean 100% Colombia purchased at the same supermarket from which we purchased the VIA instant version and rated it 84. Visit www.starbucks.com for more information. Visit www.starbucks.com for more information.","bottom_line":null,"roaster location":"Seattle, Washington","coffee origin":"Colombia. All coffee of the Arabica species.","roast level":"NA","agtron":"0\/0","est. price":"$7.99\/0.94 oz. instant","review date":"March 2011","aroma":"5","acidity":"5","body":"7","flavor":"5","aftertaste":"5","url":"https:\/\/www.coffeereview.com\/review\/colombia-via-instant-coffee\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Dante Coffee","title":"D31 The New Life","blind_assessment":"Evaluated as espresso. Assertively sweet, fruity, spicy. Ripe banana, baking chocolate, allspice, lemon drop, dried lavender and narcissus in aroma and small cup. The mouthfeel is syrupy though drying, the finish rich-toned though rather drying and heavyish in the long. In three-parts milk the coffee balances nicely, with high-toned sweetness and florals showing with pleasing clarity.","notes":"This is a blend of wet-processed Ethiopia Sidamo and washed and wet-hulled Sumatra Mandheling. Founded in 1993, Dante Coffee now has 120 coffee shops shops in Taiwan, 20 in Indonesia, five in Kuwait, and one in Saudi Arabia. The company aims to provide customers with the highest-quality coffee and meals at affordable prices. Visit http:\/\/www.dante.com.tw for more information.","bottom_line":"An undeniably powerful espresso, and an interesting and engaging interpretation of the ancient Mocha-Java blend concept, combining fruit and flowers from an Ethiopia\/Yemen coffee with rich spice and sweet depth from an Indonesia.","roaster location":"Taipei City, Taiwan","coffee origin":"Ethiopia; Sumatra","roast level":"Medium-Light","agtron":"54\/69","est. price":"NTD $300\/200 grams","review date":"September 2019","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/d31-the-new-life\/","with milk":"9","acidity\/structure":null},{"rating":"76","roaster":"La Flor del Cafe","title":"Green","blind_assessment":"Most found this Antigua a bit underpowered, perhaps owing to its relatively light body (noted by almost everyone). Some found compensating virtues: chocolaty, spicy, nutty notes. Others praised a soft, sweet smoothness. Still others objected: \"a bit lifeless\"; \"not so happening\"; \"thin\"; and most Originsal, \"straightlaced[!]\". Only two found outright failings: a slight sourness. One delivered an inspired characterization of the subtle fragrance: \"Dancing on fruity.\"","notes":"Light body with chocolaty, spicy and nutty notes. Originally reviewed by a panel as a green coffee.","bottom_line":null,"roaster location":"Guatemala","coffee origin":null,"roast level":"Medium-Dark","agtron":"39\/45","est. price":null,"review date":"July 1997","aroma":"5.8","acidity":"4.9","body":"5.2","flavor":"5.3","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/green-7\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Oceana Coffee","title":"Ethiopia Honey Yirgacheffe Koke","blind_assessment":"Fruit-forward, deep-toned. Blueberry jam, dark chocolate, magnolia, lemon verbena, maple syrup in aroma and cup. Sweet structure with pert acidity; full, syrupy mouthfeel. The berry-driven finish is supported by suggestions of dark chocolate and lemon verbena.","notes":"Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional landrace varieties of Arabica long grown in the region. Processed by the natural method (dried in the whole fruit). Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana reports that its staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, aimed at ensuring that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.","bottom_line":"Like blueberries? If so, you’ll enjoy this cleanly natural-processed Yirgacheffe cup with dark chocolate undertones.","roaster location":"Tequesta, Florida","coffee origin":"Yirgacheffe growing region, south-central Ethiopia","roast level":"Medium-Light","agtron":"60\/77","est. price":"$22.00\/12 ounces","review date":"January 2021","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-honey-yirgacheffe-koke\/","with milk":null,"acidity\/structure":"8"},{"rating":"95","roaster":"Dragonfly Coffee Roasters","title":"Finca La Aurora Camilina Geisha","blind_assessment":"Massively complex: original; brisk yet juicy. Lilac, tropical fruit, floral-toned herb, vanilla, frankincense in aroma and cup. Big, richly juicy acidity; syrupy mouthfeel. Flowers and fruit leave the herbs and incense behind in a long, shimmering finish.","notes":"Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also Geisha) by farmer Roberto Brenes of Auromar Estate. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This is a dry-processed or “natural” Gesha, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.","bottom_line":null,"roaster location":"Boulder, Colorado","coffee origin":"Piedra Candela, Chiriqui Province, far western Panama.","roast level":"Light","agtron":"62\/88","est. price":"$48.50\/8 ounces","review date":"April 2015","aroma":"9","acidity":"9","body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/finca-la-aurora-camilina-geisha\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Kasasagi Coffee Roasters","title":"Syunmei Espresso Blend","blind_assessment":"Evaluated as espresso. Richly sweet-tart. Bing cherry, dark chocolate, fir, almond, gardenia in aroma and small cup. Crisp, velvety mouthfeel; chocolaty, wood-toned finish. Notes of dark chocolate and gardenia lead in cappuccino-scaled milk.","notes":"A blend of coffees from four origins roasted for espresso applications. Kasasagi is a Taiwan-based company that specializes in roasting “Japanese-style” coffees. Visit https:\/\/www.facebook.com\/Kasasagicoffee\/ for more information.","bottom_line":"A friendly, accessible espresso blend with tart fruit and dark chocolate notes. Especially attractive in cappuccino format.","roaster location":"Taipei, Taiwan","coffee origin":"Ethiopia; Panama; Guatemala; El Salvador","roast level":"Medium-Light","agtron":"54\/77","est. price":"NT $500\/200 grams","review date":"June 2022","aroma":"8","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/syunmei-espresso-blend\/","with milk":"9","acidity\/structure":null},{"rating":"94","roaster":"Jaunt Coffee Roasters","title":"Ethiopia Bensa Asefa Qonqana","blind_assessment":"Juicy, bright, delicate, balanced. Apricot, dark chocolate, lilac, maple syrup, almond butter in aroma and cup. Crisply sweet-tart with crisp, citrusy acidity; vibrantly silky mouthfeel. Chocolaty, fruit-toned finish with hints of lilac.","notes":"Produced from indigenous Ethiopia landrace varieties of Arabica by smallholding farmers surrounding the Qonqana Washing Station operated by the Daye Bensa group, and processed by the traditional washed method (fruit skin and flesh are removed from the beans before they are dried). Jaunt Coffee Roasters is a San Diego-based roaster and café with an extensive coffee and food menu. Visit www.jauntcoffee.com for more information.","bottom_line":"An harmonious, inviting washed Ethiopia cup in which fruit, flowers and chocolate gracefully commingle.","roaster location":"San Diego, California","coffee origin":"Sidamo (also Sidama) growing region, south-central Ethiopia","roast level":"Light","agtron":"64\/86","est. price":"$26.00\/12 ounces","review date":"March 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-bensa-asefa-qonqana\/","with milk":null,"acidity\/structure":"9"},{"rating":"98","roaster":"GK Coffee","title":"GW01 Finca Sophia Olympus Geisha","blind_assessment":"Graceful, polished, exquisitely floral. Lavender, vanilla bean, bergamot, cocoa nib, lychee in aroma and cup. Delicate, vivid, multi-layered structure with elegantly sweet-tart acidity; very silky, buoyant mouthfeel. Elongated, richly floral, complex finish.","notes":"This exceptional coffee was selected as the No. 1 coffee on Coffee Review’s list of the Top 30 Coffees of 2020. The coffee won first place in the washed Geisha category of the 2020 Best of Panama green coffee competition and was subsequently sold at auction for a price that broke all previous records for a green coffee. Produced at Finca Sophia entirely from trees of the celebrated Geisha variety of Arabica. This is a wet-processed or “washed” version, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. GK Coffee is a nano-roastery in Yilan, Taiwan that offers both retail and wholesale coffee. Only sold via email request. For more information, visit www.gkcoffee.com.tw or email [email protected].","bottom_line":"This Best of Panama winner also won us over with its layers of floral tones (lavender, violet, jasmine, freesia) delicately ensconced in cocoa and tropical fruit notes, all complicated by a lightly bracing bittersweet citrus.","roaster location":"Yilan, Taiwan","coffee origin":"Nueva Suiza, Chiriquí, Panama","roast level":"Medium-Light","agtron":"58\/76","est. price":"NT $5,000\/20 grams","review date":"November 2020","aroma":"10","acidity":null,"body":"9","flavor":"10","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/gw01-finca-sophia-olympus-geisha\/","with milk":null,"acidity\/structure":"10"},{"rating":"95","roaster":"Kakalove Cafe","title":"Kenya Gitare AA TOP","blind_assessment":"Sweetly bright, richly savory. Narcissus, pink grapefruit zest, ripe blackberry, cocoa nib, salted caramel in aroma and cup. Sweet-savory, complex structure with juicy acidity; plush, very syrupy mouthfeel. Narcissus and salted caramel notes lead in the long, resonant finish.","notes":"Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.","bottom_line":"A superb version of the beloved Kenya cup with deep berry and bittersweet citrus supported by an umami, salted-caramel throughline.","roaster location":"Chia-Yi, Taiwan","coffee origin":"Embu County, Eastern Province, Kenya","roast level":"Light","agtron":"62\/80","est. price":"NT $340\/8 ounces","review date":"November 2022","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/kenya-gitare-aa-top\/","with milk":null,"acidity\/structure":"9"},{"rating":"88","roaster":"Capricorn Coffees","title":"Organic Fair Trade Sumatra Gayoland","blind_assessment":"Sweet, rich, with an impressive balance of dry acidy notes and sweetness. A combination of slightly fermented fruit and musty earthiness reads here as a fine intrigue of papaya, raisins and chocolate.","notes":"A traditionally processed Sumatra from the gigantic Gayo Mountain cooperative. Capricorn Coffees is one of the earliest established specialty coffee roasters in the San Francisco area, and in the United States generally. Visit www.capricorncoffees.com or call 800-541-0758 for more information.","bottom_line":null,"roaster location":"San Francisco, California","coffee origin":"Aceh Province, northern Sumatra","roast level":"Medium-Dark","agtron":"42\/53","est. price":null,"review date":"September 2004","aroma":"8","acidity":"7","body":"7","flavor":"8","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/organic-fair-trade-sumatra-gayoland\/","with milk":null,"acidity\/structure":null},{"rating":"86","roaster":"Safeway Select","title":"Colombia Medium Roast","blind_assessment":"Deep-toned, simple aroma with fir and molasses notes. In the cup low-toned acidity, syrupy mouthfeel, continued fir and molasses notes, caramel, and perhaps a slight fruity tartness suggesting dry berry or tamarind. Sweet, simple, rich finish.","notes":"Available whole-bean in bulk at many Safeway supermarkets. In early October 2008 on sale for $7.99 per pound; normally $10.64 per pound. Safeway is the third-largest supermarket chain in the United States, with nearly 1,800 stores in western and central United States and western Canada. Visit www.safeway.com for more information.","bottom_line":null,"roaster location":"Pleasanton, California","coffee origin":"Colombia.","roast level":"Medium","agtron":"56\/64","est. price":null,"review date":"October 2008","aroma":"7","acidity":"7","body":"8","flavor":"7","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/colombia-medium-roast\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Taster's Coffee","title":"Ethiopia Guji Shakisso Mormora Estate Natural","blind_assessment":"Evaluated as espresso produced as a “ristretto” 25ml (.85-ounce) shot using a Nespresso capsule espresso brewer with whole milk heated using a conventional steam wand. Delicately sweet, citrus-toned. Tangerine zest, cocoa nib, jasmine, almond, cherry blossom in aroma and small cup. Crisp, silky mouthfeel; cocoa-toned, citrusy finish. In three parts milk, cocoa notes move forward while tangerine falls back to a supporting role.","notes":"Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian landrace varieties of Arabica long grown in the region. Processed by the natural method (dried in the whole fruit). Taster’s Coffee is a nano-roaster based in New Taipei City, Taiwan. Visit www.tasterscoffee.com for more information.","bottom_line":"An engaging natural-processed Ethiopia in Nespresso-compatible format, especially appealing in the bright, cocoa-toned straight shot.","roaster location":"New Taipei City, Taiwan","coffee origin":"Guji Zone, Oromia Region, Southern Ethiopia","roast level":"NA","agtron":"0\/0","est. price":"NT $280\/10 capsules","review date":"October 2021","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-guji-shakisso-mormora-estate-natural\/","with milk":"9","acidity\/structure":null},{"rating":"93","roaster":"GivCOFFEE","title":"Rwanda Karongi Gitesi","blind_assessment":"Deeply sweet and chocolaty with a savory edge. Honey, chocolate, lilac, mulberry in aroma and cup. Delicately brisk acidity; syrupy mouthfeel. Chocolate and honey in particular saturate a crisp, rich finish.","notes":"From trees of the heirloom Bourbon variety and processed at prize-winning Gitesi mill. Rwanda's impressive potential as fine coffee producer has come to fruition over the past decade owing to the industry of its growers, generous support from international aid agencies, and the commitment of North American specialty coffee roasters. GivCOFFEE is dedicated to three goals: to provide quality coffee, to provide a fair price to farmers, and to give back to those in need. GivCOFFEE donates two dollars of every retail bag sold. Visit www.givcoffee.com or call 860-874-5301 for more information.","bottom_line":null,"roaster location":"Torrington, Connecticut","coffee origin":"Kirambo, Karongi District, Rwanda.","roast level":"Medium","agtron":"50\/63","est. price":"$14.50\/12 ounces","review date":"May 2014","aroma":"9","acidity":"9","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/rwanda-karongi-gitesi-3\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Magnolia Coffee","title":"Jade Nitro Espresso Cold Brew","blind_assessment":"A ready-to-drink black coffee, tested cold. Richly chocolaty, boldly nut-toned, deeply sweet. Chocolate fudge, rhododendron, black cherry, fresh-cut fir, molasses. Sweet-toned structure with mild acidity; crisp, satiny-smooth mouthfeel. The chocolaty finish is supported by rhododendron and fresh-cut fir. With a splash of whole milk, fudge-like chocolate notes and undertones of black cherry win the day.","notes":"This coffee tied for the third-highest rating in a tasting of ready-to-drink black coffees for Coffee Review’s July 2020 tasting report. Brewed hot, then flash-chilled and bottled. The green coffee used is Magnolia’s Jade Espresso Blend, which consists of a Brazil semi-washed coffee, a washed Uganda and Colombia, and an El Salvador natural. Post-roast, a natural Ethiopia Yirgacheffe is added. Nitrogen gas is used throughout the whole system, including flushing the kegs and pushing the draft coffee into bottles. Contains no additives or ingredients other than coffee and water. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft roasted. Truly delicious. Socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs.Visit www.magnoliacoffeeco.com or for more information.","bottom_line":"Magnolia’s classic espresso blend, repurposed as rich, chocolaty, nutty, deep-flavored cold brew.","roaster location":"Charlotte, North Carolina","coffee origin":"Brazil; Uganda; Colombia; El Salvador; Ethiopia","roast level":"NA","agtron":"0\/0","est. price":"$18.00\/4-12-ounce bottles; 32 ounces\/$12; 64-ounces\/$20.00","review date":"July 2020","aroma":null,"acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/jade-nitro-espresso-cold-brew\/","with milk":"9","acidity\/structure":"8"},{"rating":"87","roaster":"Graffeo Coffee","title":"Dark Roast (reviewed as espresso)","blind_assessment":"Reader Derick Miller called Graffeo to my attention, testifying that this groupof three small in-store roasters produces \"great coffee.\" I brewed this dark-roasted version of theGraffeo blend as espresso and found it medium-bodied, smooth in mouthfeel, sweet but crisplyroasty. In small milk the bittersweetness read as a dry, smoky chocolate; in larger milk as adelicately sweet but rather dilute chocolate.","notes":"For years Graffeo has been one of San Francisco's cult coffee roasters, a small, second-generation family-owned business in the traditional Italian neighborhood of North Beach. Graffeonow has added single-store roasting locations in San Rafael and Beverly Hills, California. Graffeoproduces two versions of a single blend, light-roasted and this dark-roasted version. Visit www.graffeo.com or call 800-222-6250 for more info.","bottom_line":null,"roaster location":"San Francisco, California","coffee origin":"Colombia; Costa Rica; Papua New Guinea.","roast level":"Very Dark","agtron":"32\/30","est. price":null,"review date":"January 2003","aroma":"8","acidity":"7","body":"8","flavor":"6","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/dark-roast-reviewed-as-espresso\/","with milk":null,"acidity\/structure":null},{"rating":"95","roaster":"Bird Rock Coffee Roasters","title":"Colombia El Chaferote Pink Bourbon","blind_assessment":"Balanced, brightly sweet. Tangerine, bay leaf, cocoa nib, narcissus, fresh-cut oak in aroma and cup. High-toned acidity; crisp, syrupy mouthfeel. Long, lingering resonant finish.","notes":"This exceptional coffee was selected as the No. 20 coffee on Coffee Review’s list of the Top 30 Coffees of 2023. Produced by Luis Gerardo Bravo Ordonez of Finca El Chaferote, entirely of the Pink Bourbon variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Bird Rock Coffee Roasters is a retailer and wholesaler focused on organic and socially responsible coffees; it was named the “2012 Micro Roaster of the Year” by Roast Magazine. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.","bottom_line":"A compelling rendition of Pink Bourbon with distinct citrus, cocoa nib, and spicy floral tones — especially lively, juicy acidity.","roaster location":"San Diego, California","coffee origin":"Huila Department, Colombia","roast level":"Medium-Light","agtron":"63\/77","est. price":"$28.00\/10 ounces","review date":"September 2023","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/colombia-el-chaferote-pink-bourbon\/","with milk":null,"acidity\/structure":"9"},{"rating":"91","roaster":"JBC Coffee Roasters","title":"Miravalle Honduras","blind_assessment":"Sweetly and gently brisk. Brown sugar, almond, honeysuckle, peach, roasted cacao nib in aroma and cup. Delicate, brisk acidity; very lightly silky mouthfeel. Flavor consolidates around peach and cacao nib in a quiet finish.","notes":"Honduras had dramatically increased both volume and quality of coffee production over the past several years. JBC Coffee Roasters (formerly Johnson Brothers Coffee Roasters) is a distinguished small-batch roasting company. Visit www.jbccoffeeroasters.com or call 608-256-5282 for more information.","bottom_line":null,"roaster location":"Madison, Wisconsin","coffee origin":"Francisco Morazán Department, central Honduras.","roast level":"Light","agtron":"63\/83","est. price":"$14.25\/12 ounces","review date":"October 2014","aroma":"9","acidity":"8","body":"7","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/miravalle-honduras\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"ICC","title":"Lintong Blue Batak","blind_assessment":"Immensely spicy, rich. Ripe fig, fresh-cut fir, moist tobacco, cumin, a hint of orange blossom in aroma and cup. Bright, lightly tart acidity; plush, velvety mouthfeel. Flavor consolidates to tobacco and dried fig in a crisply drying finish.","notes":"This coffee tied for the second-highest rating in a cupping of Sumatra coffees for Coffee Review‘s July 2016 tasting report.","bottom_line":"A deep-toned, complexly expressive Sumatra in which an unusual but inviting spice note emerges, suggesting cumin in its sweetly drying richness.","roaster location":"Taipei City, Taiwan","coffee origin":"Lintong growing region, North Sumatra Province, Indonesia","roast level":"Medium-Light","agtron":"56\/75","est. price":"NT $500\/227 grams","review date":"July 2016","aroma":"9","acidity":"8","body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/lintong-blue-batak\/","with milk":null,"acidity\/structure":null},{"rating":"93","roaster":"Buon Caffe","title":"Ethiopia Guji Hamela Buku Abel Washed Process","blind_assessment":"Complex, delicate, sweetly tart. Star jasmine, pink grapefruit zest, white peach, cedar, bay leaf in aroma and cup. Crisp, sweetly tart structure with bright acidity; silky-smooth mouthfeel. Grapefruit, white peach and cedar notes lead in the layered finish.","notes":"Southern Ethiopia coffees like this one are produced largely from traditional Ethiopian landrace varieties of Arabica long grown in the region. Processed by the wet or washed method (fruit skin and pulp removed before drying). Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.","bottom_line":"A classic representation of the washed southern Ethiopia type, citrusy and floral with rich aromatics throughout.","roaster location":"Taipei, Taiwan","coffee origin":"Guji growing region, south-central Ethiopia","roast level":"Medium-Light","agtron":"62\/79","est. price":"NT $329\/8 ounces","review date":"December 2022","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-guji-hamela-buku-abel-washed-process\/","with milk":null,"acidity\/structure":"9"},{"rating":"93","roaster":"Crimson Cup Coffee & Tea","title":"Ethiopia Kossa Kebena","blind_assessment":"Deeply sweet, enticingly rich. Peach, lime zest, almond, violet, roasted cacao nib in aroma and cup. Sweet, juicy acidity; plush, velvety mouthfeel. The nuanced, resonant finish consolidates around peach and roasted cocoa nib.","notes":"Certified organic. Limu is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the area. This is a “natural” or dry-processed version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Crimson Cup is a micro-roaster based in Columbus dedicated to offering high quality coffee and to helping independent cafes brew and serve it better. Visit www.crimsoncup.com or call 614-262-6212 for more information.","bottom_line":"A fruit-driven, harmoniously balanced Ethiopia natural.","roaster location":"Columbus, Ohio","coffee origin":"Limu Kossa District, Oromia Region, southern Ethiopia","roast level":"Medium-Light","agtron":"58\/82","est. price":"$16.50\/12 ounces","review date":"September 2016","aroma":"9","acidity":"8","body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-kossa-kebena\/","with milk":null,"acidity\/structure":null},{"rating":"94","roaster":"Old World Coffee Roasters","title":"Ethiopia Halo Hartume Daniel Mijane","blind_assessment":"Delicately vibrant, crisply sweet-tart. Peach, cocoa nib, lilac, pink grapefruit zest, pistachio in aroma and cup. Balanced, sweetly tart in structure; richly silky mouthfeel. The satisfying finish consolidates to notes of cocoa-toned stone fruit.","notes":"Southern Ethiopia coffees like this one are largely produced from traditional Ethiopian varieties of Arabica long grown in the region. This lot was processed by the wet or washed method (fruit skin and pulp are removed before drying). Southern Ethiopia coffees processed with this method typically express great aromatic complexity and intensity, with a particular emphasis on floral notes. Old World Coffee Roasters is a specialty coffee roaster with cafes in Reno and Carson City, Nevada. Visit OldWorldCoffeeRoasters.com for more information.","bottom_line":"A high-toned, elegant washed Yirgacheffe cup with a floral and stone fruit throughline.","roaster location":"Reno, Nevada","coffee origin":"Yirgacheffe growing region, southern Ethiopia","roast level":"Medium-Light","agtron":"58\/78","est. price":"$19.00\/12 ounces","review date":"March 2021","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-halo-hartume-daniel-mijane\/","with milk":null,"acidity\/structure":"9"},{"rating":"94","roaster":"Kakalove Cafe","title":"Ethiopia Guji Bishala","blind_assessment":"Delicately sweet-tart, floral-toned. Narcissus, apricot, cocoa nib, lemon verbena, frankincense in aroma and cup. Sweet-tart structure with delicately juicy acidity; very full, syrupy mouthfeel. Cocoa nib and narcissus focus the long, lingering finish.","notes":"Southern Ethiopia coffees like this one are largely produced from distinctive indigenous Ethiopian varieties of Arabica long grown in their respective regions. Processed by the wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.","bottom_line":"An elegant, floral-driven washed-process Ethiopia cup that presents in the cup with quiet confidence.","roaster location":"Chia-Yi, Taiwan","coffee origin":"Guji Zone, Oromia Region, southern Ethiopia","roast level":"Medium-Light","agtron":"58\/76","est. price":"NT $290\/8 ounces","review date":"August 2020","aroma":"9","acidity":null,"body":"9","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/ethiopia-guji-bishala\/","with milk":null,"acidity\/structure":"9"},{"rating":"92","roaster":"The Coffee Academics","title":"Greenwell Estate Hawaii Kona Peaberry Natural","blind_assessment":"Deep, sweet, complexly fruit-toned. Musky lily, dark chocolate, strawberry, watermelon, roasted almond in aroma and cup. Round, vibrant acidity; full, syrupy mouthfeel. Fruit and almond carry into a richly drying finish.","notes":"This coffee was produced by Greenwell Farms, one of the oldest coffee farms and mills in Kona, still owned and operated by Tommy Greenwell, a direct descendent of the founders. It was processed by the “natural” method, in which the coffee is dried inside the whole fruit, rather than by the more orthodox “washed” method, in which the soft fruit residue is removed before the beans are dried. The Coffee Academïcs has been a purveyor and roaster of specialty coffee in Hong Kong since 2012. Visit www.the-coffeeacademics.com or call +852-3104-0075 for more information.","bottom_line":null,"roaster location":"Hong Kong, China","coffee origin":"Kona growing region, Big Island of Hawaii","roast level":"Medium-Light","agtron":"60\/81","est. price":"$32.50\/165 grams","review date":"October 2015","aroma":"9","acidity":"8","body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/greenwell-estate-hawaii-kona-peaberry-natural\/","with milk":null,"acidity\/structure":null},{"rating":"84","roaster":"Allegro Coffee Roasters","title":"Organic Papua New Guinea","blind_assessment":"High, wild, winy notes rip through this coffee, first thrilling us, then turning uncomfortably lush in the finish, finally leveling out in a relatively clean aftertaste. American coffee culture hasn't made up its mind about this overripe, edge-of-compost taste. Is it a strange and wonderful gift of nature to be treasured, like the carefully cultivated mold in certain cheeses? Or do we dismiss it as a symptom of poorly-handled coffee?","notes":"High, wild, winy notes rip through this coffee, first thrilling, then turning uncomfortably lush in the finish, finally leveling out in a relatively clean aftertaste. Certified organically grown. Produced by small growers. Unlike estate New Guineas, which are wet-processed, this coffee has been dry-processed, which means the coffee was dried with the fruit clinging to the beans.","bottom_line":null,"roaster location":"Boulder, Colorado","coffee origin":null,"roast level":"Medium","agtron":"52\/62","est. price":null,"review date":"November 1997","aroma":"6","acidity":"7","body":"5","flavor":"7","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/organic-papua-new-guinea\/","with milk":null,"acidity\/structure":null},{"rating":"83","roaster":"Mayorga Coffee Roasters","title":"India Monsooned Malabar","blind_assessment":"Dense, heavy aroma: fresh-cut pine, Mediterranean herbs, with an elusive hint of fruit - pear perhaps. In the cup an unusually heavy, rather gritty body, bitter walnut tones and distinct pine and resiny herb notes - rosemary perhaps.","notes":"Monsooned Malabar is a fruity dry-processed coffee from India that is exposed to moisture-laden monsoon winds for three months after drying and processing but before shipping. Monsooning turns the beans puffily yellow, reduces the dry, acidy sensation, increases body, and often adds an earthy mildewed flavor to the fruity character of the original beans. Despite the words \"Medium Roast\" in the coffee name, this sample was rather dark roasted for a Monsooned coffee, a coffee type that is usually brought to a lighter roast. Mayorga Coffee Roasters is a distinguished wholesale roaster, retailer, and Internet seller of coffee and coffee accessories. Visit www.mayorgacoffee.com or call 877-526-3322 for more information.","bottom_line":null,"roaster location":"Rockville, Maryland","coffee origin":"Southern India","roast level":"Medium-Dark","agtron":"35\/47","est. price":null,"review date":"July 2004","aroma":"7","acidity":null,"body":"8","flavor":"7","aftertaste":null,"url":"https:\/\/www.coffeereview.com\/review\/india-monsooned-malabar-4\/","with milk":null,"acidity\/structure":null},{"rating":"92","roaster":"Mr. Chao Coffee","title":"414 Kenya SL34","blind_assessment":"Chocolaty, crisply sweet. Baking chocolate, date, almond, cedar, agave syrup in aroma and cup. Sweet structure with pert acidity; satiny mouthfeel. The finish centers around notes of baking chocolate and almond with cedar undertones.","notes":"Despite grower discontent, unclear government coffee policy and urban encroachment on prime coffee lands, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world's most elegant and distinctive coffees. Mr. Chao Coffee is a subsidiary of Intekeco Co., Ltd, based in New Taipei City, Taiwan, which provides both green and roasted coffee to wholesale and retail clients. Visit https:\/\/chao-coffee.webnode.tw\/zh-tw\/ for more information.","bottom_line":"A rich, crisply chocolaty Kenya cup. Pleasing nut and dried fruit notes throughout.","roaster location":"New Taipei City, Taiwan","coffee origin":"Kenya","roast level":"Medium-Light","agtron":"57\/73","est. price":"NT $200\/453 grams","review date":"October 2021","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/414-kenya-sl34\/","with milk":null,"acidity\/structure":"8"},{"rating":"92","roaster":"Stumptown Coffee Roasters","title":"El Salvador Las Nubitas","blind_assessment":"A delicately intense, sweetly acidy cup. In the aroma spicy and floral with milk chocolate undertones. Perfectly balanced and lyric in the cup, with floral notes and a sweet, high-toned temperate fruit, pear or cherry. The chocolate resurfaces in the long, gently astringent finish.","notes":"A prize winner in the 2004 El Salvador Cup of Excellence competition, where as a green (unroasted) coffee it placed third out of hundreds of entries, attracting a score of 90-plus from an international jury. Produced from trees of the heirloom Bourbon variety of arabica on the Las Nubitas farm at a growing altitude of approximately 4,900 feet. Stumptown Coffee is a small-batch premium roasting company that wholesales its coffees as well as serves them in French press format in its three Portland cafes. Under the youthful and enthusiastic leadership of Duane Sorenson, Stumptown has become a leading buyer and supporter of Cup of Excellence coffees. Visit www.stumptowncoffee.com or call 503-230-7797 for more info.","bottom_line":null,"roaster location":"Portland, Oregon","coffee origin":"Las Nubitas Farm, El Salvador","roast level":"Medium","agtron":"53\/63","est. price":"NA","review date":"November 2004","aroma":"8","acidity":"8","body":"8","flavor":"9","aftertaste":"9","url":"https:\/\/www.coffeereview.com\/review\/el-salvador-las-nubitas\/","with milk":null,"acidity\/structure":null},{"rating":"88","roaster":"Allegro Coffee","title":"Nicaragua Selva Negra","blind_assessment":"A balanced aroma combining mild tanginess with a mild, toasty sweetness. The acidity is balanced as well, softly sweet yet brisk. Medium to full bodied, with flavors of bright summer fruit and sweet chocolate. The sweet chocolate carries into a delicate finish.","notes":"This coffee is certified organically grown and Rainforest Alliance certified, meaning it was produced following sustainable ecological and socio-economic criteria developed by the Sustainable Agricultural Network, a coalition of independent, environment-focused non-governmental organizations. It was produced on the Selva Negra (Black Forest) farm, a name that reflects the nostalgia of this pioneering coffee farm's 19th century German founders. In the 21st century its fourth-generation owners have reinvented Selva Negra as a celebrated agri-tourism destination, a completely self-sufficient, sustainable farm community with extensive forest reserves and a very characteristic Nicaragua coffee. Allegro Coffee, a subsidiary of Whole Foods Market, offers one of the country's largest selections of single-origin coffees. Visit www.allegrocoffee.com or call 800-227-1107 for more information.","bottom_line":null,"roaster location":"Thornton, Colorado","coffee origin":"Matagalpa, Nicaragua","roast level":"Medium-Light","agtron":"54\/72","est. price":null,"review date":"September 2008","aroma":"8","acidity":"7","body":"7","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/nicaragua-selva-negra-2\/","with milk":null,"acidity\/structure":null},{"rating":"91","roaster":"Bacca Cafe","title":"El Salvador Natural Finca Malacara","blind_assessment":"Evaluated as espresso. Ken (93) and his co-taster (88) went rather different ways on this deep, sweet, brandyish, lightly herby dried-in-the-fruit profile. Ken enjoyed the overripe, fermenty fruit notes in aroma and cup; his co-taster was not greatly impressed. Both had good things to say about the mouthfeel (co-taster: “huge and enveloping”); on the other hand, neither were impressed by the rather astringent finish. Ken admired the impact in three parts milk (“juicy and rich”) more than did his co-taster, who found it pleasantly berryish but a bit too tart.","notes":"This is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Bacca Café is a Taiwanese family-owned small café that roasts its own coffee and bakes its own pastries with great respect for the quality and provenance of green coffees and bakery ingredients. Call +886-6-580-2009 for more information.","bottom_line":null,"roaster location":"Tainan City, Taiwan","coffee origin":"Volcan de Santa Ana regioin, El Salvador.","roast level":"Medium","agtron":"50\/64","est. price":"NT $600\/8 ounces","review date":"May 2013","aroma":"9","acidity":null,"body":"9","flavor":"8","aftertaste":"7","url":"https:\/\/www.coffeereview.com\/review\/el-salvador-natural-finca-malacara\/","with milk":"9","acidity\/structure":null},{"rating":"90","roaster":"GreenAlives","title":"Espresso Blend Spring 14","blind_assessment":"Evaluated as espresso. Striking flavors. Oak, banana, lavender, dark chocolate, apricot, lime zest in aroma and small cup. Full in texture though a bit sharp in mouthfeel. Dark chocolate and lavender carry into a richly drying finish. Sweet and flavor-saturated in three parts milk.","notes":"GreenAlives is a Taiwan small-batch roasting company located in the Taishan District of New Taipei City that pursues quality in every act of coffee production from green coffee selection through storage, roasting and educating customers in optimum brewing practice. Visit www.greenalives.com or call +886-0921-884-579 for more information.","bottom_line":null,"roaster location":"New Taipei City, Taiwan","coffee origin":"Yirgacheffe, Ethiopia; Kenya; Central America.","roast level":"Medium","agtron":"49\/58","est. price":"NT$300\/8 ounces","review date":"January 2014","aroma":"8","acidity":null,"body":"7","flavor":"8","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/espresso-blend-spring-14\/","with milk":"9","acidity\/structure":null},{"rating":"91","roaster":"Revel Coffee","title":"Brazil Paulo Ribeiro Rocha","blind_assessment":"Delicate, richly sweet. Caramel, cherry, roasted cacao nib, narcissus, a hint of cumin in aroma and cup. Mild, rounded acidity; crisp, satiny mouthfeel. The short but resonant finish consolidates to cocoa and spice tones.","notes":"Produced by Paulo Ribeiro Rocha Revel from trees of the Acaia, Catuai and Bourbon varieties of Arabica. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Revel Coffee is a micro-roaster located in Billings, Montana. Its motto: “Quality is paramount — a difference you can revel in.” Visit www.revelcoffee.com or call 406-534-9621 for more information.","bottom_line":"An accessible, deeply sweet, caramel-toned Brazil cup. Those who avoid aggressive acidity but enjoy a lighter-roasted, very gently bright cup should particularly value this selection.","roaster location":"Billings, Montana","coffee origin":"Mantiqeiras de Minas growing region, Minas Gerais State, Brazil","roast level":"Medium-Light","agtron":"55\/75","est. price":"$15.00\/12 ounces","review date":"August 2017","aroma":"9","acidity":null,"body":"8","flavor":"9","aftertaste":"8","url":"https:\/\/www.coffeereview.com\/review\/brazil-paulo-ribeiro-rocha\/","with milk":null,"acidity\/structure":"7"}]